
&НаКлиенте
Процедура Установить(Команда)
	Если ЗначениеЗаполнено(СтатусЭтапа) Тогда
		ОповеститьОВыборе(СтатусЭтапа);
	Иначе
		Сообщить("Не выбран статус документа ""Этап производства""!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтатусЭтапа") Тогда
		СтатусЭтапа = Параметры.СтатусЭтапа;
	КонецЕсли;
		
КонецПроцедуры
