
&Вместо("ВызватьИсключениеЕслиНетПраваАдминистрирования")
Процедура Рин1_ВызватьИсключениеЕслиНетПраваАдминистрирования()
	
	//Если ОбщегоНазначения.РазделениеВключено()
	//	И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
	//	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
	//		ВызватьИсключение НСтр("ru = 'Нарушение прав доступа.';
	//		|en = 'Access right violation.'");
	//	КонецЕсли;
	//Иначе
	//	Если НЕ ПривилегированныйРежим() Тогда
	//		Если не УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
	//			ВыполнитьПроверкуПравДоступа("Администрирование", Метаданные);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
///20200930 ГлазуновДВ Отключили Проверку на права Запуска Регламентного Задания для пользователей Вручную	
КонецПроцедуры
