
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.Объект.ОсновнойВариантПараметров) Тогда
		
		ПараметрыФормы.Вставить("Ключ", ПараметрыВыполненияКоманды.Источник.Объект.ОсновнойВариантПараметров);
		
	Иначе
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Наименование",        "Первичный вариант");
		ЗначенияЗаполнения.Вставить("Владелец",            ПараметрыВыполненияКоманды.Источник.Объект.Владелец);
		ЗначенияЗаполнения.Вставить("НоменклатураПроекта", ПараметрыВыполненияКоманды.Источник.Объект.Ссылка);
		
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.гиг_ВариантыПараметровНоменклатурыПроекта.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
