Функция ИзменитьСтрокуВТаблице(ЗначенияПараметров, ВыбранноеЗначение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
	|	ЗначенияПараметров.ПредметРасчета КАК ПредметРасчета,
	|	ЗначенияПараметров.ЗначениеПараметра КАК ЗначениеПараметра
	|ПОМЕСТИТЬ ВТ_ЗначенияПараметров
	|ИЗ
	|	&ЗначенияПараметров КАК ЗначенияПараметров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
	|	ВТ_ЗначенияПараметров.ПредметРасчета КАК ПредметРасчета,
	|	ВТ_ЗначенияПараметров.ЗначениеПараметра КАК ЗначениеПараметра
	|ИЗ
	|	ВТ_ЗначенияПараметров КАК ВТ_ЗначенияПараметров
	|		СОЕДИНЕНИЕ Справочник.гиг_ЗначенияПараметровПредметовРасчета КАК гиг_ЗначенияПараметровПредметовРасчета
	|		ПО ВТ_ЗначенияПараметров.ЗначениеПараметра = гиг_ЗначенияПараметровПредметовРасчета.Ссылка
	|ГДЕ
	|	гиг_ЗначенияПараметровПредметовРасчета.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("ЗначенияПараметров", ЗначенияПараметров.Выгрузить());
	Запрос.УстановитьПараметр("Владелец", ВыбранноеЗначение.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки-1;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВладельцаЗначенияПараметраПредметаРасчета(ЗначениеПараметра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	гиг_ЗначенияПараметровПредметовРасчета.Владелец КАК Владелец
	|ИЗ
	|	Справочник.гиг_ЗначенияПараметровПредметовРасчета КАК гиг_ЗначенияПараметровПредметовРасчета
	|ГДЕ
	|	гиг_ЗначенияПараметровПредметовРасчета.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗначениеПараметра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Владелец;
	Иначе
		Возврат Справочники.гиг_ПараметрыПредметовРасчета.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

Функция РасчетИзделийПоПроектуКоммерческогоПредложения(КоммерческоеПредложение) Экспорт
	
	Если ЗначениеЗаполнено(КоммерческоеПредложение.гиг_Проект) Тогда
		Возврат КоммерческоеПредложение.гиг_Проект.гиг_РасчетИзделий;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
