
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Отбор = Новый Структура("Склад", ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор, СкладДляОтбора", Отбор, ПараметрКоманды);
	
	ОткрытьФорму("РегистрСведений.гиг_СоответствиеСкладовСхемамОбеспечения.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
