
&НаСервере
Процедура Рин1_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	
	ОтборыСписковКлиентСервер.СкопироватьСписокВыбораОтбораПоМенеджеру(
		Элементы.Менеджер.СписокВыбора,
		ОбщегоНазначенияУТ.ПолучитьСписокПользователейСПравомДобавления(Метаданные.Документы.ПриобретениеТоваровУслуг));
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаГлобальныеКоманды);
	// Конец ИнтеграцияС1СДокументооборотом

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПриСозданииНаСервере = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка();
	ПараметрыПриСозданииНаСервере.Форма = ЭтотОбъект;
	ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд = Элементы.ПодменюЭДО;
	// + [Rineco], [Киселев А.Н.] [22.09.2021] 
	// Задача: [№ 18271], [# Ошибка при открытии журнала ПТУ]
	//ПараметрыПриСозданииНаСервере.КолонкаСостоянияЭДО = Элементы.ПредставлениеСостояния;
	// - [Rineco], [Киселев А.Н.] [22.09.2021]
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСписка(ПараметрыПриСозданииНаСервере);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// ЭлектронноеВзаимодействие.БизнесСеть
	БизнесСеть.ПодключитьОповещениеОНовыхДокументахВСервисе(ЭтотОбъект, 
		ЭлектронноеВзаимодействиеУТ.ВидыЭДПоИмениОбъекта(ЭтотОбъект.СписокДокументыПоступления.ОсновнаяТаблица));
	// Конец ЭлектронноеВзаимодействие.БизнесСеть	
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "СписокДокументыПоступления.Дата", Элементы.СписокДокументыПоступленияДата.Имя);

КонецПроцедуры

// + [Rineco], [Киселев А.Н.] [22.09.2021] 
// Задача: [№ 18271], [# Ошибка при открытии журнала ПТУ комментируем содержимое метода]
&НаКлиенте
Процедура Рин1_СписокДокументыПоступленияВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Если Поле = Элементы.ПредставлениеСостояния Тогда
	//	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	//	ОбменСКонтрагентамиКлиент.ДекорацияСостояниеЭДОФормаСпискаНажатие(ВыбраннаяСтрока, СтандартнаяОбработка);
	//	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	//КонецЕсли;

КонецПроцедуры
