// + [Rineco], [Киселев А.Н.] [19.10.2021] 
// Задача: [№ 20449], [# Добавляем запись]
Процедура ДобавитьНовуюЗапись(Отправитель,Объект,Сообщение,ЕстьПлан) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РИНЭКО_ИсторияОбсуждений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Отправитель = Отправитель;
	МенеджерЗаписи.Договор = Объект;
	МенеджерЗаписи.ЕстьПланМероприятия = ЕстьПлан;
	МенеджерЗаписи.Сообщение = Сообщение;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры