
&Вместо("ПересчитатьСуммыТабличнойЧастиВВалюту")
Процедура Рин1_ПересчитатьСуммыТабличнойЧастиВВалюту(Таблица, ЦенаВключаетНДС, Знач СтараяВалюта, Знач НоваяВалюта, Знач СтруктураКурсовСтаройВалюты, Знач СтруктураКурсовНовойВалюты, Знач ПересчитыватьАвтоматическиеСкидки, Знач ПересчитыватьРучныеСкидки, ИмяКоличества)
	СуммаКРаспределению = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
		Таблица.Итог("СуммаСНДС"),
		СтруктураКурсовСтаройВалюты,
		СтруктураКурсовНовойВалюты);
	
	МассивСумм = Новый Массив;
	Для н = 0 По Таблица.Количество()-1 Цикл
		
		ТекСтрока = Таблица[н];
	//{{20210125 ГлазуновДВ Задача 3835. Добавили возможность пересчета "ЦеныСоскидкой"	в формах, где она попадется
		Попытка
			ТекСтрока.ЦенаСоСкидкой = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
				ТекСтрока.ЦенаСоСкидкой,
				СтараяВалюта,НоваяВалюта,
				СтруктураКурсовСтаройВалюты.Курс,СтруктураКурсовНовойВалюты.Курс,
				СтруктураКурсовСтаройВалюты.Кратность,СтруктураКурсовНовойВалюты.Кратность);
		Исключение
		КонецПопытки;
	//}}20210125 ГлазуновДВ
		ТекСтрока.Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			ТекСтрока.Цена,
			СтруктураКурсовСтаройВалюты,
			СтруктураКурсовНовойВалюты);
		МассивСумм.Добавить(
			РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
				ТекСтрока.СуммаСНДС,
				СтруктураКурсовСтаройВалюты,
				СтруктураКурсовНовойВалюты));
	КонецЦикла;
	
	МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаКРаспределению, МассивСумм);
	
	Если МассивСумм <> Неопределено Тогда
		
		Для н = 0 По Таблица.Количество()-1 Цикл
			ТекСтрока = Таблица[н];
			ТекСтрока.СуммаСНДС = МассивСумм[н];
			ПересчитатьСуммыВСтрокеПоСуммеСНДС(ТекСтрока, ЦенаВключаетНДС,
				ПересчитыватьАвтоматическиеСкидки, ПересчитыватьРучныеСкидки, Истина, ИмяКоличества);
			//{{20210125 ГлазуновДВ Задача 3835. Добавили возможность пересчета "СуммаПроцентОбщий"	в формах, где она попадется
			Попытка
				ТекСтрока.СуммаПроцентОбщий = ТекСтрока.СуммаАвтоматическойСкидки + ТекСтрока.СуммаРучнойСкидки;
				ТекСтрока.ПроцентОбщий = ТекСтрока.ПроцентАвтоматическойСкидки + ТекСтрока.ПроцентРучнойСкидки;
			Исключение
			КонецПопытки;
			//}}20210125 ГлазуновДВ			
		КонецЦикла;
		
	КонецЕсли;

	
КонецПроцедуры
