Функция  СопоставитьНоменклатуру(Таблица,пПроизводитель,ЕдИзмМКуб,ЕдИзмДМКуб,ЕдИзмСМКуб) Экспорт
пЗапрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	Таблица.Артикул КАК Артикул,
						|	Таблица.ВесAPI КАК ВесAPI,
						|	Таблица.ДлинаAPI КАК ДлинаAPI,
						|	Таблица.ОбъемAPI КАК ОбъемAPI,
						|	Таблица.ШтрихкодAPI КАК ШтрихкодAPI,
						|	Таблица.ШиринаAPI КАК ШиринаAPI,
						|	Таблица.ВысотаAPI КАК ВысотаAPI,
						|	Таблица.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	Таблица.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	Таблица.ЕдИзмОбъемAPI КАК ЕдИзмОбъемAPI,
						|	Таблица.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	Таблица.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI
						|ПОМЕСТИТЬ ТаблицаAPI
						|ИЗ
						|	&Таблица КАК Таблица
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	ТаблицаAPI.Артикул КАК Артикул,
						|	ТаблицаAPI.ВесAPI КАК ВесAPI,
						|	ТаблицаAPI.ДлинаAPI КАК ДлинаAPI,
						|	ТаблицаAPI.ОбъемAPI КАК ОбъемAPI,
						|	ТаблицаAPI.ШтрихкодAPI КАК ШтрихкодAPI,
						|	Номенклатура.Ссылка КАК Номенклатура,
						|	Номенклатура.Производитель КАК Производитель,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) КАК Вес,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) КАК Длина,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Объем, 0) КАК Объем,
						|	ТаблицаAPI.ШиринаAPI КАК ШиринаAPI,
						|	ТаблицаAPI.ВысотаAPI КАК ВысотаAPI,
						|	ТаблицаAPI.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	ТаблицаAPI.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	ТаблицаAPI.ЕдИзмОбъемAPI КАК ЕдИзмОбъемAPI,
						|	ТаблицаAPI.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	ТаблицаAPI.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) КАК Ширина,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) КАК Высота,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ВесЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдИзмВес,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдИзмВысота,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдИзмГлубина,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдИзмШирина,
						|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ОбъемЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдИзмОбъем,
						|	ВЫБОР
						|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ссылка, 0) = 0
						|			ТОГДА ЛОЖЬ
						|		ИНАЧЕ ИСТИНА
						|	КОНЕЦ КАК ЕстьУпаковкаЕХ
						|ПОМЕСТИТЬ СопоставленнаяНоменклатура
						|ИЗ
						|	ТаблицаAPI КАК ТаблицаAPI
						|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
						|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
						|			ПО Номенклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
						|				И (УпаковкиЕдиницыИзмерения.Числитель = 1)
						|				И (УпаковкиЕдиницыИзмерения.Знаменатель = 1)
						|				И (УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения)
						|		ПО (Номенклатура.Артикул = ТаблицаAPI.Артикул)
						|			И (Номенклатура.Производитель = &Производитель)
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	СопоставленнаяНоменклатура.Артикул КАК Артикул,
						|	СопоставленнаяНоменклатура.ВесAPI КАК ВесAPI,
						|	СопоставленнаяНоменклатура.ДлинаAPI КАК ДлинаAPI,
						|	СопоставленнаяНоменклатура.ОбъемAPI КАК ОбъемAPI,
						|	СопоставленнаяНоменклатура.ШтрихкодAPI КАК ШтрихкодAPI,
						|	СопоставленнаяНоменклатура.Номенклатура КАК Номенклатура,
						|	СопоставленнаяНоменклатура.Производитель КАК Производитель,
						|	СопоставленнаяНоменклатура.Вес КАК Вес,
						|	СопоставленнаяНоменклатура.Длина КАК Длина,
						|	СопоставленнаяНоменклатура.Объем КАК Объем,
						|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") КАК Штрихкод,
						|	СопоставленнаяНоменклатура.ШиринаAPI КАК ШиринаAPI,
						|	СопоставленнаяНоменклатура.ВысотаAPI КАК ВысотаAPI,
						|	СопоставленнаяНоменклатура.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	СопоставленнаяНоменклатура.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	СопоставленнаяНоменклатура.ЕдИзмОбъемAPI КАК ЕдИзмОбъемAPI,
						|	СопоставленнаяНоменклатура.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	СопоставленнаяНоменклатура.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI,
						|	СопоставленнаяНоменклатура.Ширина КАК Ширина,
						|	СопоставленнаяНоменклатура.Высота КАК Высота,
						|	СопоставленнаяНоменклатура.ЕдИзмВес КАК ЕдИзмВес,
						|	СопоставленнаяНоменклатура.ЕдИзмВысота КАК ЕдИзмВысота,
						|	СопоставленнаяНоменклатура.ЕдИзмГлубина КАК ЕдИзмГлубина,
						|	СопоставленнаяНоменклатура.ЕдИзмШирина КАК ЕдИзмШирина,
						|	СопоставленнаяНоменклатура.ЕдИзмОбъем КАК ЕдИзмОбъем,
						|	СопоставленнаяНоменклатура.ЕстьУпаковкаЕХ КАК ЕстьУпаковкаЕХ
						|ПОМЕСТИТЬ НоменклатураШтрихкоды
						|ИЗ
						|	СопоставленнаяНоменклатура КАК СопоставленнаяНоменклатура
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
						|		ПО (СопоставленнаяНоменклатура.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
						|ГДЕ
						|	ЕСТЬNULL(СопоставленнаяНоменклатура.Номенклатура, 0) <> 0
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	НоменклатураШтрихкоды.Артикул КАК Артикул,
						|	НоменклатураШтрихкоды.ВесAPI КАК ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI КАК ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI КАК ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI КАК ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура КАК Номенклатура,
						|	НоменклатураШтрихкоды.Производитель КАК Производитель,
						|	НоменклатураШтрихкоды.Вес КАК Вес,
						|	НоменклатураШтрихкоды.Длина КАК Длина,
						|	НоменклатураШтрихкоды.Объем КАК Объем,
						|	НоменклатураШтрихкоды.Штрихкод КАК Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI КАК ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI КАК ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI КАК ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI,
						|	МАКСИМУМ(СопоставлениеЕдИзмВысота.НаименованиеЕдИзмеренияБаза) КАК ЕдИзмВысота,
						|	НоменклатураШтрихкоды.Ширина КАК Ширина,
						|	НоменклатураШтрихкоды.Высота КАК Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес КАК ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина КАК ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина КАК ЕдИзмШирина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем КАК ЕдИзмОбъем
						|ПОМЕСТИТЬ НоменклатураЕдИзмВГХВысота
						|ИЗ
						|	НоменклатураШтрихкоды КАК НоменклатураШтрихкоды
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГИГ_СопоставлениеЕдиницИзмерения КАК СопоставлениеЕдИзмВысота
						|		ПО (СопоставлениеЕдИзмВысота.НаименованиеЕдИзмеренияПрайс = НоменклатураШтрихкоды.ЕдИзмВысотаAPI)
						|			И (СопоставлениеЕдИзмВысота.НаименованиеЕдИзмеренияБаза.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина))
						|
						|СГРУППИРОВАТЬ ПО
						|	НоменклатураШтрихкоды.Артикул,
						|	НоменклатураШтрихкоды.ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура,
						|	НоменклатураШтрихкоды.Производитель,
						|	НоменклатураШтрихкоды.Вес,
						|	НоменклатураШтрихкоды.Длина,
						|	НоменклатураШтрихкоды.Объем,
						|	НоменклатураШтрихкоды.Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI,
						|	НоменклатураШтрихкоды.Ширина,
						|	НоменклатураШтрихкоды.Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	НоменклатураШтрихкоды.Артикул КАК Артикул,
						|	НоменклатураШтрихкоды.ВесAPI КАК ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI КАК ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI КАК ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI КАК ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура КАК Номенклатура,
						|	НоменклатураШтрихкоды.Производитель КАК Производитель,
						|	НоменклатураШтрихкоды.Вес КАК Вес,
						|	НоменклатураШтрихкоды.Длина КАК Длина,
						|	НоменклатураШтрихкоды.Объем КАК Объем,
						|	НоменклатураШтрихкоды.Штрихкод КАК Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI КАК ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI КАК ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI КАК ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI,
						|	МАКСИМУМ(СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза) КАК ЕдИзмШирина,
						|	НоменклатураШтрихкоды.Ширина КАК Ширина,
						|	НоменклатураШтрихкоды.Высота КАК Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес КАК ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота КАК ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина КАК ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем КАК ЕдИзмОбъем
						|ПОМЕСТИТЬ НоменклатураЕдИзмВГХШирина
						|ИЗ
						|	НоменклатураШтрихкоды КАК НоменклатураШтрихкоды
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГИГ_СопоставлениеЕдиницИзмерения КАК СопоставлениеЕдИзм
						|		ПО (СопоставлениеЕдИзм.НаименованиеЕдИзмеренияПрайс = НоменклатураШтрихкоды.ЕдИзмШиринаAPI)
						|			И (СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина))
						|
						|СГРУППИРОВАТЬ ПО
						|	НоменклатураШтрихкоды.Артикул,
						|	НоменклатураШтрихкоды.ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура,
						|	НоменклатураШтрихкоды.Производитель,
						|	НоменклатураШтрихкоды.Вес,
						|	НоменклатураШтрихкоды.Длина,
						|	НоменклатураШтрихкоды.Объем,
						|	НоменклатураШтрихкоды.Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI,
						|	НоменклатураШтрихкоды.Ширина,
						|	НоменклатураШтрихкоды.Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	НоменклатураШтрихкоды.Артикул КАК Артикул,
						|	НоменклатураШтрихкоды.ВесAPI КАК ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI КАК ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI КАК ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI КАК ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура КАК Номенклатура,
						|	НоменклатураШтрихкоды.Производитель КАК Производитель,
						|	НоменклатураШтрихкоды.Вес КАК Вес,
						|	НоменклатураШтрихкоды.Длина КАК Длина,
						|	НоменклатураШтрихкоды.Объем КАК Объем,
						|	НоменклатураШтрихкоды.Штрихкод КАК Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI КАК ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI КАК ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI КАК ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI,
						|	МАКСИМУМ(СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза) КАК ЕдИзмДлина,
						|	НоменклатураШтрихкоды.Ширина КАК Ширина,
						|	НоменклатураШтрихкоды.Высота КАК Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес КАК ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота КАК ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина КАК ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина КАК ЕдИзмШирина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем КАК ЕдИзмОбъем
						|ПОМЕСТИТЬ НоменклатураЕдИзмВГХДлина
						|ИЗ
						|	НоменклатураШтрихкоды КАК НоменклатураШтрихкоды
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГИГ_СопоставлениеЕдиницИзмерения КАК СопоставлениеЕдИзм
						|		ПО (СопоставлениеЕдИзм.НаименованиеЕдИзмеренияПрайс = НоменклатураШтрихкоды.ЕдИзмДлинаAPI)
						|			И (СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина))
						|
						|СГРУППИРОВАТЬ ПО
						|	НоменклатураШтрихкоды.Артикул,
						|	НоменклатураШтрихкоды.ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура,
						|	НоменклатураШтрихкоды.Производитель,
						|	НоменклатураШтрихкоды.Вес,
						|	НоменклатураШтрихкоды.Длина,
						|	НоменклатураШтрихкоды.Объем,
						|	НоменклатураШтрихкоды.Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI,
						|	НоменклатураШтрихкоды.Ширина,
						|	НоменклатураШтрихкоды.Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	НоменклатураШтрихкоды.Артикул КАК Артикул,
						|	НоменклатураШтрихкоды.ВесAPI КАК ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI КАК ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI КАК ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI КАК ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура КАК Номенклатура,
						|	НоменклатураШтрихкоды.Производитель КАК Производитель,
						|	НоменклатураШтрихкоды.Вес КАК Вес,
						|	НоменклатураШтрихкоды.Длина КАК Длина,
						|	НоменклатураШтрихкоды.Объем КАК Объем,
						|	НоменклатураШтрихкоды.Штрихкод КАК Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI КАК ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI КАК ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI КАК ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI,
						|	МАКСИМУМ(СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза) КАК ЕдИзмВес,
						|	НоменклатураШтрихкоды.Ширина КАК Ширина,
						|	НоменклатураШтрихкоды.Высота КАК Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВысота КАК ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина КАК ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина КАК ЕдИзмШирина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем КАК ЕдИзмОбъем
						|ПОМЕСТИТЬ НоменклатураЕдИзмВГХВес
						|ИЗ
						|	НоменклатураШтрихкоды КАК НоменклатураШтрихкоды
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГИГ_СопоставлениеЕдиницИзмерения КАК СопоставлениеЕдИзм
						|		ПО (СопоставлениеЕдИзм.НаименованиеЕдИзмеренияПрайс = НоменклатураШтрихкоды.ЕдИзмВесAPI)
						|			И (СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес))
						|
						|СГРУППИРОВАТЬ ПО
						|	НоменклатураШтрихкоды.Артикул,
						|	НоменклатураШтрихкоды.ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура,
						|	НоменклатураШтрихкоды.Производитель,
						|	НоменклатураШтрихкоды.Вес,
						|	НоменклатураШтрихкоды.Длина,
						|	НоменклатураШтрихкоды.Объем,
						|	НоменклатураШтрихкоды.Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI,
						|	НоменклатураШтрихкоды.Ширина,
						|	НоменклатураШтрихкоды.Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	НоменклатураШтрихкоды.Артикул КАК Артикул,
						|	НоменклатураШтрихкоды.ВесAPI КАК ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI КАК ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI КАК ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI КАК ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура КАК Номенклатура,
						|	НоменклатураШтрихкоды.Производитель КАК Производитель,
						|	НоменклатураШтрихкоды.Вес КАК Вес,
						|	НоменклатураШтрихкоды.Длина КАК Длина,
						|	НоменклатураШтрихкоды.Объем КАК Объем,
						|	НоменклатураШтрихкоды.Штрихкод КАК Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI КАК ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI КАК ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI КАК ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI,
						|	НоменклатураШтрихкоды.Ширина КАК Ширина,
						|	НоменклатураШтрихкоды.Высота КАК Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес КАК ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота КАК ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина КАК ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина КАК ЕдИзмШирина,
						|	МАКСИМУМ(ВЫБОР
						|			КОГДА ЕСТЬNULL(СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза, 0) <> 0
						|				ТОГДА СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза
						|			КОГДА ЕСТЬNULL(СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза, 0) = 0
						|					И НоменклатураШтрихкоды.ЕдИзмОбъемAPI = """"
						|					И НоменклатураШтрихкоды.ЕдИзмОбъемAPI = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
						|				ТОГДА """"
						|			КОГДА НоменклатураШтрихкоды.ЕдИзмОбъемAPI <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
						|				ТОГДА НоменклатураШтрихкоды.ЕдИзмОбъемAPI
						|			КОГДА НоменклатураШтрихкоды.ЕдИзмОбъемAPI <> """"
						|				ТОГДА НоменклатураШтрихкоды.ЕдИзмОбъемAPI
						|			ИНАЧЕ """"
						|		КОНЕЦ) КАК ЕдИзмОбъем
						|ПОМЕСТИТЬ НоменклатураЕдИзмВГХОбъем
						|ИЗ
						|	НоменклатураШтрихкоды КАК НоменклатураШтрихкоды
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГИГ_СопоставлениеЕдиницИзмерения КАК СопоставлениеЕдИзм
						|		ПО (СопоставлениеЕдИзм.НаименованиеЕдИзмеренияПрайс = НоменклатураШтрихкоды.ЕдИзмОбъемAPI)
						|			И (СопоставлениеЕдИзм.НаименованиеЕдИзмеренияБаза.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
						|				ИЛИ ТИПЗНАЧЕНИЯ(НоменклатураШтрихкоды.ЕдИзмОбъемAPI) = ТИП(Справочник.УпаковкиЕдиницыИзмерения)
						|					И НоменклатураШтрихкоды.ЕдИзмОбъемAPI <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.Пустаяссылка))
						|
						|СГРУППИРОВАТЬ ПО
						|	НоменклатураШтрихкоды.Артикул,
						|	НоменклатураШтрихкоды.ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI,
						|	НоменклатураШтрихкоды.ОбъемAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура,
						|	НоменклатураШтрихкоды.Производитель,
						|	НоменклатураШтрихкоды.Вес,
						|	НоменклатураШтрихкоды.Длина,
						|	НоменклатураШтрихкоды.Объем,
						|	НоменклатураШтрихкоды.Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмОбъемAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI,
						|	НоменклатураШтрихкоды.Ширина,
						|	НоменклатураШтрихкоды.Высота,
						|	НоменклатураШтрихкоды.ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	НоменклатураШтрихкоды.Артикул КАК Артикул,
						|	НоменклатураШтрихкоды.ВесAPI КАК ВесAPI,
						|	НоменклатураШтрихкоды.ДлинаAPI КАК ДлинаAPI,
						|	НоменклатураШтрихкоды.ШтрихкодAPI КАК ШтрихкодAPI,
						|	НоменклатураШтрихкоды.Номенклатура КАК Номенклатура,
						|	НоменклатураШтрихкоды.Производитель КАК Производитель,
						|	НоменклатураШтрихкоды.Вес КАК Вес,
						|	НоменклатураШтрихкоды.Длина КАК Длина,
						|	НоменклатураШтрихкоды.Объем КАК Объем,
						|	НоменклатураШтрихкоды.Штрихкод КАК Штрихкод,
						|	НоменклатураШтрихкоды.ШиринаAPI КАК ШиринаAPI,
						|	НоменклатураШтрихкоды.ВысотаAPI КАК ВысотаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВесAPI КАК ЕдИзмВесAPI,
						|	НоменклатураШтрихкоды.ЕдИзмДлинаAPI КАК ЕдИзмДлинаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмШиринаAPI КАК ЕдИзмШиринаAPI,
						|	НоменклатураШтрихкоды.ЕдИзмВысотаAPI КАК ЕдИзмВысотаAPI,
						|	НоменклатураЕдИзмВГХВысота.ЕдИзмВысота КАК ЕдИзмВысотаСопставл,
						|	НоменклатураЕдИзмВГХШирина.ЕдИзмШирина КАК ЕдИзмШиринаСопставл,
						|	НоменклатураЕдИзмВГХВес.ЕдИзмВес КАК ЕдИзмВесСопставл,
						|	НоменклатураЕдИзмВГХДлина.ЕдИзмДлина КАК ЕдИзмДлинаСопставл,
						|	ВЫБОР
						|		КОГДА НоменклатураШтрихкоды.ОбъемAPI <> 0
						|			ТОГДА НоменклатураШтрихкоды.ОбъемAPI
						|		КОГДА ЕСТЬNULL(НоменклатураЕдИзмВГХВысота.ЕдИзмВысота, 0) = 0
						|				ИЛИ ЕСТЬNULL(НоменклатураЕдИзмВГХШирина.ЕдИзмШирина, 0) = 0
						|				ИЛИ ЕСТЬNULL(НоменклатураЕдИзмВГХДлина.ЕдИзмДлина, 0) = 0
						|			ТОГДА 0
						|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
						|					КОГДА НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфМКуб > 0.001
						|						ТОГДА НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфМКуб
						|					КОГДА НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфДМКуб > 0.001
						|						ТОГДА НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфДМКуб
						|					ИНАЧЕ НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфСМКуб
						|				КОНЕЦ КАК ЧИСЛО(15, 6))
						|	КОНЕЦ КАК ОбъемAPI,
						|	ВЫБОР
						|		КОГДА НоменклатураШтрихкоды.ОбъемAPI <> 0
						|			ТОГДА НоменклатураШтрихкоды.ЕдИзмОбъемAPI
						|		КОГДА ЕСТЬNULL(НоменклатураЕдИзмВГХВысота.ЕдИзмВысота, 0) = 0
						|				ИЛИ ЕСТЬNULL(НоменклатураЕдИзмВГХШирина.ЕдИзмШирина, 0) = 0
						|				ИЛИ ЕСТЬNULL(НоменклатураЕдИзмВГХДлина.ЕдИзмДлина, 0) = 0
						|			ТОГДА """"
						|		ИНАЧЕ ВЫБОР
						|				КОГДА НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфМКуб > 0.001
						|					ТОГДА &ЕдИзмМКуб
						|				КОГДА НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфДМКуб > 0.001
						|					ТОГДА &ЕдИзмДМКуб
						|				ИНАЧЕ &ЕдИзмСМКуб
						|			КОНЕЦ
						|	КОНЕЦ КАК ЕдИзмОбъемAPI,
						|	ВЫБОР
						|		КОГДА НоменклатураШтрихкоды.ОбъемAPI <> 0
						|			ТОГДА НоменклатураШтрихкоды.ЕдИзмОбъемAPI
						|		КОГДА ЕСТЬNULL(НоменклатураЕдИзмВГХВысота.ЕдИзмВысота, 0) = 0
						|				ИЛИ ЕСТЬNULL(НоменклатураЕдИзмВГХШирина.ЕдИзмШирина, 0) = 0
						|				ИЛИ ЕСТЬNULL(НоменклатураЕдИзмВГХДлина.ЕдИзмДлина, 0) = 0
						|			ТОГДА """"
						|		ИНАЧЕ ВЫБОР
						|				КОГДА НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфМКуб > 0.001
						|					ТОГДА &ЕдИзмМКуб
						|				КОГДА НоменклатураШтрихкоды.ДлинаAPI * НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Числитель / НоменклатураЕдИзмВГХДлина.ЕдИзмДлина.Знаменатель * НоменклатураШтрихкоды.ШиринаAPI * НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Числитель / НоменклатураЕдИзмВГХШирина.ЕдИзмШирина.Знаменатель * НоменклатураШтрихкоды.ВысотаAPI * НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Числитель / НоменклатураЕдИзмВГХВысота.ЕдИзмВысота.Знаменатель * &КоэфДМКуб > 0.001
						|					ТОГДА &ЕдИзмДМКуб
						|				ИНАЧЕ &ЕдИзмСМКуб
						|			КОНЕЦ
						|	КОНЕЦ КАК ЕдИзмОбъемСопставл,
						|	НоменклатураШтрихкоды.Ширина КАК Ширина,
						|	НоменклатураШтрихкоды.Высота КАК Высота,
						|	НоменклатураШтрихкоды.ЕстьУпаковкаЕХ КАК ЕстьУпаковкаЕХ,
						|	НоменклатураШтрихкоды.ЕдИзмВес КАК ЕдИзмВес,
						|	НоменклатураШтрихкоды.ЕдИзмВысота КАК ЕдИзмВысота,
						|	НоменклатураШтрихкоды.ЕдИзмГлубина КАК ЕдИзмДлина,
						|	НоменклатураШтрихкоды.ЕдИзмШирина КАК ЕдИзмШирина,
						|	НоменклатураШтрихкоды.ЕдИзмОбъем КАК ЕдИзмОбъем
						|ИЗ
						|	НоменклатураШтрихкоды КАК НоменклатураШтрихкоды
						|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураЕдИзмВГХВысота КАК НоменклатураЕдИзмВГХВысота
						|		ПО НоменклатураШтрихкоды.Номенклатура = НоменклатураЕдИзмВГХВысота.Номенклатура
						|			И НоменклатураШтрихкоды.Штрихкод = НоменклатураЕдИзмВГХВысота.Штрихкод
						|			И НоменклатураШтрихкоды.ШтрихкодAPI = НоменклатураЕдИзмВГХВысота.ШтрихкодAPI
						|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураЕдИзмВГХШирина КАК НоменклатураЕдИзмВГХШирина
						|		ПО НоменклатураШтрихкоды.Номенклатура = НоменклатураЕдИзмВГХШирина.Номенклатура
						|			И НоменклатураШтрихкоды.Штрихкод = НоменклатураЕдИзмВГХШирина.Штрихкод
						|			И НоменклатураШтрихкоды.ШтрихкодAPI = НоменклатураЕдИзмВГХШирина.ШтрихкодAPI
						|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураЕдИзмВГХВес КАК НоменклатураЕдИзмВГХВес
						|		ПО НоменклатураШтрихкоды.Номенклатура = НоменклатураЕдИзмВГХВес.Номенклатура
						|			И НоменклатураШтрихкоды.Штрихкод = НоменклатураЕдИзмВГХВес.Штрихкод
						|			И НоменклатураШтрихкоды.ШтрихкодAPI = НоменклатураЕдИзмВГХВес.ШтрихкодAPI
						|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураЕдИзмВГХДлина КАК НоменклатураЕдИзмВГХДлина
						|		ПО НоменклатураШтрихкоды.Номенклатура = НоменклатураЕдИзмВГХДлина.Номенклатура
						|			И НоменклатураШтрихкоды.Штрихкод = НоменклатураЕдИзмВГХДлина.Штрихкод
						|			И НоменклатураШтрихкоды.ШтрихкодAPI = НоменклатураЕдИзмВГХДлина.ШтрихкодAPI
						|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураЕдИзмВГХОбъем КАК НоменклатураЕдИзмВГХОбъем
						|		ПО НоменклатураШтрихкоды.Номенклатура = НоменклатураЕдИзмВГХОбъем.Номенклатура
						|			И НоменклатураШтрихкоды.Штрихкод = НоменклатураЕдИзмВГХОбъем.Штрихкод
						|			И НоменклатураШтрихкоды.ШтрихкодAPI = НоменклатураЕдИзмВГХОбъем.ШтрихкодAPI");	
	
	пЗапрос.УстановитьПараметр("Таблица",Таблица);
	пЗапрос.УстановитьПараметр("Производитель",пПроизводитель);
	
	пЗапрос.УстановитьПараметр("КоэфМКуб",ЕдИзмМКуб.Знаменатель/ЕдИзмМКуб.Числитель);
	пЗапрос.УстановитьПараметр("КоэфДМКуб",ЕдИзмДМКуб.Знаменатель/ЕдИзмДМКуб.Числитель);
	пЗапрос.УстановитьПараметр("КоэфСМКуб",ЕдИзмСМКуб.Знаменатель/ЕдИзмСМКуб.Числитель);
	пЗапрос.УстановитьПараметр("ЕдИзмМКуб",ЕдИзмМКуб);
	пЗапрос.УстановитьПараметр("ЕдИзмДМКуб",ЕдИзмДМКуб);
	пЗапрос.УстановитьПараметр("ЕдИзмСМКуб",ЕдИзмСМКуб);

	Возврат пЗапрос.Выполнить().Выгрузить();	
КонецФункции
