
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьТаблицу();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	СхемаКомпоновки.Очистить();
	НовСтр = СхемаКомпоновки.Добавить();
	НовСтр.НаименованиеПриложения = "Описание из проекта";
	НовСтр = СхемаКомпоновки.Добавить();
	НовСтр.НаименованиеПриложения = "Описание изделия (описание из варианта расчета)";
	НовСтр = СхемаКомпоновки.Добавить();
	НовСтр.НаименованиеПриложения = "Внешний вид оборудования (внешний вид из варианта расчета)";
	НовСтр = СхемаКомпоновки.Добавить();
	НовСтр.НаименованиеПриложения = "Описание применяемого оборудования (описание общее из значений параметров предметов расчета)";
	НовСтр = СхемаКомпоновки.Добавить();
	НовСтр.НаименованиеПриложения = "Спецификация оборудования (детальная)";
	НовСтр = СхемаКомпоновки.Добавить();
	НовСтр.НаименованиеПриложения = "Спецификация оборудования (сводная)";
	
КонецПроцедуры // ЗаполнитьТаблицу()

&НаКлиенте
Процедура ПродолжитьВывод(Команда)
	
	Закрыть();
	
    НовСтр = СхемаКомпоновки.Вставить(0);
	НовСтр.Отметка = ТабличнаяЧастьСоСкидкой;
	НовСтр.НаименованиеПриложения = "Табличная часть со скидкой";
	
	НовСтр = СхемаКомпоновки.Вставить(0);
	НовСтр.Отметка = НдсНеВключенВСумму;
	НовСтр.НаименованиеПриложения = "Ндс не включен в сумму";
	
	СтруктураВозврата = Новый Структура("СхемаКомпоновки",СхемаКомпоновки);
	
	ОповеститьОВыборе(ПоместитьВоВременноеХранилище(СтруктураВозврата));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВывод(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПорядок(Команда)
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Для каждого Стр Из СхемаКомпоновки Цикл
	  Стр.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	Для каждого Стр Из СхемаКомпоновки Цикл
		Стр.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СхемаКомпоновкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СхемаКомпоновкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
