
&НаСервере
&Вместо("ОбработатьИнтерфейсРолей")
Процедура Рин1_ОбработатьИнтерфейсРолей(Действие, ОсновнойПараметр)
	
		ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ОсновнойПараметр", ОсновнойПараметр);
	ПараметрыДействия.Вставить("Форма",            ЭтотОбъект);
	ПараметрыДействия.Вставить("КоллекцияРолей",   КоллекцияРолей);
	
	//ПараметрыДействия.Вставить("СкрытьРольПолныеПрава",
	//	Объект.Ссылка <> Справочники.ПрофилиГруппДоступа.Администратор);
	
	ПараметрыДействия.Вставить("НазначениеРолей",
		УправлениеДоступомСлужебныйКлиентСервер.НазначениеПрофиля(Объект));
	
	ПользователиСлужебный.ОбработатьИнтерфейсРолей(Действие, ПараметрыДействия);

КонецПроцедуры
