
&Вместо("ТекстЗапросаДанныеДокумента")
Функция Рин1_ТекстЗапросаДанныеДокумента(НастройкиПечати)
	Результат = ПродолжитьВызов(НастройкиПечати);
	//++Шерстюк Ю.Ю. 29.06.2021 реквизит для ВПФ получим из запроса и отсортируем по нему по условию задачи 10741
	Результат = СтрЗаменить(Результат, "ЕСТЬNULL(ДеталиДокумента.РасчетныйДокумент, Неопределено) КАК РасчетныйДокумент,",
	"ЕСТЬNULL(ДеталиДокумента.РасчетныйДокумент, Неопределено) КАК РасчетныйДокумент, ВЫБОР КОГДА ЕСТЬNULL(ДеталиДокумента.РасчетныйДокумент, Неопределено) <> НЕОПРЕДЕЛЕНО ТОГДА ДеталиДокумента.РасчетныйДокумент.Дата ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 1, 1, 1) КОНЕЦ КАК ДатаРасчетногоДокумента, ");
	
	Результат = СтрЗаменить(Результат, "УПОРЯДОЧИТЬ ПО", "УПОРЯДОЧИТЬ ПО ДатаРасчетногоДокумента, ");
	//--Шерстюк Ю.Ю.
	Возврат Результат;
КонецФункции
