
&Вместо("СообщитьОбОшибкахПроведенияПоРегистрамСвободныеОстаткиИДвижениеТоваров")
Процедура Рин1_СообщитьОбОшибкахПроведенияПоРегистрамСвободныеОстаткиИДвижениеТоваров(Объект, Отказ, РезультатЗапроса)
	
	ШаблонСообщенияВНаличииМеньшеНоля = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
	|Недостаточно товара в наличии на складе %Склад% на %Количество% %Единица%';
	|en = 'Products %НоменклатураХарактеристика% 
	|Not enough goods in warehouse %Склад% by %Количество% %Единица%'");
	
	ШаблонСообщенияВНаличииМеньшеРезерваИзЗаказовНаДату = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
	|Превышен доступный на %Период% остаток товара на складе %Склад% на %Количество% %Единица%';
	|en = 'Products %НоменклатураХарактеристика%
	|Remaining goods available for %Период% in warehouse %Склад% are exceeded by %Количество% %Единица%'");
	
	ШаблонСообщенияВНаличииМеньшеРезерваИзЗаказов = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
	|Превышен доступный остаток товара на складе %Склад% на %Количество% %Единица%';
	|en = 'Products %НоменклатураХарактеристика%
	|Available remaining goods in warehouse %Склад% are exceeded by %Количество% %Единица%'");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Период)
			И Выборка.ВНаличии - Выборка.ВРезервеПодЗаказ - Выборка.ВРезервеСоСклада - Выборка.ВРезервеИзЗаказов < 0 Тогда
			
			ШаблонСообщения = ШаблонСообщенияВНаличииМеньшеРезерваИзЗаказовНаДату;
			Количество      = - (Выборка.ВНаличии - Выборка.ВРезервеПодЗаказ - Выборка.ВРезервеСоСклада - Выборка.ВРезервеИзЗаказов);
			
		ИначеЕсли Выборка.ВНаличии < 0 Тогда
			
			ШаблонСообщения = ШаблонСообщенияВНаличииМеньшеНоля;
			Количество      = - Выборка.ВНаличии;
			
		ИначеЕсли Выборка.ВНаличии - Выборка.ВРезервеПодЗаказ - Выборка.ВРезервеСоСклада - Выборка.ВРезервеИзЗаказов < 0 Тогда
			
			ШаблонСообщения = ШаблонСообщенияВНаличииМеньшеРезерваИзЗаказов;
			Количество      = - (Выборка.ВНаличии - Выборка.ВРезервеПодЗаказ - Выборка.ВРезервеСоСклада - Выборка.ВРезервеИзЗаказов);
			
		Иначе
			
			ВызватьИсключение НСтр("ru = 'Неизвестная ошибка контроля обеспечения.';
			|en = 'Unknown error of the supply control.'");
			
		КонецЕсли;
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристика%",
		НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(Количество));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%",      Строка(Выборка.Склад));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Единица%",    Строка(Выборка.ЕдиницаИзмерения));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Период%",     Строка(Формат(Выборка.Период, "ДЛФ=D")));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект, ,, Отказ);
		
		//bercut270220
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.КорректировкаНазначенияТоваров") Тогда
			ЗаписьЖурналаРегистрации("ГИГ_СнятиеРезерваСверхПотребности", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегламентныеЗадания.ГИГ_СнятиеРезерваСверхПотребности, , ТекстСообщения);
		КонецЕсли;
		//
		
	КонецЦикла;
	
КонецПроцедуры

//20201009 ГлазуновДВ проверка отмененой строки в "ЗаказеКлиента", есть ли Возрат
&Вместо("ВыполнитьКонтрольРезультатовПроведения")
Процедура Рин1_ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ)

	Если ЗначениеЗаполнено(ПараметрыСеанса.ПараметрыОбработчикаОбновления.РежимВыполнения) Тогда 
		Возврат;
	КонецЕсли;
	
	ЕстьРегистрыСКонтролемИзменений = Ложь;
	
	Если Объект.ДополнительныеСвойства.ДляПроведения.РегистрыДляКонтроля.Количество() > 0 Тогда
		ЕстьРегистрыСКонтролемИзменений = Истина;
	Иначе
		Для Каждого ДвигаемыйРегистр Из Объект.Движения Цикл
			Если ДвигаемыйРегистр.ДополнительныеСвойства.Свойство("РассчитыватьИзменения")
				И ДвигаемыйРегистр.ДополнительныеСвойства.РассчитыватьИзменения Тогда
					ЕстьРегистрыСКонтролемИзменений = Истина;
					Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЕстьРегистрыСКонтролемИзменений Тогда
		Возврат;
	КонецЕсли;
	          
	ДанныеТаблиц    = Объект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	ПакетЗапросов   = Новый Запрос;
	МассивКонтролей = Новый Массив;
	ТекстЗапроса    = "";

	// Контроль отрицательных остатков по товарам
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияСвободныеОстаткиИзменение")
		Или ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияГрафикОтгрузкиТоваровИзменение") Тогда

		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаКонтрольОбеспечения(
			ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияСвободныеОстаткиИзменение"),
			ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияГрафикОтгрузкиТоваровИзменение"));

		МассивКонтролей.Добавить(Врег("ОбеспечениеВременнаяТаблица1"));
		МассивКонтролей.Добавить(Врег("ОбеспечениеВременнаяТаблица2"));
		МассивКонтролей.Добавить(Врег("Обеспечение"));

	КонецЕсли;

	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыКОтгрузкеИзменениеСводно") Тогда

		МассивКонтролей.Добавить(Врег("ДвиженияТоварыКОтгрузкеСводно"));

		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	Остатки.Номенклатура      КАК Номенклатура,
		|	Остатки.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
		|	Остатки.Характеристика    КАК Характеристика,
		|	Остатки.Назначение    	  КАК Назначение,
		|	Остатки.Склад             КАК Склад,
		|	Остатки.Серия             КАК Серия,
		|	СУММА(Остатки.Количество) КАК Количество
		|
		|ИЗ 
		|(ВЫБРАТЬ
		|	Т.Номенклатура       КАК Номенклатура,
		|	Т.Характеристика     КАК Характеристика,
		|	Т.Назначение     	 КАК Назначение,
		|	Т.Склад              КАК Склад,
		|	Т.Серия              КАК Серия,
		|	-Т.ВРезервеОстаток - Т.КОтгрузкеОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|			,
		|			(Номенклатура, Характеристика, Назначение, Склад, Серия) В
		|				(ВЫБРАТЬ
		|					Т.Номенклатура,
		|					Т.Характеристика,
		|					Т.Назначение,
		|					Т.Склад,
		|					Т.Серия
		|				ИЗ
		|					ДвиженияТоварыКОтгрузкеИзменениеСводно КАК Т)) КАК Т
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.Номенклатура    КАК Номенклатура,
		|	Т.Характеристика  КАК Характеристика,
		|	Т.Назначение	  КАК Назначение,
		|	Т.Склад           КАК Склад,
		|	Т.Серия           КАК Серия,
		|	Т.ВНаличииОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			(Номенклатура, Характеристика, Назначение, Склад, Серия) В
		|				(ВЫБРАТЬ
		|					Т.Номенклатура,
		|					Т.Характеристика,
		|					Т.Назначение,
		|					Т.Склад,
		|					Т.Серия
		|				ИЗ
		|					ДвиженияТоварыКОтгрузкеИзменениеСводно КАК Т)) КАК Т
		|) КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.Характеристика,
		|	Остатки.Назначение,
		|	Остатки.Склад,
		|	Остатки.Серия
		|
		|ИМЕЮЩИЕ
		|	СУММА(Остатки.Количество) < 0	
		|;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ОбеспечениеЗаказовИзменение") Тогда

		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			МассивКонтролей.Добавить(Врег("ОбеспечениеЗаказов"));
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	Таблица.Номенклатура                     КАК Номенклатура,
			|	Таблица.ЕдиницаИзмерения                 КАК ЕдиницаИзмерения,
			|	Таблица.Характеристика                   КАК Характеристика,
			|	Таблица.Склад                            КАК Склад,
			|	Таблица.Назначение                       КАК Назначение,
			|
			|	Таблица.Заказать                         КАК Заказать,
			|	Таблица.Наличие                          КАК Наличие,
			|	Таблица.Потребность                      КАК Потребность,
			|
			|	Таблица.НаличиеИзменение                 КАК НаличиеИзменение,
			|	Таблица.ПотребностьИзменение             КАК ПотребностьИзменение,
			|	Таблица.ЗаказатьИзменение                КАК ЗаказатьИзменение,
			|
			|	Таблица.ОшибкаЗаказатьМеньшеНуля         КАК ОшибкаЗаказатьМеньшеНуля,
			|	Таблица.ВеличинаЗаказатьМеньшеНуля       КАК ВеличинаЗаказатьМеньшеНуля,
			|	Таблица.ОшибкаНаличиеВМинусе             КАК ОшибкаНаличиеВМинусе,
			|	Таблица.ОшибкаНаличиеБольшеПотребности   КАК ОшибкаНаличиеБольшеПотребности,
			|	Таблица.ВеличинаНаличиеБольшеПотребности КАК ВеличинаНаличиеБольшеПотребности
			|
			|ИЗ(
			|	ВЫБРАТЬ
			|		Остатки.Номенклатура                      КАК Номенклатура,
			|		Остатки.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
			|		Остатки.Характеристика                    КАК Характеристика,
			|		Остатки.Склад                             КАК Склад,
			|		Остатки.Назначение                        КАК Назначение,
			|		Остатки.Заказать                          КАК Заказать,

			|		Остатки.Наличие                           КАК Наличие,
			|		Остатки.Потребность                       КАК Потребность,
			|		// Ресурсы которые изменились
			|		ТаблицаИзменений.НаличиеИзменение         КАК НаличиеИзменение,
			|		ТаблицаИзменений.ПотребностьИзменение     КАК ПотребностьИзменение,
			|		ТаблицаИзменений.ЗаказатьИзменение        КАК ЗаказатьИзменение,
			|
			|		//Ошибка Заказать
			|		ВЫБОР КОГДА ТаблицаИзменений.ЗаказатьИзменение >0 И Остатки.Заказать < 0 ТОГДА
			|					ИСТИНА
			|				ИНАЧЕ
			|					ЛОЖЬ
			|			КОНЕЦ                                 КАК ОшибкаЗаказатьМеньшеНуля,
			|		Остатки.Заказать                          КАК ВеличинаЗаказатьМеньшеНуля,
			|
			|
			|		// Ошибка наличия товара под назначение
			|		ВЫБОР КОГДА ТаблицаИзменений.НаличиеИзменение >0 И Остатки.Наличие < 0 ТОГДА
			|					ИСТИНА
			|				ИНАЧЕ
			|					ЛОЖЬ
			|			КОНЕЦ                                 КАК ОшибкаНаличиеВМинусе,
			|
			|		// Ошибка наличия больше потребности
			|		ВЫБОР КОГДА (ТаблицаИзменений.НаличиеИзменение <0 ИЛИ ТаблицаИзменений.ПотребностьИзменение >0)
			|					И (Остатки.Наличие > Остатки.Потребность И Остатки.Заказать>=0) ТОГДА
			|					ИСТИНА
			|				ИНАЧЕ
			|					ЛОЖЬ
			|			КОНЕЦ                                 КАК ОшибкаНаличиеБольшеПотребности,
			|		Остатки.Наличие - Остатки.Потребность     КАК ВеличинаНаличиеБольшеПотребности
			|
			|	ИЗ(
			|		ВЫБРАТЬ
			|			Остатки.Номенклатура                   КАК Номенклатура,
			|			Остатки.Характеристика                 КАК Характеристика,
			|			Остатки.Склад                          КАК Склад,
			|			Остатки.Назначение                     КАК Назначение,
			|			Остатки.КЗаказуОстаток                 КАК Заказать,
			|			Остатки.НаличиеПодЗаказОстаток         КАК Наличие,
			|			Остатки.ПотребностьОстаток             КАК Потребность
			|		ИЗ
			|			РегистрНакопления.ОбеспечениеЗаказов.Остатки(,
			|				(Номенклатура, Характеристика, Склад, Назначение) В(
			|					ВЫБРАТЬ
			|						Таблица.Номенклатура,
			|						Таблица.Характеристика,
			|						Таблица.Склад,
			|						Таблица.Назначение
			|					ИЗ
			|						ОбеспечениеЗаказовИзменение КАК Таблица)) КАК Остатки
			|
			|	) КАК Остатки
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ ОбеспечениеЗаказовИзменение КАК ТаблицаИзменений
			|	ПО
			|		Остатки.Номенклатура     = ТаблицаИзменений.Номенклатура
			|		И Остатки.Характеристика = ТаблицаИзменений.Характеристика
			|		И Остатки.Склад          = ТаблицаИзменений.Склад
			|		И Остатки.Назначение     = ТаблицаИзменений.Назначение
			|
			|) КАК Таблица
			|ГДЕ
			|	Таблица.ОшибкаЗаказатьМеньшеНуля = ИСТИНА
			|	ИЛИ Таблица.ОшибкаНаличиеВМинусе = ИСТИНА
			|	ИЛИ Таблица.ОшибкаНаличиеБольшеПотребности = ИСТИНА";
		
		Иначе
			Если НЕ ПакетЗапросов.Параметры.Свойство("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров") Тогда
				ПакетЗапросов.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров",
					Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить());
			КонецЕсли;
			
			Если НЕ ПакетЗапросов.Параметры.Свойство("МерныеТипыЕдиницИзмерений") Тогда
				ПакетЗапросов.УстановитьПараметр("МерныеТипыЕдиницИзмерений",
					Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
			КонецЕсли;
			
			МассивКонтролей.Добавить(Врег("ДвиженияОбеспечениеЗаказовИзменениеМерныеТовары"));
			МассивКонтролей.Добавить(Врег("ВТДопустимыеОтклоненияОбеспечениеЗаказов"));
			МассивКонтролей.Добавить(Врег("ОбеспечениеЗаказов"));
			
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Склад,
			|	Таблица.Назначение
			|ПОМЕСТИТЬ ДвиженияОбеспечениеЗаказовИзменениеМерныеТовары
			|ИЗ
			|	ОбеспечениеЗаказовИзменение КАК Таблица
			|ГДЕ 
			|	Таблица.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
			|СГРУППИРОВАТЬ ПО
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Склад,
			|	Таблица.Назначение
			|ИНДЕКСИРОВАТЬ ПО
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Склад,
			|	Таблица.Назначение
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			// Допустимые отклонения
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	ОбеспечениеЗаказов.Номенклатура   КАК Номенклатура,
			|	ОбеспечениеЗаказов.Характеристика КАК Характеристика,
			|	ОбеспечениеЗаказов.Склад          КАК Склад,
			|	ОбеспечениеЗаказов.Назначение     КАК Назначение,
			|	СУММА(ОбеспечениеЗаказов.Потребность
			|		* (&ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100)) КАК ДопустимоеОтклонение
			|ПОМЕСТИТЬ ВТДопустимыеОтклоненияОбеспечениеЗаказов
			|ИЗ
			|	РегистрНакопления.ОбеспечениеЗаказов КАК ОбеспечениеЗаказов
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		ДвиженияОбеспечениеЗаказовИзменениеМерныеТовары КАК Изменения
			|		ПО ОбеспечениеЗаказов.Номенклатура      = Изменения.Номенклатура
			|			И ОбеспечениеЗаказов.Характеристика = Изменения.Характеристика
			|			И ОбеспечениеЗаказов.Склад          = Изменения.Склад
			|			И ОбеспечениеЗаказов.Назначение     = Изменения.Назначение
			|ГДЕ
			|	ОбеспечениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|СГРУППИРОВАТЬ ПО
			|	ОбеспечениеЗаказов.Номенклатура,
			|	ОбеспечениеЗаказов.Характеристика,
			|	ОбеспечениеЗаказов.Склад,
			|	ОбеспечениеЗаказов.Назначение
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика,
			|	Склад,
			|	Назначение
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	Таблица.Номенклатура                     КАК Номенклатура,
			|	Таблица.ЕдиницаИзмерения                 КАК ЕдиницаИзмерения,
			|	Таблица.Характеристика                   КАК Характеристика,
			|	Таблица.Склад                            КАК Склад,
			|	Таблица.Назначение                       КАК Назначение,
			|
			|	Таблица.Заказать                         КАК Заказать,
			|	Таблица.Наличие                          КАК Наличие,
			|	Таблица.Потребность                      КАК Потребность,
			|
			|	Таблица.НаличиеИзменение                 КАК НаличиеИзменение,
			|	Таблица.ПотребностьИзменение             КАК ПотребностьИзменение,
			|	Таблица.ЗаказатьИзменение                КАК ЗаказатьИзменение,
			|
			|	Таблица.ОшибкаЗаказатьМеньшеНуля         КАК ОшибкаЗаказатьМеньшеНуля,
			|	Таблица.ВеличинаЗаказатьМеньшеНуля       КАК ВеличинаЗаказатьМеньшеНуля,
			|	Таблица.ОшибкаНаличиеВМинусе             КАК ОшибкаНаличиеВМинусе,
			|	Таблица.ОшибкаНаличиеБольшеПотребности   КАК ОшибкаНаличиеБольшеПотребности,
			|	Таблица.ВеличинаНаличиеБольшеПотребности КАК ВеличинаНаличиеБольшеПотребности
			|
			|ИЗ(
			|	ВЫБРАТЬ
			|		Остатки.Номенклатура                      КАК Номенклатура,
			|		Остатки.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
			|		Остатки.Характеристика                    КАК Характеристика,
			|		Остатки.Склад                             КАК Склад,
			|		Остатки.Назначение                        КАК Назначение,
			|		Остатки.Заказать                          КАК Заказать,

			|		Остатки.Наличие                           КАК Наличие,
			|		Остатки.Потребность                       КАК Потребность,
			|		// Ресурсы которые изменились
			|		ТаблицаИзменений.НаличиеИзменение         КАК НаличиеИзменение,
			|		ТаблицаИзменений.ПотребностьИзменение     КАК ПотребностьИзменение,
			|		ТаблицаИзменений.ЗаказатьИзменение        КАК ЗаказатьИзменение,
			|
			|		//Ошибка Заказать
			|		ВЫБОР КОГДА ТаблицаИзменений.ЗаказатьИзменение >0
			|			И (Остатки.Заказать + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение, 0)) < 0 ТОГДА
			|					ИСТИНА
			|				ИНАЧЕ
			|					ЛОЖЬ
			|			КОНЕЦ                                 КАК ОшибкаЗаказатьМеньшеНуля,
			|		Остатки.Заказать                          КАК ВеличинаЗаказатьМеньшеНуля,
			|
			|
			|		// Ошибка наличия товара под назначение
			|		ВЫБОР КОГДА ТаблицаИзменений.НаличиеИзменение >0 
			|			И (Остатки.Наличие + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение, 0)) < 0 ТОГДА
			|					ИСТИНА
			|				ИНАЧЕ
			|					ЛОЖЬ
			|			КОНЕЦ                                 КАК ОшибкаНаличиеВМинусе,
			|
			|		// Ошибка наличия больше потребности
			|		ВЫБОР КОГДА (ТаблицаИзменений.НаличиеИзменение <0 ИЛИ ТаблицаИзменений.ПотребностьИзменение >0)
			|					И (Остатки.Наличие > Остатки.Потребность + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение, 0)
			|						И Остатки.Заказать>=0) ТОГДА
			|					ИСТИНА
			|				ИНАЧЕ
			|					ЛОЖЬ
			|			КОНЕЦ                                 КАК ОшибкаНаличиеБольшеПотребности,
			|		Остатки.Наличие - Остатки.Потребность     КАК ВеличинаНаличиеБольшеПотребности
			|
			|	ИЗ(
			|		ВЫБРАТЬ
			|			Остатки.Номенклатура                   КАК Номенклатура,
			|			Остатки.Характеристика                 КАК Характеристика,
			|			Остатки.Склад                          КАК Склад,
			|			Остатки.Назначение                     КАК Назначение,
			|			Остатки.КЗаказуОстаток                 КАК Заказать,
			|			Остатки.НаличиеПодЗаказОстаток         КАК Наличие,
			|			Остатки.ПотребностьОстаток             КАК Потребность
			|		ИЗ
			|			РегистрНакопления.ОбеспечениеЗаказов.Остатки(,
			|				(Номенклатура, Характеристика, Склад, Назначение) В(
			|					ВЫБРАТЬ
			|						Таблица.Номенклатура,
			|						Таблица.Характеристика,
			|						Таблица.Склад,
			|						Таблица.Назначение
			|					ИЗ
			|						ОбеспечениеЗаказовИзменение КАК Таблица)) КАК Остатки
			|
			|	) КАК Остатки
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ ОбеспечениеЗаказовИзменение КАК ТаблицаИзменений
			|	ПО
			|		Остатки.Номенклатура     = ТаблицаИзменений.Номенклатура
			|		И Остатки.Характеристика = ТаблицаИзменений.Характеристика
			|		И Остатки.Склад          = ТаблицаИзменений.Склад
			|		И Остатки.Назначение     = ТаблицаИзменений.Назначение
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияОбеспечениеЗаказов КАК ДопустимыеОтклонения
			|		ПО
			|			Остатки.Номенклатура     = ДопустимыеОтклонения.Номенклатура
			|			И Остатки.Характеристика = ДопустимыеОтклонения.Характеристика
			|			И Остатки.Склад          = ДопустимыеОтклонения.Склад
			|			И Остатки.Назначение     = ДопустимыеОтклонения.Назначение
			|) КАК Таблица
			|ГДЕ
			|	Таблица.ОшибкаЗаказатьМеньшеНуля = ИСТИНА
			|	ИЛИ Таблица.ОшибкаНаличиеВМинусе = ИСТИНА
			|	ИЛИ Таблица.ОшибкаНаличиеБольшеПотребности = ИСТИНА";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";

	КонецЕсли;
	//++ НЕ УТ 

	//++ НЕ УТКА
	// Контроль отрицательных остатков УслугиДавальцуКОформлению.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияУслугиДавальцуКОформлениюИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль"));
		МассивКонтролей.Добавить(Врег("ВТ_УслугиДавальцуКОформлениюКонтрольНаДату"));
		МассивКонтролей.Добавить(Врег("УслугиДавальцуКОформлению"));
		ТекстЗапроса = ТекстЗапроса + 
		
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.ЗаказДавальца                  КАК ЗаказДавальца,
		|	ТаблицаОстатков.Номенклатура                   КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                 КАК Характеристика,
		|	ТаблицаОстатков.КОформлениюОстаток             КАК Количество
		|ПОМЕСТИТЬ ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль
		|ИЗ
		|	РегистрНакопления.УслугиДавальцуКОформлению.Остатки(,
		|			(ЗаказДавальца, Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					Таблица.ЗаказДавальца,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика
		|				ИЗ
		|					ДвиженияУслугиДавальцуКОформлениюИзменение КАК Таблица
		|				ГДЕ
		|					Таблица.КОформлениюИзменение > 0)) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	ТаблицаОстатков.КОформлениюОстаток < 0
		|;
		|///////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.ЗаказДавальца,
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика
		|ПОМЕСТИТЬ ВТ_УслугиДавальцуКОформлениюКонтрольНаДату
		|ИЗ
		|	ДвиженияУслугиДавальцуКОформлениюИзменение КАК Таблица
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль
		|	ПО Таблица.ЗаказДавальца = ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль.ЗаказДавальца
		|		И Таблица.Номенклатура = ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль.Номенклатура
		|		И Таблица.Характеристика = ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль.Характеристика
		|
		|ГДЕ
		|	ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль.ЗаказДавальца ЕСТЬ NULL
		|;
		|///////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛОЖЬ                                          КАК КонтрольНаДату,
		|	ТаблицаОстатков.ЗаказДавальца                 КАК ЗаказДавальца,
		|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
		|	ТаблицаОстатков.ЕдиницаИзмерения              КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                КАК Характеристика,
		|	ТаблицаОстатков.Количество                    КАК Количество
		|ИЗ
		|	ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль КАК ТаблицаОстатков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА                                        КАК КонтрольНаДату,
		|	ТаблицаОстатков.ЗаказДавальца                 КАК ЗаказДавальца,
		|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                КАК Характеристика,
		|	ТаблицаОстатков.КОформлениюОстаток            КАК Количество
		|ИЗ
		|	РегистрНакопления.УслугиДавальцуКОформлению.Остатки(&ДатаКонтроля,
		|			(ЗаказДавальца, Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					Таблица.ЗаказДавальца,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика
		|				ИЗ
		|					ВТ_УслугиДавальцуКОформлениюКонтрольНаДату КАК Таблица)
		|	) КАК ТаблицаОстатков
		|ГДЕ
		|	&ВыполнятьКонтрольДаты
		|	И ТаблицаОстатков.КОформлениюОстаток < 0
		|;
		|///////////////////////////////////////////////////////////////////
		|";
		
		ЗапросДаты = Новый Запрос("ВЫБРАТЬ МИНИМУМ(Т.ДатаКонтроля) КАК Дата ИЗ ДвиженияУслугиДавальцуКОформлениюИзменение КАК Т");
		ЗапросДаты.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
		ВыборкаДаты = ЗапросДаты.Выполнить().Выбрать();
		
		ВыполнятьКонтрольДаты = ВыборкаДаты.Следующий() И ЗначениеЗаполнено(ВыборкаДаты.Дата);
		ДатаОстатка = ?(ВыполнятьКонтрольДаты, ВыборкаДаты.Дата, '00010101');
		
		ПакетЗапросов.УстановитьПараметр("ДатаКонтроля", ДатаОстатка);
		ПакетЗапросов.УстановитьПараметр("ВыполнятьКонтрольДаты", ВыполнятьКонтрольДаты);
		
	КонецЕсли;
	//-- НЕ УТКА
	
	// Контроль отрицательных остатков денежных документов.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияДенежныеДокументыИзменение") Тогда
		МассивКонтролей.Добавить(Врег("ДенежныеДокументы"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.Организация				КАК Организация,
		|	ТаблицаОстатков.Подразделение			КАК Подразделение,
		|	ТаблицаОстатков.МОЛ						КАК МОЛ,
		|	ТаблицаОстатков.ДенежныйДокумент		КАК ДенежныйДокумент,
		|	ТаблицаОстатков.ДенежныйДокумент.Валюта	КАК Валюта,
		|	ТаблицаОстатков.СуммаОстаток			КАК Сумма,
		|	ТаблицаОстатков.КоличествоОстаток		КАК Количество
		|ИЗ
		|	РегистрНакопления.ДенежныеДокументы.Остатки(,
		|			(Организация, Подразделение, МОЛ, ДенежныйДокумент) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.Подразделение,
		|					Таблица.МОЛ,
		|					Таблица.ДенежныйДокумент
		|				ИЗ
		|					ДвиженияДенежныеДокументыИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	ТаблицаОстатков.КоличествоОстаток < 0
		|	ИЛИ ТаблицаОстатков.СуммаОстаток < 0;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	// Контроль отрицательных остатков ТоварыПереданныеПереработчику.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыПереданныеПереработчикуИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ТоварыПереданныеПереработчику"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТаблицаОстатков.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыПереданныеПереработчику.Остатки(,
		|			АналитикаУчетаНоменклатуры В
		|				(ВЫБРАТЬ
		|					Таблица.АналитикаУчетаНоменклатуры
		|				ИЗ
		|					ДвиженияТоварыПереданныеПереработчикуИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	ТаблицаОстатков.КоличествоОстаток < 0;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	//-- НЕ УТ

	// Контроль отрицательных остатков ОбеспечениеЗаказовРаботами.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ОбеспечениеЗаказовРаботамиИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ОбеспечениеЗаказовРаботами"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.Назначение          КАК Назначение,
		|	ТаблицаОстатков.Номенклатура        КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика      КАК Характеристика,
		|	ТаблицаОстатков.Подразделение       КАК Подразделение,
		|	ТаблицаОстатков.КОбеспечениюОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОбеспечениеЗаказовРаботами.Остатки(,
		|			(Назначение, Номенклатура, Характеристика, Подразделение) В
		|				(ВЫБРАТЬ
		|					Таблица.Назначение,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Подразделение
		|				ИЗ
		|					ОбеспечениеЗаказовРаботамиИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	ТаблицаОстатков.КОбеспечениюОстаток < 0;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;

	// Контроль отрицательных остатков ЗаказыНаСборку.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаказыНаСборкуИзменение") Тогда

		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("ЗаказыНаСборку"));
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.ЗаказНаСборку      КАК ЗаказНаСборку,
			|	ТаблицаОстатков.Номенклатура       КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика     КАК Характеристика,
			|	ТаблицаОстатков.Серия              КАК Серия,
			|	ТаблицаОстатков.ТипСборки          КАК ТипСборки,
			|	ТаблицаОстатков.КОформлениюОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаказыНаСборку.Остатки(,
			|			(ЗаказНаСборку, Номенклатура, Характеристика, Серия, ТипСборки) В
			|				(ВЫБРАТЬ
			|					Таблица.ЗаказНаСборку,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Серия,
			|					Таблица.ТипСборки
			|				ИЗ
			|					ДвиженияЗаказыНаСборкуИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток < 0";
		
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ЗаказыОстатки.ЗаказНаСборку                  КАК ЗаказНаСборку,
			|	ЗаказыОстатки.Номенклатура                   КАК Номенклатура,
			|	ЗаказыОстатки.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ЗаказыОстатки.Характеристика                 КАК Характеристика,
			|	ЗаказыОстатки.Серия                          КАК Серия,
			|	ЗаказыОстатки.ТипСборки                      КАК ТипСборки,
			|	ЗаказыОстатки.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	ВТЗаказыНаСборкуОстатки КАК ЗаказыОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаказыНаСборку КАК ДопустимыеОтклонения
			|		ПО
			|			ЗаказыОстатки.ЗаказНаСборку    = ДопустимыеОтклонения.ЗаказНаСборку
			|			И ЗаказыОстатки.Номенклатура   = ДопустимыеОтклонения.Номенклатура
			|			И ЗаказыОстатки.Характеристика = ДопустимыеОтклонения.Характеристика
			|			И ЗаказыОстатки.ТипСборки      = ДопустимыеОтклонения.ТипСборки
			|			И ЗаказыОстатки.Серия          = ДопустимыеОтклонения.Серия
			|ГДЕ
			|	ЗаказыОстатки.КОформлениюОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение,0) < 0";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;

	// Контроль отрицательных остатков ЗаказыНаПеремещение.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаказыНаПеремещениеИзменение") Тогда

		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("ЗаказыНаПеремещение"));
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.ЗаказНаПеремещение КАК Заказ,
			|	ТаблицаОстатков.Номенклатура       КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика     КАК Характеристика,
			|	ТаблицаОстатков.Серия              КАК Серия,
			|	НЕОПРЕДЕЛЕНО                       КАК Склад,
			|	НЕОПРЕДЕЛЕНО                       КАК Подразделение,
			|	ТаблицаОстатков.КОформлениюОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(,
			|			(ЗаказНаПеремещение, Номенклатура, Характеристика, Серия) В
			|				(ВЫБРАТЬ
			|					Таблица.ЗаказНаПеремещение,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Серия
			|				ИЗ
			|					ДвиженияЗаказыНаПеремещениеИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток < 0";
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ЗаказыОстатки.ЗаказНаПеремещение             КАК Заказ,
			|	ЗаказыОстатки.Номенклатура                   КАК Номенклатура,
			|	ЗаказыОстатки.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ЗаказыОстатки.Характеристика                 КАК Характеристика,
			|	ЗаказыОстатки.Серия                          КАК Серия,
			|	НЕОПРЕДЕЛЕНО                                 КАК Склад,
			|	НЕОПРЕДЕЛЕНО                                 КАК Подразделение,
			|	ЗаказыОстатки.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	ВТЗаказыНаПеремещениеОстатки КАК ЗаказыОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаказыНаПеремещение КАК ДопустимыеОтклонения
			|		ПО
			|			ЗаказыОстатки.ЗаказНаПеремещение = ДопустимыеОтклонения.ЗаказНаПеремещение
			|			И ЗаказыОстатки.Номенклатура     = ДопустимыеОтклонения.Номенклатура
			|			И ЗаказыОстатки.Характеристика   = ДопустимыеОтклонения.Характеристика
			|			И ЗаказыОстатки.Серия            = ДопустимыеОтклонения.Серия
			|ГДЕ
			|	ЗаказыОстатки.КОформлениюОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение,0) < 0";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;

	// Контроль отрицательных остатков ЗаказыНаВнутреннееПотребление.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаказыНаВнутреннееПотреблениеИзменение") Тогда

		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("ЗаказыНаВнутреннееПотребление"));
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.ЗаказНаВнутреннееПотребление  КАК Заказ,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.Склад                         КАК Склад,
			|	ТаблицаОстатков.КОформлениюОстаток            КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаказыНаВнутреннееПотребление.Остатки(,
			|			(ЗаказНаВнутреннееПотребление, Номенклатура, Характеристика, Серия, Склад) В
			|				(ВЫБРАТЬ
			|					Таблица.ЗаказНаВнутреннееПотребление,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Серия,
			|					Таблица.Склад
			|				ИЗ
			|					ДвиженияЗаказыНаВнутреннееПотреблениеИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток < 0";
		
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ЗаказыОстатки.ЗаказНаВнутреннееПотребление   КАК Заказ,
			|	ЗаказыОстатки.Номенклатура                   КАК Номенклатура,
			|	ЗаказыОстатки.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ЗаказыОстатки.Характеристика                 КАК Характеристика,
			|	ЗаказыОстатки.Серия                          КАК Серия,
			|	ЗаказыОстатки.Склад                          КАК Склад,
			|	ЗаказыОстатки.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	ВТЗаказыНаВнутреннееПотреблениеОстатки КАК ЗаказыОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаказыНаВнутреннееПотребление КАК ДопустимыеОтклонения
			|		ПО
			|			ЗаказыОстатки.ЗаказНаВнутреннееПотребление = ДопустимыеОтклонения.ЗаказНаВнутреннееПотребление
			|			И ЗаказыОстатки.Номенклатура               = ДопустимыеОтклонения.Номенклатура
			|			И ЗаказыОстатки.Характеристика             = ДопустимыеОтклонения.Характеристика
			|			И ЗаказыОстатки.Склад                      = ДопустимыеОтклонения.Склад
			|			И ЗаказыОстатки.Серия                      = ДопустимыеОтклонения.Серия
			|ГДЕ
			|	ЗаказыОстатки.КОформлениюОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение,0) < 0";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";

	КонецЕсли;
	
	// Контроль отрицательных остатков ТоварыКОтгрузке.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыКОтгрузкеИзменение") Тогда
		
		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("ТоварыКОтгрузке"));
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	ТаблицаОстатков.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика КАК Характеристика,
		|	ТаблицаОстатков.Назначение КАК Назначение,
		|	ТаблицаОстатков.Серия КАК Серия,
		|	ТаблицаОстатков.Получатель                    КАК Получатель,
		|	ТаблицаОстатков.Склад КАК Склад,
		|	ТаблицаОстатков.КОтгрузкеОстаток - ТаблицаОстатков.СобираетсяОстаток - ТаблицаОстатков.СобраноОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(,
		|			(ДокументОтгрузки, Номенклатура, Характеристика, Назначение, Серия, Получатель, Склад) В
		|				(ВЫБРАТЬ
		|					Таблица.ДокументОтгрузки,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Назначение,
		|					Таблица.Серия,
		|					Таблица.Получатель,
		|					Таблица.Склад
		|				ИЗ
		|					ДвиженияТоварыКОтгрузкеИзменение КАК Таблица)) КАК ТаблицаОстатков";
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Обороты(
			|				,
			|				,
			|				,
			|				(ДокументОтгрузки, Номенклатура, Характеристика, Назначение, Серия, Склад) В
			|					(ВЫБРАТЬ
			|						Таблица.ДокументОтгрузки,
			|						Таблица.Номенклатура,
			|						Таблица.Характеристика,
			|						Таблица.Назначение,
			|						Таблица.Серия,
			|						Таблица.Склад
			|					ИЗ
			|						ДвиженияТоварыКОтгрузкеИзменение КАК Таблица)) КАК ТаблицаОборотов
			|		ПО ТаблицаОстатков.ДокументОтгрузки = ТаблицаОборотов.ДокументОтгрузки
			|			И ТаблицаОстатков.Номенклатура = ТаблицаОборотов.Номенклатура
			|			И ТаблицаОстатков.Характеристика = ТаблицаОборотов.Характеристика
			|			И ТаблицаОстатков.Назначение = ТаблицаОборотов.Назначение
			|			И ТаблицаОстатков.Серия = ТаблицаОборотов.Серия
			|			И ТаблицаОстатков.Склад = ТаблицаОборотов.Склад
			|ГДЕ
			|	ТаблицаОстатков.КОтгрузкеОстаток - ТаблицаОстатков.СобираетсяОстаток - ТаблицаОстатков.СобраноОстаток < ВЫБОР
			|			КОГДА ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
			|				ТОГДА -&ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТаблицаОборотов.КОтгрузкеПриход
			|			ИНАЧЕ 0
			|		КОНЕЦ";
			ПакетЗапросов.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров",
				ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров);
			ПакетЗапросов.УстановитьПараметр("МерныеТипыЕдиницИзмерений",
				Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ
			|	ТаблицаОстатков.КОтгрузкеОстаток - ТаблицаОстатков.СобираетсяОстаток - ТаблицаОстатков.СобраноОстаток < 0";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;

	// Контроль отрицательных остатков ЗаказыКлиентов.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаказыКлиентовИзменение") Тогда

		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("ЗаказыКлиентов"));
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.ЗаказКлиента                   КАК Заказ,
			|	ТаблицаОстатков.Номенклатура                   КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                 КАК Характеристика,
			|	ТаблицаОстатков.Серия                          КАК Серия,
			|	ТаблицаОстатков.Склад                          КАК Склад,
			|	ТаблицаОстатков.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаказыКлиентов.Остатки(,
			|			(ЗаказКлиента, Номенклатура, Характеристика, Серия, Склад) В
			|				(ВЫБРАТЬ
			|					Таблица.ЗаказКлиента,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Серия,
			|					Таблица.Склад
			|				ИЗ
			|					ДвиженияЗаказыКлиентовИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток < 0";
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ЗаказыОстатки.ЗаказКлиента                   КАК Заказ,
			|	ЗаказыОстатки.Номенклатура                   КАК Номенклатура,
			|	ЗаказыОстатки.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ЗаказыОстатки.Характеристика                 КАК Характеристика,
			|	ЗаказыОстатки.Серия                          КАК Серия,
			|	ЗаказыОстатки.Склад                          КАК Склад,
			|	ЗаказыОстатки.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	ВТЗаказыКлиентовОстатки КАК ЗаказыОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаказыКлиентов КАК ДопустимыеОтклонения
			|		ПО
			|			ЗаказыОстатки.ЗаказКлиента     = ДопустимыеОтклонения.ЗаказКлиента
			|			И ЗаказыОстатки.Номенклатура   = ДопустимыеОтклонения.Номенклатура
			|			И ЗаказыОстатки.Характеристика = ДопустимыеОтклонения.Характеристика
			|			И ЗаказыОстатки.Склад          = ДопустимыеОтклонения.Склад
			|			И ЗаказыОстатки.Серия          = ДопустимыеОтклонения.Серия
			|ГДЕ
			|	ЗаказыОстатки.КОформлениюОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение,0) < 0";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;

	// Контроль отрицательных остатков ЗаказыПоставщикам.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаказыПоставщикамИзменение") Тогда

		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("ЗаказыПоставщикам"));
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.ЗаказПоставщику                КАК Заказ,
			|	ТаблицаОстатков.Номенклатура                   КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                 КАК Характеристика,
			|	ТаблицаОстатков.Склад                          КАК Склад,
			|	ТаблицаОстатков.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаказыПоставщикам.Остатки(,
			|			(ЗаказПоставщику, Номенклатура, Характеристика, Склад) В
			|				(ВЫБРАТЬ
			|					Таблица.ЗаказПоставщику,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Склад
			|				ИЗ
			|					ДвиженияЗаказыПоставщикамИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток < 0";
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ЗаказыОстатки.ЗаказПоставщику                КАК Заказ,
			|	ЗаказыОстатки.Номенклатура                   КАК Номенклатура,
			|	ЗаказыОстатки.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ЗаказыОстатки.Характеристика                 КАК Характеристика,
			|	ЗаказыОстатки.Склад                          КАК Склад,
			|	ЗаказыОстатки.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	ВТЗаказыПоставщикамОстатки КАК ЗаказыОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаказыПоставщикам КАК ДопустимыеОтклонения
			|		ПО
			|			ЗаказыОстатки.ЗаказПоставщику  = ДопустимыеОтклонения.ЗаказПоставщику
			|			И ЗаказыОстатки.Номенклатура   = ДопустимыеОтклонения.Номенклатура
			|			И ЗаказыОстатки.Характеристика = ДопустимыеОтклонения.Характеристика
			|			И ЗаказыОстатки.Склад          = ДопустимыеОтклонения.Склад
			|ГДЕ
			|	ЗаказыОстатки.КОформлениюОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение,0) < 0";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;

	// Контроль отрицательных остатков по возвратам от хранителей.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменениеСводно")
		Или ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыОрганизацийИзменениеСводно") Тогда
		
			МассивКонтролей.Добавить(Врег("ВТ_ОстатокКОформлениюПоЗаявкам"));
			МассивКонтролей.Добавить(Врег("ВТ_ОтборАналитикУчетаНоменклатуры"));
			МассивКонтролей.Добавить(Врег("ВТ_ОстатокПоТоварамОрганизаций"));
			МассивКонтролей.Добавить(Врег("ВозвратТоваровОтХранителей"));
			
			ТекстЗапросаКонтрольЗаявокНаВозвратПоТоварамОрганизаций = "
			|ВЫБРАТЬ
			|	ТаблицаОстатков.Договор                         КАК Договор,
			|	ТаблицаОстатков.Номенклатура                    КАК Номенклатура,
			|	ТаблицаОстатков.Характеристика                  КАК Характеристика,
			|	ТаблицаОстатков.КОформлениюОстаток              КАК Количество
			|ПОМЕСТИТЬ ВТ_ОстатокКОформлениюПоЗаявкам
			|ИЗ
			|	РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Остатки(,
			|			(Договор, Номенклатура, Характеристика) В
			|				(ВЫБРАТЬ
			|					Таблица.Договор,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика
			|				ИЗ
			|					&ИмяТаблицыСводно КАК Таблица)
			|	) КАК ТаблицаОстатков
			|;
			|
			|ВЫБРАТЬ
			|	Аналитики.КлючАналитики КАК Ссылка
			|ПОМЕСТИТЬ ВТ_ОтборАналитикУчетаНоменклатуры
			|ИЗ
			|	&ИмяТаблицыСводно КАК ОстаткиПоЗаявкам
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитики
			|	ПО ОстаткиПоЗаявкам.Номенклатура  = Аналитики.Номенклатура
			|		И ОстаткиПоЗаявкам.Характеристика = Аналитики.Характеристика
			|		И ОстаткиПоЗаявкам.Договор        = Аналитики.МестоХранения
			|;
			|
			|ВЫБРАТЬ
			|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Договор        КАК Договор,
			|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Номенклатура   КАК Номенклатура,
			|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
			|	ТаблицаОстатков.КоличествоОстаток                         КАК Количество
			|ПОМЕСТИТЬ ВТ_ОстатокПоТоварамОрганизаций
			|ИЗ
			|	РегистрНакопления.ТоварыОрганизаций.Остатки(,
			|			(АналитикаУчетаНоменклатуры) В
			|				(ВЫБРАТЬ
			|					ОтборАналитик.Ссылка
			|				ИЗ
			|					ВТ_ОтборАналитикУчетаНоменклатуры КАК ОтборАналитик)
			|	) КАК ТаблицаОстатков
			|;
			|
			|ВЫБРАТЬ
			|	ТаблицаОстатков.Договор                       КАК Договор,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	СУММА(ТаблицаОстатков.Количество)             КАК Количество
			|ИЗ
			|	(
			|	ВЫБРАТЬ
			|		ТоварыОрганизаций.Договор                       КАК Договор,
			|		ТоварыОрганизаций.Номенклатура                  КАК Номенклатура,
			|		ТоварыОрганизаций.Характеристика                КАК Характеристика,
			|		ТоварыОрганизаций.Количество                    КАК Количество
			|	ИЗ
			|		ВТ_ОстатокПоТоварамОрганизаций КАК ТоварыОрганизаций
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		ЗаявкиНаВозврат.Договор                       КАК Договор,
			|		ЗаявкиНаВозврат.Номенклатура                  КАК Номенклатура,
			|		ЗаявкиНаВозврат.Характеристика                КАК Характеристика,
			|		-ЗаявкиНаВозврат.Количество                   КАК Количество
			|	ИЗ
			|		ВТ_ОстатокКОформлениюПоЗаявкам КАК ЗаявкиНаВозврат
			|	) КАК ТаблицаОстатков
			|
			|СГРУППИРОВАТЬ ПО
			|	Договор,
			|	Номенклатура,
			|	Характеристика
			|
			|ИМЕЮЩИЕ
			|	СУММА(ТаблицаОстатков.Количество) < 0
			|";
			
			ИмяТаблицыСводно = ?(ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменениеСводно"),
				"ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменениеСводно",
				"ДвиженияТоварыОрганизацийИзменениеСводно");
			
			ТекстЗапросаКонтрольЗаявокНаВозвратПоТоварамОрганизаций =
				 СтрЗаменить(ТекстЗапросаКонтрольЗаявокНаВозвратПоТоварамОрганизаций, "&ИмяТаблицыСводно", ИмяТаблицыСводно);
			
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаКонтрольЗаявокНаВозвратПоТоварамОрганизаций;
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|///////////////////////////////////////////////////////////////////
			|";
			
	КонецЕсли;
	
	// Контроль отрицательных остатков ЗаявкиНаВозвратТоваровОтКлиентов.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("ЗаявкиНаВозвратТоваровОтКлиентов"));
		
		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.ЗаявкаНаВозвратТоваровОтКлиента КАК Заявка,
			|	ТаблицаОстатков.Номенклатура                    КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения   КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                  КАК Характеристика,
			|	ТаблицаОстатков.КОформлениюОстаток              КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Остатки(,
			|			(ЗаявкаНаВозвратТоваровОтКлиента, Номенклатура, Характеристика) В
			|				(ВЫБРАТЬ
			|					Таблица.ЗаявкаНаВозвратТоваровОтКлиента,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика
			|				ИЗ
			|					ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток < 0";
		
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ЗаказыОстатки.ЗаявкаНаВозвратТоваровОтКлиента КАК Заявка,
			|	ЗаказыОстатки.Номенклатура                    КАК Номенклатура,
			|	ЗаказыОстатки.Номенклатура.ЕдиницаИзмерения   КАК ЕдиницаИзмерения,
			|	ЗаказыОстатки.Характеристика                  КАК Характеристика,
			|	ЗаказыОстатки.КОформлениюОстаток              КАК Количество
			|ИЗ
			|	ВТЗаявкиНаВозвратТоваровОтКлиентовОстатки КАК ЗаказыОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаявкиНаВозвратТоваровОтКлиентов КАК ДопустимыеОтклонения
			|		ПО
			|			ЗаказыОстатки.ЗаявкаНаВозвратТоваровОтКлиента = ДопустимыеОтклонения.ЗаявкаНаВозвратТоваровОтКлиента
			|			И ЗаказыОстатки.Номенклатура                  = ДопустимыеОтклонения.Номенклатура
			|			И ЗаказыОстатки.Характеристика                = ДопустимыеОтклонения.Характеристика
			|ГДЕ
			|	ЗаказыОстатки.КОформлениюОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение,0) < 0";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;

	// Контроль отрицательных остатков по ДенежныеСредстваКВыплате.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц, "ДвиженияДенежныеСредстваКВыплатеИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("ДенежныеСредстваКВыплате"));
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	ТаблицаОстатков.БанковскийСчетКасса                 КАК БанковскийСчетКасса,
		|	ТаблицаОстатков.Получатель                          КАК Получатель,
		|	ТаблицаОстатков.Организация                         КАК Организация,
		|	ТаблицаОстатков.СуммаОстаток                        КАК Сумма,
		|	
		|	Заявка.Организация                                  КАК ОрганизацияЗаявки,
		|	ВЫБОР КОГДА Заявка.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
		|	) ТОГДА
		|		Заявка.ПодотчетноеЛицо
		|	КОГДА Заявка.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
		|	) ТОГДА
		|		Заявка.ОрганизацияПолучатель
		|	ИНАЧЕ
		|		Заявка.Контрагент
		|	КОНЕЦ                                               КАК ПолучательЗаявки,
		|	Заявка.Валюта                                       КАК Валюта,
		|	Заявка.ХозяйственнаяОперация                        КАК ХозяйственнаяОперация
		|	
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(,
		|		(ЗаявкаНаРасходованиеДенежныхСредств, БанковскийСчетКасса, Получатель, Организация) В
		|		(ВЫБРАТЬ
		|			Таблица.ЗаявкаНаРасходованиеДенежныхСредств,
		|			Таблица.БанковскийСчетКасса,
		|			Таблица.Получатель,
		|			Таблица.Организация
		|		ИЗ
		|			ДвиженияДенежныеСредстваКВыплатеИзменение КАК Таблица)
		|		) КАК ТаблицаОстатков
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
		|	ПО
		|		ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств = Заявка.Ссылка
		|
		|ГДЕ
		|	ТаблицаОстатков.СуммаОстаток < 0
		|;
		|
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;

	// Контроль предоплаты по РасчетыСКлиентами.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРасчетыСКлиентамиИзменение") Тогда

		МассивКонтролей.Добавить(Врег("РасчетыСКлиентами"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаЗаказы.ЗаказКлиента КАК ЗаказКлиента,
		|	ТаблицаЗаказы.Валюта       КАК Валюта,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И НЕ ТаблицаЗаказы.ИсключатьПриКонтроле ТОГДА
		|				ТаблицаЗаказы.КОплате
		|			ИНАЧЕ 0
		|		КОНЕЦ)                 КАК СуммаЗаказа,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ТаблицаЗаказы.КОплате
		|			ИНАЧЕ 0
		|		КОНЕЦ +
		|		ВЫБОР
		|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -ТаблицаЗаказы.Оплачивается
		|			ИНАЧЕ ТаблицаЗаказы.Оплачивается
		|		КОНЕЦ)                 КАК СуммаОплаты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК ТаблицаЗаказы
		|ГДЕ
		|	(ТаблицаЗаказы.ЗаказКлиента, ТаблицаЗаказы.Валюта, ТаблицаЗаказы.Активность) В
		|			(ВЫБРАТЬ
		|				Таблица.ЗаказКлиента,
		|				Таблица.Валюта,
		|				ИСТИНА
		|			ИЗ
		|				ДвиженияРасчетыСКлиентамиИзменение КАК Таблица)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЗаказы.Валюта,
		|	ТаблицаЗаказы.ЗаказКлиента
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И НЕ ТаблицаЗаказы.ИсключатьПриКонтроле ТОГДА
		|				ТаблицаЗаказы.КОплате
		|			ИНАЧЕ 0
		|		КОНЕЦ) > 0
		|	И
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И НЕ ТаблицаЗаказы.ИсключатьПриКонтроле ТОГДА
		|				ТаблицаЗаказы.КОплате
		|			ИНАЧЕ 0
		|		КОНЕЦ)
		|	> 
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ТаблицаЗаказы.КОплате
		|			ИНАЧЕ 0
		|		КОНЕЦ +
		|		ВЫБОР
		|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -ТаблицаЗаказы.Оплачивается
		|			ИНАЧЕ ТаблицаЗаказы.Оплачивается
		|		КОНЕЦ)
		|;
		|
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;

		// Контроли по РасчетыСКлиентами (временные таблицы).
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга")
	 ИЛИ ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока") Тогда

		МассивКонтролей.Добавить(Врег("ВременнаяТаблицаДанныеДоговоровИзменениеСуммыДолга"));
		МассивКонтролей.Добавить(Врег("ВременнаяТаблицаДанныеДоговоровИзменениеКонтрольСрока"));
		МассивКонтролей.Добавить(Врег("ВременнаяТаблицаДанныеДоговоровПредварительные"));
		МассивКонтролей.Добавить(Врег("ВременнаяТаблицаДанныеДоговоров"));
		МассивКонтролей.Добавить(Врег("ВременнаяТаблицаОбъектыРасчетов"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга.АналитикаУчетаПоПартнерам.Договор КАК Договор
		|ПОМЕСТИТЬ ДанныеДоговоровИзменениеСуммыДолга
		|ИЗ
		|	ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга КАК ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока.АналитикаУчетаПоПартнерам.Договор КАК Договор
		|ПОМЕСТИТЬ ДанныеДоговоровИзменениеКонтрольСрока
		|ИЗ
		|	ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока КАК ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Договор                             КАК Договор,
		|	ДанныеДоговора.ВалютаВзаиморасчетов                 КАК Валюта,
		|	ДанныеДоговора.ОграничиватьСуммуЗадолженности       КАК ОграничиватьСуммуЗадолженности,
		|	ДанныеДоговора.ДопустимаяСуммаЗадолженности         КАК ДопустимаяСуммаЗадолженности,
		|	ЛОЖЬ                                                КАК ЗапрещаетсяПросроченнаяЗадолженность
		|
		|ПОМЕСТИТЬ ДанныеДоговоровПредварительные
		|ИЗ
		|	ДанныеДоговоровИзменениеСуммыДолга КАК ТаблицаДвижений
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|	ПО
		|		ТаблицаДвижений.Договор = ДанныеДоговора.Ссылка
		|
		|ГДЕ
		|	ДанныеДоговора.ОграничиватьСуммуЗадолженности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДвижений.ЗаказКлиента                        КАК Договор,
		|	ДанныеДоговора.ВалютаВзаиморасчетов                 КАК Валюта,
		|	ДанныеДоговора.ОграничиватьСуммуЗадолженности       КАК ОграничиватьСуммуЗадолженности,
		|	ДанныеДоговора.ДопустимаяСуммаЗадолженности         КАК ДопустимаяСуммаЗадолженности,
		|	ЛОЖЬ                                                КАК ЗапрещаетсяПросроченнаяЗадолженность
		|
		|ИЗ
		|	ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга КАК ТаблицаДвижений
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|	ПО
		|		ТаблицаДвижений.ЗаказКлиента = ДанныеДоговора.Ссылка
		|
		|ГДЕ
		|	ДанныеДоговора.ОграничиватьСуммуЗадолженности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Договор                             КАК Договор,
		|	ДанныеДоговора.ВалютаВзаиморасчетов                 КАК Валюта,
		|	ЛОЖЬ                                                КАК ОграничиватьСуммуЗадолженности,
		|	0                                                   КАК ДопустимаяСуммаЗадолженности,
		|	ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность КАК ЗапрещаетсяПросроченнаяЗадолженность
		|
		|ИЗ
		|	ДанныеДоговоровИзменениеКонтрольСрока КАК ТаблицаДвижений
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|	ПО
		|		ТаблицаДвижений.Договор = ДанныеДоговора.Ссылка
		|
		|ГДЕ
		|	ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДвижений.ЗаказКлиента                        КАК Договор,
		|	ДанныеДоговора.ВалютаВзаиморасчетов                 КАК Валюта,
		|	ЛОЖЬ                                                КАК ОграничиватьСуммуЗадолженности,
		|	0                                                   КАК ДопустимаяСуммаЗадолженности,
		|	ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность КАК ЗапрещаетсяПросроченнаяЗадолженность
		|
		|ИЗ
		|	ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока КАК ТаблицаДвижений
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|	ПО
		|		ТаблицаДвижений.ЗаказКлиента = ДанныеДоговора.Ссылка
		|
		|ГДЕ
		|	ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность
		|;
		|
		|///////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДоговоров.Договор                                        КАК Договор,
		|	ДанныеДоговоров.Валюта                                         КАК Валюта,
		|	МАКСИМУМ(ДанныеДоговоров.ОграничиватьСуммуЗадолженности)       КАК КонтрольСуммы,
		|	МАКСИМУМ(ДанныеДоговоров.ДопустимаяСуммаЗадолженности)         КАК ДопустимаяСумма,
		|	МАКСИМУМ(ДанныеДоговоров.ЗапрещаетсяПросроченнаяЗадолженность) КАК КонтрольСрока
		|
		|ПОМЕСТИТЬ ДанныеДоговоров
		|ИЗ
		|	ДанныеДоговоровПредварительные КАК ДанныеДоговоров
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДоговоров.Договор,
		|	ДанныеДоговоров.Валюта
		|;
		|
		|///////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДоговора.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДоговора.Ссылка  КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ПОМЕСТИТЬ ОбъектыРасчетов
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДоговора.Ссылка = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДоговора.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.АктВыполненныхРабот КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.ЗаказКлиента КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И &ИспользоватьРасширенныеВозможностиЗаказаКлиента
		|	И ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И &ИспользоватьРасширенныеВозможностиЗаказаКлиента
		|	И ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.ОтчетКомиссионера КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.ОтчетКомиссионераОСписании КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.ОтчетКомитенту КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.РеализацияУслугПрочихАктивов КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен И ДанныеДокумента.ПроведеноБанком
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка  КАК ЗаказКлиента,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДоговоров.Валюта КАК Валюта,
		|	ДанныеДоговоров.КонтрольСуммы КАК КонтрольСуммы,
		|	ДанныеДоговоров.КонтрольСрока КАК КонтрольСрока
		|
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ДанныеДокумента.Договор = ДанныеДоговоров.Договор
		|
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|;
		|
		|///////////////////////////////////////////////////////////////////
		|";
		
		ПакетЗапросов.УстановитьПараметр("ИспользоватьРасширенныеВозможностиЗаказаКлиента",
			ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента"));
		
	КонецЕсли;
	
	// Контроль ограничения задолженности по РасчетыСКлиентами.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга") Тогда
		
		МассивКонтролей.Добавить(Врег("ОграничениеСуммыЗадолженности"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ОбъектыРасчетов.Договор                                   КАК Договор,
		|	РасчетыСКлиентамиОстатки.Валюта                           КАК Валюта,
		|	МИНИМУМ(ДанныеДоговоров.ДопустимаяСумма)                  КАК ДопустимаяСуммаЗадолженности,
		|	СУММА(РасчетыСКлиентамиОстатки.СуммаОстаток) +
		|		СУММА(РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток)    КАК СуммаОстаток,
		|
		|	СУММА(РасчетыСКлиентамиОстатки.СуммаОстаток) +
		|		СУММА(РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток) -
		|		МИНИМУМ(ДанныеДоговоров.ДопустимаяСумма)              КАК СуммаПревышения
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(
		|		,
		|		(ЗаказКлиента, Валюта) В (ВЫБРАТЬ ЗаказКлиента, Валюта ИЗ ОбъектыРасчетов ГДЕ КонтрольСуммы)
		|	) КАК РасчетыСКлиентамиОстатки
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ОбъектыРасчетов КАК ОбъектыРасчетов	
		|	ПО
		|		РасчетыСКлиентамиОстатки.ЗаказКлиента = ОбъектыРасчетов.ЗаказКлиента
		|		И РасчетыСКлиентамиОстатки.Валюта = ОбъектыРасчетов.Валюта
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ОбъектыРасчетов.Договор = ДанныеДоговоров.Договор
		|		И ОбъектыРасчетов.Валюта = ДанныеДоговоров.Валюта
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыРасчетов.Договор,
		|	РасчетыСКлиентамиОстатки.Валюта
		|ИМЕЮЩИЕ
		|	СУММА(РасчетыСКлиентамиОстатки.СуммаОстаток)+
		|		СУММА(РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток) > МИНИМУМ(ДанныеДоговоров.ДопустимаяСумма)
		|;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;

	// Контроль просроченной задолженности по РасчетыСКлиентами.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока") Тогда

		МассивКонтролей.Добавить(Врег("КонтрольСрокаЗадолженности"));
		ПакетЗапросов.УстановитьПараметр("ПериодКонтроляСрокаДолга", Макс(КонецДня(ТекущаяДатаСеанса()), КонецДня(Объект.Дата)));
		ПакетЗапросов.УстановитьПараметр("НоваяАрхитектураВзаиморасчетов", Константы.НоваяАрхитектураВзаиморасчетов.Получить());
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ОбъектыРасчетов.Договор                                   КАК Договор,
		|	РасчетыСКлиентамиОстатки.Валюта                           КАК Валюта,
		|	СУММА(ВЫБОР КОГДА РасчетыСКлиентамиОстатки.СуммаОстаток >
		|						РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток ТОГДА
		|		РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток
		|	ИНАЧЕ
		|		РасчетыСКлиентамиОстатки.СуммаОстаток
		|	КОНЕЦ) КАК ПросроченнаяЗадолженность
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(
		|		&ПериодКонтроляСрокаДолга,
		|		(ЗаказКлиента, Валюта) В (ВЫБРАТЬ ЗаказКлиента, Валюта ИЗ ОбъектыРасчетов ГДЕ КонтрольСрока)
		|	) КАК РасчетыСКлиентамиОстатки
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ОбъектыРасчетов КАК ОбъектыРасчетов
		|	ПО
		|		РасчетыСКлиентамиОстатки.ЗаказКлиента = ОбъектыРасчетов.ЗаказКлиента
		|		И РасчетыСКлиентамиОстатки.Валюта = ОбъектыРасчетов.Валюта
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ОбъектыРасчетов.Договор = ДанныеДоговоров.Договор
		|		И ОбъектыРасчетов.Валюта = ДанныеДоговоров.Валюта
		|
		|ГДЕ
		|	НЕ &НоваяАрхитектураВзаиморасчетов
		|	И РасчетыСКлиентамиОстатки.СуммаОстаток > 0
		|	И (РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыРасчетов.Договор,
		|	РасчетыСКлиентамиОстатки.Валюта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъектыРасчетов.Договор                                   КАК Договор,
		|	РасчетыСКлиентамиПоСрокамОстатки.Валюта                   КАК Валюта,
		|	СУММА(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
		|			- ЕСТЬNULL(РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток,0)) КАК ПросроченнаяЗадолженность
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|		&ПериодКонтроляСрокаДолга,
		|		(ОбъектРасчетов, Валюта) В (ВЫБРАТЬ ЗаказКлиента, Валюта ИЗ ОбъектыРасчетов ГДЕ КонтрольСрока)
		|	) КАК РасчетыСКлиентамиПоСрокамОстатки
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ОбъектыРасчетов КАК ОбъектыРасчетов
		|	ПО
		|		РасчетыСКлиентамиПоСрокамОстатки.ОбъектРасчетов = ОбъектыРасчетов.ЗаказКлиента
		|		И РасчетыСКлиентамиПоСрокамОстатки.Валюта = ОбъектыРасчетов.Валюта
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ДанныеДоговоров КАК ДанныеДоговоров
		|	ПО
		|		ОбъектыРасчетов.Договор = ДанныеДоговоров.Договор
		|		И ОбъектыРасчетов.Валюта = ДанныеДоговоров.Валюта
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки(
		|		&ПериодКонтроляСрокаДолга,
		|		(ЗаказКлиента, Валюта) В (ВЫБРАТЬ ЗаказКлиента, Валюта ИЗ ОбъектыРасчетов ГДЕ КонтрольСрока)
		|	) КАК РасчетыСКлиентамиОстатки
		|	ПО
		|		РасчетыСКлиентамиПоСрокамОстатки.ОбъектРасчетов = РасчетыСКлиентамиОстатки.ЗаказКлиента
		|		И РасчетыСКлиентамиПоСрокамОстатки.Валюта = РасчетыСКлиентамиПоСрокамОстатки.Валюта
		|ГДЕ
		|	&НоваяАрхитектураВзаиморасчетов
		|	И РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ПериодКонтроляСрокаДолга,ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыРасчетов.Договор,
		|	РасчетыСКлиентамиПоСрокамОстатки.Валюта
		|
		|ИМЕЮЩИЕ СУММА(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
		|			- ЕСТЬNULL(РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток,0)) > 0
		|;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;

	// Контроль отрицательных остатков авансов при расчетах по накладным.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРасчетыСКлиентамиИзменениеАвансыПоНакладным") Тогда
		
		МассивКонтролей.Добавить(Врег("КонтрольЗачтенныхАвансовПоНакладнымКлиент"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	РасчетыСКлиентамиОстатки.ЗаказКлиента          КАК ДокументАванса,
		|	РасчетыСКлиентамиОстатки.Валюта                КАК Валюта,
		|	РасчетыСКлиентамиОстатки.СуммаОстаток          КАК СуммаПревышения
		|	
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(
		|		,
		|		(ЗаказКлиента, Валюта) В (ВЫБРАТЬ ЗаказКлиента, Валюта ИЗ ДвиженияРасчетыСКлиентамиИзменениеАвансыПоНакладным)
		|	) КАК РасчетыСКлиентамиОстатки
		|
		|ГДЕ
		|	РасчетыСКлиентамиОстатки.СуммаОстаток > 0
		|	И ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиОстатки.ЗаказКлиента) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),
		|													ТИП(Документ.ПриходныйКассовыйОрдер),
		|													ТИП(Документ.ОперацияПоПлатежнойКарте),
		|													ТИП(Документ.ВводОстатков))
		|
		|;
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	// Контроль отрицательных остатков авансов при расчетах по накладным.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРасчетыСПоставщикамиИзменениеАвансыПоНакладным") Тогда
		
		МассивКонтролей.Добавить(Врег("КонтрольЗачтенныхАвансовПоНакладнымПоставщик"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	РасчетыСПоставщикамиОстатки.ЗаказПоставщику          КАК ДокументАванса,
		|	РасчетыСПоставщикамиОстатки.Валюта                   КАК Валюта,
		|	РасчетыСПоставщикамиОстатки.СуммаОстаток             КАК СуммаПревышения
		|	
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|		,
		|		(ЗаказПоставщику, Валюта) В (ВЫБРАТЬ ЗаказПоставщику, Валюта ИЗ ДвиженияРасчетыСПоставщикамиИзменениеАвансыПоНакладным)
		|	) КАК РасчетыСПоставщикамиОстатки
		|
		|ГДЕ
		|	РасчетыСПоставщикамиОстатки.СуммаОстаток < 0
		|	И ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиОстатки.ЗаказПоставщику) В (ТИП(Документ.СписаниеБезналичныхДенежныхСредств),
		|													ТИП(Документ.РасходныйКассовыйОрдер),
		|													ТИП(Документ.ВводОстатков))
		|
		|;
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"РасчетыСКлиентамиИзмененияВводОстатков")  Тогда
		
		МассивКонтролей.Добавить(Врег("ОшибкиЕстьВводОстатковПослеКлиенты"));
		
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентамиИзменения.ОбъектРасчетов             КАК ОбъектРасчетов
			|ИЗ
			|	РасчетыСКлиентамиИзмененияВводОстатков КАК РасчетыСКлиентамиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
			|			ПО РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
			|				И РасчетыСКлиентамиИзменения.ОбъектРасчетов = РасчетыСКлиентами.ЗаказКлиента
			|				И РасчетыСКлиентамиИзменения.Период < РасчетыСКлиентами.Период 
			|				И ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) В (ТИП(Документ.ВводОстатков))
			|				И РасчетыСКлиентами.Сумма <> 0
			|	
			|ГДЕ
			|	НЕ ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиИзменения.Регистратор) В (ТИП(Документ.ВводОстатков))
			|;
			|///////////////////////////////////////////////////////////////////
			|";
		
		МассивКонтролей.Добавить(Врег("ОшибкиЕстьДвиженияДоКлиенты"));
		
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентамиИзменения.ОбъектРасчетов             КАК ОбъектРасчетов
			|ИЗ
			|	РасчетыСКлиентамиИзмененияВводОстатков КАК РасчетыСКлиентамиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
			|			ПО РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
			|				И РасчетыСКлиентамиИзменения.ОбъектРасчетов = РасчетыСКлиентами.ЗаказКлиента
			|				И РасчетыСКлиентамиИзменения.Период > РасчетыСКлиентами.Период 
			|				И НЕ ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) В (ТИП(Документ.ВводОстатков))
			|				И РасчетыСКлиентами.Сумма <> 0
			|	
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиИзменения.Регистратор) В (ТИП(Документ.ВводОстатков))
			|;
			|///////////////////////////////////////////////////////////////////
			|";
		
	КонецЕсли;
	
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"РасчетыСПоставщикамиИзмененияВводОстатков") Тогда
		
		МассивКонтролей.Добавить(Врег("ОшибкиЕстьВводОстатковПослеПоставщики"));
		
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСПоставщикамиИзменения.ОбъектРасчетов             КАК ОбъектРасчетов
			|ИЗ
			|	РасчетыСПоставщикамиИзмененияВводОстатков КАК РасчетыСПоставщикамиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
			|			ПО РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам
			|				И РасчетыСПоставщикамиИзменения.ОбъектРасчетов = РасчетыСПоставщиками.ЗаказПоставщику
			|				И РасчетыСПоставщикамиИзменения.Период < РасчетыСПоставщиками.Период 
			|				И ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) В (ТИП(Документ.ВводОстатков))
			|				И РасчетыСПоставщиками.Сумма <> 0
			|	
			|ГДЕ
			|	НЕ ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиИзменения.Регистратор) В (ТИП(Документ.ВводОстатков))
			|;
			|///////////////////////////////////////////////////////////////////
			|";
		
		МассивКонтролей.Добавить(Врег("ОшибкиЕстьДвиженияДоПоставщики"));
		
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСПоставщикамиИзменения.ОбъектРасчетов             КАК ОбъектРасчетов
			|ИЗ
			|	РасчетыСПоставщикамиИзмененияВводОстатков КАК РасчетыСПоставщикамиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
			|			ПО РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам
			|				И РасчетыСПоставщикамиИзменения.ОбъектРасчетов = РасчетыСПоставщиками.ЗаказПоставщику
			|				И РасчетыСПоставщикамиИзменения.Период > РасчетыСПоставщиками.Период 
			|				И НЕ ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) В (ТИП(Документ.ВводОстатков))
			|				И РасчетыСПоставщиками.Сумма <> 0
			|	
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиИзменения.Регистратор) В (ТИП(Документ.ВводОстатков))
			|;
			|///////////////////////////////////////////////////////////////////
			|";
		
	КонецЕсли;
	
	
	// Контроль остатков в ячейках по ТоварыВЯчейках.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыВЯчейкахИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ВТМногооборотнаяТара"));
		МассивКонтролей.Добавить(Врег("ВТЯчейкиКонтролироватьОбособление"));
		МассивКонтролей.Добавить(Врег("ТоварыВЯчейках"));
		МассивКонтролей.Добавить(Врег("НесколькоНазначенийВОбособленныхЯчейках"));
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СпрНоменклатура.Ссылка
		|ПОМЕСТИТЬ ВТМногооборотнаяТара
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СкладскиеЯчейки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТЯчейкиКонтролироватьОбособление
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбластиХранения КАК ОбластиХранения
		|		ПО СкладскиеЯчейки.ОбластьХранения = ОбластиХранения.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияТоварыВЯчейкахИзменение КАК ДвиженияТоварыВЯчейкахИзменение
		|		ПО СкладскиеЯчейки.Ссылка = ДвиженияТоварыВЯчейкахИзменение.Ячейка
		|ГДЕ
		|	ОбластиХранения.КонтролироватьОбособление
		|	И ДвиженияТоварыВЯчейкахИзменение.КРазмещениюИзменение < 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
		|	ТоварыВЯчейкахОстатки.Назначение КАК Назначение,
		|	ВЫБОР
		|		КОГДА ТоварыВЯчейкахОстатки.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА
		|				ТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмерения
		|			ИНАЧЕ
		|				ТоварыВЯчейкахОстатки.Упаковка
		|		КОНЕЦ КАК Упаковка,
		|	ТаблицаИзменений.Серия КАК Серия,
		|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
		|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток - ТоварыВЯчейкахОстатки.КОтборуОстаток) КАК Количество
		|ИЗ
		|	ДвиженияТоварыВЯчейкахИзменение КАК ТаблицаИзменений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				,
		|				(Номенклатура, Характеристика, Назначение, Упаковка, Ячейка) В
		|					(ВЫБРАТЬ
		|						Таблица.Номенклатура,
		|						Таблица.Характеристика,
		|						Таблица.Назначение,
		|						Таблица.Упаковка,
		|						Таблица.Ячейка
		|					ИЗ
		|						ДвиженияТоварыВЯчейкахИзменение КАК Таблица)) КАК ТоварыВЯчейкахОстатки
		|		ПО ТаблицаИзменений.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|			И ТаблицаИзменений.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
		|			И ТаблицаИзменений.Назначение = ТоварыВЯчейкахОстатки.Назначение
		|			И ТаблицаИзменений.Упаковка = ТоварыВЯчейкахОстатки.Упаковка
		|			И ТаблицаИзменений.Ячейка = ТоварыВЯчейкахОстатки.Ячейка
		|			И (ВЫБОР
		|				КОГДА ТаблицаИзменений.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ТаблицаИзменений.Серия = ТоварыВЯчейкахОстатки.Серия
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика,
		|	ТоварыВЯчейкахОстатки.Назначение,
		|	ТоварыВЯчейкахОстатки.Упаковка,
		|	ТаблицаИзменений.Серия,
		|	ТоварыВЯчейкахОстатки.Ячейка
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток - ТоварыВЯчейкахОстатки.КОтборуОстаток) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Ячейка
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(
		|			,
		|			Ячейка В
		|					(ВЫБРАТЬ
		|						ВТЯчейкиКонтролироватьОбособление.Ссылка
		|					ИЗ
		|						ВТЯчейкиКонтролироватьОбособление КАК ВТЯчейкиКонтролироватьОбособление)
		|				И НЕ Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТМногооборотнаяТара.Ссылка
		|						ИЗ
		|							ВТМногооборотнаяТара КАК ВТМногооборотнаяТара)
		|				И Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток - ТоварыВЯчейкахОстатки.КОтборуОстаток + ТоварыВЯчейкахОстатки.КРазмещениюОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстатки.Ячейка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыВЯчейкахОстатки.Назначение) > 1";
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	// Контроль остатков по ТоварыНаСкладах 
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыНаСкладахИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ТоварыНаСкладах"));
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТоварыНаСкладахОстатки.Помещение КАК Помещение,
		|	ТаблицаИзменений.Серия КАК Серия,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток) КАК Количество
		|ИЗ
		|	ДвиженияТоварыНаСкладахИзменение КАК ТаблицаИзменений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				(Номенклатура, Характеристика, Назначение, Склад, Помещение) В
		|					(ВЫБРАТЬ
		|						Таблица.Номенклатура,
		|						Таблица.Характеристика,
		|						Таблица.Назначение,
		|						Таблица.Склад,
		|						Таблица.Помещение
		|					ИЗ
		|						ДвиженияТоварыНаСкладахИзменение КАК Таблица)) КАК ТоварыНаСкладахОстатки
		|		ПО ТаблицаИзменений.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И ТаблицаИзменений.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|			И ТаблицаИзменений.Назначение = ТоварыНаСкладахОстатки.Назначение
		|			И ТаблицаИзменений.Склад = ТоварыНаСкладахОстатки.Склад
		|			И ТаблицаИзменений.Помещение = ТоварыНаСкладахОстатки.Помещение
		|			И (ВЫБОР
		|				КОГДА ТаблицаИзменений.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ТаблицаИзменений.Серия = ТоварыНаСкладахОстатки.Серия
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика,
		|	ТоварыНаСкладахОстатки.Назначение,
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения,
		|	ТоварыНаСкладахОстатки.Помещение,
		|	ТаблицаИзменений.Серия
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток) < 0;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	// Контроль остатков по ТоварыКОтбору.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыКОтборуИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("ТоварныеМестаНоменклатуры"));
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДвиженияТоварыКОтборуИзменение.Распоряжение,
		|	ДвиженияТоварыКОтборуИзменение.Номенклатура,
		|	ДвиженияТоварыКОтборуИзменение.Характеристика,
		|	ДвиженияТоварыКОтборуИзменение.Назначение,
		|	ДвиженияТоварыКОтборуИзменение.Серия,
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК ТоварноеМесто,
		|	УпаковкиЕдиницыИзмерения.КоличествоУпаковок
		|ПОМЕСТИТЬ ТоварныеМестаНоменклатуры
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияТоварыКОтборуИзменение КАК ДвиженияТоварыКОтборуИзменение
		|		ПО УпаковкиЕдиницыИзмерения.Владелец = ДвиженияТоварыКОтборуИзменение.Номенклатура
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДвиженияТоварыКОтборуИзменение.Распоряжение,
		|	ДвиженияТоварыКОтборуИзменение.Номенклатура,
		|	ДвиженияТоварыКОтборуИзменение.Характеристика,
		|	ДвиженияТоварыКОтборуИзменение.Назначение,
		|	ДвиженияТоварыКОтборуИзменение.Серия,
		|	УпаковкиЕдиницыИзмерения.Ссылка,
		|	УпаковкиЕдиницыИзмерения.КоличествоУпаковок
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияТоварыКОтборуИзменение КАК ДвиженияТоварыКОтборуИзменение
		|		ПО УпаковкиЕдиницыИзмерения.Владелец = ДвиженияТоварыКОтборуИзменение.Номенклатура.НаборУпаковок
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)";
		
		ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
		
		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда
			
			МассивКонтролей.Добавить(Врег("ВременнаяТаблицаОборотовСТоварнымиМестами"));
			МассивКонтролей.Добавить(Врег("ВременнаяТаблицаОборотов"));
			ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ
			|	ТоварыКОтборуОбороты.Распоряжение КАК Распоряжение,
			|	ТоварыКОтборуОбороты.Номенклатура КАК Номенклатура,
			|	ТоварыКОтборуОбороты.Характеристика КАК Характеристика,
			|	ТоварыКОтборуОбороты.Назначение КАК Назначение,
			|	ТоварыКОтборуОбороты.Серия КАК Серия,
			|	ТоварыКОтборуОбороты.ТоварноеМесто КАК ТоварноеМесто,
			|	СУММА(ТоварыКОтборуОбороты.КОтборуПриход) КАК Количество
			|ПОМЕСТИТЬ ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами
			|ИЗ
			|	РегистрНакопления.ТоварыКОтбору.Обороты(
			|			,
			|			,
			|			,
			|			(Распоряжение, Номенклатура, Характеристика, Назначение, Серия) В
			|				(ВЫБРАТЬ
			|					Таблица.Распоряжение,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Назначение,
			|					Таблица.Серия
			|				ИЗ
			|					ДвиженияТоварыКОтборуИзменение КАК Таблица)) КАК ТоварыКОтборуОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыКОтборуОбороты.Распоряжение,
			|	ТоварыКОтборуОбороты.Номенклатура,
			|	ТоварыКОтборуОбороты.Характеристика,
			|	ТоварыКОтборуОбороты.Назначение,
			|	ТоварыКОтборуОбороты.Серия,
			|	ТоварыКОтборуОбороты.ТоварноеМесто
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВнутренняяТаблица.Распоряжение,
			|	ВнутренняяТаблица.Номенклатура,
			|	ВнутренняяТаблица.Характеристика,
			|	ВнутренняяТаблица.Назначение,
			|	ВнутренняяТаблица.Серия,
			|	СУММА(ВнутренняяТаблица.Количество) КАК Количество
			|ПОМЕСТИТЬ ВременнаяТаблицаТаблицаОборотов
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТоварныеМестаНоменклатуры.Распоряжение КАК Распоряжение,
			|		ТоварныеМестаНоменклатуры.Номенклатура КАК Номенклатура,
			|		ТоварныеМестаНоменклатуры.Характеристика КАК Характеристика,
			|		ТоварныеМестаНоменклатуры.Назначение КАК Назначение,
			|		ТоварныеМестаНоменклатуры.Серия КАК Серия,
			|		МИНИМУМ(ВЫБОР
			|				КОГДА ЕСТЬNULL(ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Количество, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок - (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Количество, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))) >= 0
			|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Количество, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))
			|				ИНАЧЕ (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Количество, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))) - 1
			|			КОНЕЦ) КАК Количество
			|	ИЗ
			|		ТоварныеМестаНоменклатуры КАК ТоварныеМестаНоменклатуры
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами КАК ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами
			|			ПО ТоварныеМестаНоменклатуры.Распоряжение = ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Распоряжение
			|				И ТоварныеМестаНоменклатуры.Номенклатура = ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Номенклатура
			|				И ТоварныеМестаНоменклатуры.Характеристика = ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Характеристика
			|				И ТоварныеМестаНоменклатуры.Назначение = ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Назначение
			|				И ТоварныеМестаНоменклатуры.Серия = ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Серия
			|				И ТоварныеМестаНоменклатуры.ТоварноеМесто = ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.ТоварноеМесто
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ТоварныеМестаНоменклатуры.Распоряжение,
			|		ТоварныеМестаНоменклатуры.Номенклатура,
			|		ТоварныеМестаНоменклатуры.Характеристика,
			|		ТоварныеМестаНоменклатуры.Назначение,
			|		ТоварныеМестаНоменклатуры.Серия
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Распоряжение,
			|		ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Номенклатура,
			|		ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Характеристика,
			|		ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Назначение,
			|		ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Серия,
			|		ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.Количество
			|	ИЗ
			|		ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами КАК ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами
			|	ГДЕ
			|		ЕСТЬNULL(ВременнаяТаблицаТаблицаОборотовСТоварнымиМестами.ТоварноеМесто.ТипУпаковки, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)) КАК ВнутренняяТаблица
			|
			|СГРУППИРОВАТЬ ПО
			|	ВнутренняяТаблица.Распоряжение,
			|	ВнутренняяТаблица.Номенклатура,
			|	ВнутренняяТаблица.Характеристика,
			|	ВнутренняяТаблица.Назначение,
			|	ВнутренняяТаблица.Серия";
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
		КонецЕсли;
				
		
		МассивКонтролей.Добавить(Врег("ВременнаяТаблицаОстатковСТоварнымиМестами"));
		МассивКонтролей.Добавить(Врег("ВременнаяТаблицаОстатков"));
		МассивКонтролей.Добавить(Врег("ТоварыКОтбору"));
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	ТоварыКОтборуОстатки.Распоряжение КАК Распоряжение,
		|	ТоварыКОтборуОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКОтборуОстатки.Характеристика КАК Характеристика,
		|	ТоварыКОтборуОстатки.Назначение КАК Назначение,
		|	ТоварыКОтборуОстатки.Серия КАК Серия,
		|	ТоварыКОтборуОстатки.ТоварноеМесто КАК ТоварноеМесто,
		|	СУММА(ТоварыКОтборуОстатки.КОтборуОстаток) КАК КОтборуОстаток,
		|	СУММА(ТоварыКОтборуОстатки.ОтбираетсяОстаток) КАК ОтбираетсяОстаток,
		|	СУММА(ТоварыКОтборуОстатки.ОтобраноОстаток) КАК ОтобраноОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами
		|ИЗ
		|	РегистрНакопления.ТоварыКОтбору.Остатки(
		|			,
		|			(Распоряжение, Номенклатура, Характеристика, Назначение, Серия) В
		|				(ВЫБРАТЬ
		|					Таблица.Распоряжение,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Назначение,
		|					Таблица.Серия
		|				ИЗ
		|					ДвиженияТоварыКОтборуИзменение КАК Таблица)) КАК ТоварыКОтборуОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтборуОстатки.Распоряжение,
		|	ТоварыКОтборуОстатки.Номенклатура,
		|	ТоварыКОтборуОстатки.Характеристика,
		|	ТоварыКОтборуОстатки.Назначение,
		|	ТоварыКОтборуОстатки.Серия,
		|	ТоварыКОтборуОстатки.ТоварноеМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнутренняяТаблица.Распоряжение,
		|	ВнутренняяТаблица.Номенклатура,
		|	ВнутренняяТаблица.Характеристика,
		|	ВнутренняяТаблица.Назначение,
		|	ВнутренняяТаблица.Серия,
		|	СУММА(ВнутренняяТаблица.КОтборуОстаток) КАК КОтборуОстаток,
		|	СУММА(ВнутренняяТаблица.ОтбираетсяОстаток) КАК ОтбираетсяОстаток,
		|	СУММА(ВнутренняяТаблица.ОтобраноОстаток) КАК ОтобраноОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаТаблицаОстатков
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварныеМестаНоменклатуры.Распоряжение КАК Распоряжение,
		|		ТоварныеМестаНоменклатуры.Номенклатура КАК Номенклатура,
		|		ТоварныеМестаНоменклатуры.Характеристика КАК Характеристика,
		|		ТоварныеМестаНоменклатуры.Назначение КАК Назначение,
		|		ТоварныеМестаНоменклатуры.Серия КАК Серия,
		|		МИНИМУМ(ВЫБОР
		|				КОГДА ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.КОтборуОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок - (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.КОтборуОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))) >= 0
		|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.КОтборуОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))
		|				ИНАЧЕ (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.КОтборуОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))) - 1
		|			КОНЕЦ) КАК КОтборуОстаток,
		|		МИНИМУМ(ВЫБОР
		|				КОГДА ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтбираетсяОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок - (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтбираетсяОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))) >= 0
		|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтбираетсяОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))
		|				ИНАЧЕ (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтбираетсяОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))) - 1
		|			КОНЕЦ) КАК ОтбираетсяОстаток,
		|		МИНИМУМ(ВЫБОР
		|				КОГДА ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтобраноОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок - (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтобраноОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))) >= 0
		|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтобраноОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))
		|				ИНАЧЕ (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтобраноОстаток, 0) / ТоварныеМестаНоменклатуры.ТоварноеМесто.КоличествоУпаковок КАК ЧИСЛО(12, 0))) - 1
		|			КОНЕЦ) КАК ОтобраноОстаток
		|	ИЗ
		|		ТоварныеМестаНоменклатуры КАК ТоварныеМестаНоменклатуры
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами КАК ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами
		|			ПО ТоварныеМестаНоменклатуры.Распоряжение = ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Распоряжение
		|				И ТоварныеМестаНоменклатуры.Номенклатура = ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Номенклатура
		|				И ТоварныеМестаНоменклатуры.Характеристика = ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Характеристика
		|				И ТоварныеМестаНоменклатуры.Назначение = ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Назначение
		|				И ТоварныеМестаНоменклатуры.Серия = ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Серия
		|				И ТоварныеМестаНоменклатуры.ТоварноеМесто = ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ТоварноеМесто
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТоварныеМестаНоменклатуры.Распоряжение,
		|		ТоварныеМестаНоменклатуры.Номенклатура,
		|		ТоварныеМестаНоменклатуры.Характеристика,
		|		ТоварныеМестаНоменклатуры.Назначение,
		|		ТоварныеМестаНоменклатуры.Серия
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Распоряжение,
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Номенклатура,
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Характеристика,
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Назначение,
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.Серия,
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.КОтборуОстаток,
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтбираетсяОстаток,
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ОтобраноОстаток
		|	ИЗ
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами КАК ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами
		|	ГДЕ
		|		ВременнаяТаблицаТаблицаОстатковСТоварнымиМестами.ТоварноеМесто = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ВнутренняяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнутренняяТаблица.Распоряжение,
		|	ВнутренняяТаблица.Номенклатура,
		|	ВнутренняяТаблица.Характеристика,
		|	ВнутренняяТаблица.Назначение,
		|	ВнутренняяТаблица.Серия";
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";
		
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ
			|	ТаблицаОстатков.Распоряжение,
			|	ТаблицаОстатков.Номенклатура,
			|	ТаблицаОстатков.Характеристика,
			|	ТаблицаОстатков.Назначение,
			|	ТаблицаОстатков.Серия,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.КОтборуОстаток - ТаблицаОстатков.ОтобраноОстаток - ТаблицаОстатков.ОтбираетсяОстаток КАК Количество,
			|	ТаблицаОстатков.ОтобраноОстаток КАК КоличествоОтобрано
			|ИЗ
			|	ВременнаяТаблицаТаблицаОстатков КАК ТаблицаОстатков
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаТаблицаОборотов КАК ТаблицаОборотов
			|		ПО ТаблицаОстатков.Распоряжение = ТаблицаОборотов.Распоряжение
			|			И ТаблицаОстатков.Номенклатура = ТаблицаОборотов.Номенклатура
			|			И ТаблицаОстатков.Характеристика = ТаблицаОборотов.Характеристика
			|			И ТаблицаОстатков.Назначение = ТаблицаОборотов.Назначение
			|			И ТаблицаОстатков.Серия = ТаблицаОборотов.Серия
			|ГДЕ
			|	(ТаблицаОстатков.КОтборуОстаток - ТаблицаОстатков.ОтобраноОстаток - ТаблицаОстатков.ОтбираетсяОстаток < ВЫБОР
			|				КОГДА ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
			|					ТОГДА -&ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ЕСТЬNULL(ТаблицаОборотов.Количество, 0)
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|			ИЛИ ТаблицаОстатков.ОтобраноОстаток < 0
			|			ИЛИ ВЫБОР
			|				КОГДА ТаблицаОстатков.КОтборуОстаток = 0
			|					ТОГДА ТаблицаОстатков.ОтобраноОстаток <> 0
			|				ИНАЧЕ ЛОЖЬ
			|			КОНЕЦ)";
			
			ПакетЗапросов.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров", ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров);
			ПакетЗапросов.УстановитьПараметр("МерныеТипыЕдиницИзмерений", Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ
			|	ТаблицаОстатков.Распоряжение,
			|	ТаблицаОстатков.Номенклатура,
			|	ТаблицаОстатков.Характеристика,
			|	ТаблицаОстатков.Назначение,
			|	ТаблицаОстатков.Серия,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.КОтборуОстаток - ТаблицаОстатков.ОтобраноОстаток - ТаблицаОстатков.ОтбираетсяОстаток КАК Количество,
			|	ТаблицаОстатков.ОтобраноОстаток КАК КоличествоОтобрано
			|ИЗ
			|	ВременнаяТаблицаТаблицаОстатков КАК ТаблицаОстатков
			|ГДЕ
			|	(ТаблицаОстатков.КОтборуОстаток - ТаблицаОстатков.ОтобраноОстаток - ТаблицаОстатков.ОтбираетсяОстаток < 0
			|			ИЛИ ТаблицаОстатков.ОтобраноОстаток < 0)";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	// Контроль отрицательных остатков ТоварыКОформлениюДокументовИмпорта.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыКОформлениюДокументовИмпортаИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ТоварыКОформлениюДокументовИмпорта"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.Организация         КАК Организация,
		|	ТаблицаОстатков.Поставщик           КАК Поставщик,
		|	ТаблицаОстатков.ДокументПоступления КАК ДокументПоступления,
		|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Номенклатура   КАК Номенклатура,
		|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.МестоХранения  КАК Склад,
		|	ТаблицаОстатков.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.ВидЗапасов          КАК ВидЗапасов,
		|	ТаблицаОстатков.ТипДокументаИмпорта КАК ТипДокументаИмпорта,
		|	ТаблицаОстатков.КоличествоПоРНПТОстаток   КАК КоличествоПоРНПТОстаток,
		|	ТаблицаОстатков.КоличествоОстаток   КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюДокументовИмпорта.Остатки(,
		|			(Организация, Поставщик, ДокументПоступления, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипДокументаИмпорта) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.Поставщик,
		|					Таблица.ДокументПоступления,
		|					Таблица.АналитикаУчетаНоменклатуры,
		|					Таблица.ВидЗапасов,
		|					Таблица.ТипДокументаИмпорта
		|				ИЗ
		|					ДвиженияТоварыКОформлениюДокументовИмпортаИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	ТаблицаОстатков.КоличествоОстаток < 0 ИЛИ ТаблицаОстатков.КоличествоПоРНПТОстаток < 0;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	//++ НЕ УТ
	
	// Контроль отрицательных остатков ЗаказыМатериаловВПроизводство.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаказыМатериаловВПроизводствоИзменение") Тогда
		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
		Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("ЗаказыМатериаловВПроизводство"));
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.Распоряжение                  КАК Заказ,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.КодСтроки                     КАК КодСтроки,
			|	ТаблицаОстатков.Склад                         КАК Склад,
			|	ТаблицаОстатков.Назначение                    КАК Назначение,
			|	ТаблицаОстатков.НазначениеОтправителя         КАК НазначениеОтправителя,
			|	ТаблицаОстатков.Подразделение                 КАК Подразделение,
			|	ТаблицаОстатков.КОформлениюОстаток            КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаказыМатериаловВПроизводство.Остатки(,
			|			(Распоряжение, Номенклатура, Характеристика, Серия, КодСтроки, Склад, Назначение, НазначениеОтправителя, Подразделение) В
			|				(ВЫБРАТЬ
			|					Таблица.Распоряжение,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Серия,
			|					Таблица.КодСтроки,
			|					Таблица.Склад,
			|					Таблица.Назначение,
			|					Таблица.НазначениеОтправителя,
			|					Таблица.Подразделение
			|				ИЗ
			|					ДвиженияЗаказыМатериаловВПроизводствоИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток < 0;
			|///////////////////////////////////////////////////////////////////
			|";
		Иначе
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.Распоряжение                  КАК Заказ,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.КодСтроки                     КАК КодСтроки,
			|	ТаблицаОстатков.Склад                         КАК Склад,
			|	ТаблицаОстатков.Назначение                    КАК Назначение,
			|	ТаблицаОстатков.НазначениеОтправителя         КАК НазначениеОтправителя,
			|	ТаблицаОстатков.Подразделение                 КАК Подразделение,
			|	ТаблицаОстатков.КОформлениюОстаток            КАК Количество
			|ИЗ
			|	ВТЗаказыМатериаловВПроизводствоОстатки  КАК ТаблицаОстатков
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаказыМатериаловВПроизводство КАК ДопустимыеОтклонения
			|		ПО
			|			ТаблицаОстатков.Распоряжение     = ДопустимыеОтклонения.Распоряжение
			|			И ТаблицаОстатков.Номенклатура   = ДопустимыеОтклонения.Номенклатура
			|			И ТаблицаОстатков.Характеристика = ДопустимыеОтклонения.Характеристика
			|			И ТаблицаОстатков.Склад          = ДопустимыеОтклонения.Склад
			|			И ТаблицаОстатков.Серия          = ДопустимыеОтклонения.Серия
			|			И ТаблицаОстатков.Назначение     = ДопустимыеОтклонения.Назначение
			|			И ТаблицаОстатков.НазначениеОтправителя = ДопустимыеОтклонения.НазначениеОтправителя
			|			И ТаблицаОстатков.Подразделение  = ДопустимыеОтклонения.Подразделение
			|
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение,0) < 0;
			|///////////////////////////////////////////////////////////////////
			|";
		КонецЕсли;
		
	КонецЕсли;
	
	//++ НЕ УТКА
	// Контроль отрицательных остатков РаспоряженияНаВыпускПродукции
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРаспоряженияНаВыпускПродукцииИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль"));
		МассивКонтролей.Добавить(Врег("ВТ_РаспоряженияНаВыпускПродукцииКонтрольНаДату"));
		МассивКонтролей.Добавить(Врег("РаспоряженияНаВыпускПродукции"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.Распоряжение                  КАК Заказ,
		|	ТаблицаОстатков.Подразделение                 КАК Подразделение,
		|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                КАК Характеристика,
		|	ТаблицаОстатков.КодСтроки                     КАК КодСтроки,
		|	ТаблицаОстатков.Склад                         КАК Склад,
		|	ТаблицаОстатков.КОформлениюОстаток            КАК Количество
		|ПОМЕСТИТЬ ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль
		|ИЗ
		|	РегистрНакопления.РаспоряженияНаВыпускПродукции.Остатки(,
		|			(Распоряжение, Подразделение, Номенклатура, Характеристика, КодСтроки, Склад) В
		|				(ВЫБРАТЬ
		|					Таблица.Распоряжение,
		|					Таблица.Подразделение,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.КодСтроки,
		|					Таблица.Склад
		|				ИЗ
		|					ДвиженияРаспоряженияНаВыпускПродукцииИзменение КАК Таблица
		|			ГДЕ
		|				Таблица.КОформлениюИзменение > 0 ИЛИ Таблица.ЗаказаноИзменение > 0)) КАК ТаблицаОстатков
		|ГДЕ
		|	(ТаблицаОстатков.КОформлениюОстаток < 0
		|			ИЛИ ТаблицаОстатков.ЗаказаноОстаток < 0)
		|;
		|///////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Распоряжение,
		|	Таблица.Подразделение,
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.КодСтроки,
		|	Таблица.Склад
		|ПОМЕСТИТЬ ВТ_РаспоряженияНаВыпускПродукцииКонтрольНаДату
		|ИЗ
		|	ДвиженияРаспоряженияНаВыпускПродукцииИзменение КАК Таблица
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль
		|	ПО Таблица.Распоряжение = ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль.Заказ
		|		И Таблица.Подразделение = ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль.Подразделение
		|		И Таблица.Номенклатура = ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль.Номенклатура
		|		И Таблица.Характеристика = ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль.Характеристика
		|		И Таблица.КодСтроки = ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль.КодСтроки
		|		И Таблица.Склад = ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль.Склад
		|
		|ГДЕ
		|	ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль.Заказ ЕСТЬ NULL
		|;
		|///////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛОЖЬ                                          КАК КонтрольНаДату,
		|	ТаблицаОстатков.Заказ                         КАК Заказ,
		|	ДАТАВРЕМЯ(1, 1, 1)                            КАК ДатаВыпуска,
		|	ТаблицаОстатков.Подразделение                 КАК Подразделение,
		|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
		|	ТаблицаОстатков.ЕдиницаИзмерения              КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                КАК Характеристика,
		|	ТаблицаОстатков.КодСтроки                     КАК КодСтроки,
		|	ТаблицаОстатков.Склад                         КАК Склад,
		|	ТаблицаОстатков.Количество                    КАК Количество
		|ИЗ
		|	ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль КАК ТаблицаОстатков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА                                        КАК КонтрольНаДату,
		|	ТаблицаОстатков.Распоряжение                  КАК Заказ,
		|	ВЫБОР
		|		КОГДА ТаблицаОстатков.Распоряжение.ФактическоеОкончание <> ДАТАВРЕМЯ(1,1,1)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТаблицаОстатков.Распоряжение.ФактическоеОкончание, ДЕНЬ) 
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаОстатков.Распоряжение.Дата, ДЕНЬ)
		|	КОНЕЦ                                         КАК ДатаВыпуска,
		|	ТаблицаОстатков.Подразделение                 КАК Подразделение,
		|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                КАК Характеристика,
		|	ТаблицаОстатков.КодСтроки                     КАК КодСтроки,
		|	ТаблицаОстатков.Склад                         КАК Склад,
		|	ТаблицаОстатков.КОформлениюОстаток            КАК Количество
		|ИЗ
		|	РегистрНакопления.РаспоряженияНаВыпускПродукции.Остатки(&ДатаКонтроля,
		|			(Распоряжение, Подразделение, Номенклатура, Характеристика, КодСтроки, Склад) В
		|				(ВЫБРАТЬ
		|					Таблица.Распоряжение,
		|					Таблица.Подразделение,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.КодСтроки,
		|					Таблица.Склад
		|				ИЗ
		|					ВТ_РаспоряженияНаВыпускПродукцииКонтрольНаДату КАК Таблица)
		|	) КАК ТаблицаОстатков
		|ГДЕ
		|	&ВыполнятьКонтрольДатыВыпуска
		|	И (ТаблицаОстатков.КОформлениюОстаток < 0
		|			ИЛИ ТаблицаОстатков.ЗаказаноОстаток < 0)
		|;
		|///////////////////////////////////////////////////////////////////
		|";
		
		ЗапросДаты = Новый Запрос("ВЫБРАТЬ МИНИМУМ(Т.ДатаКонтроля) КАК Дата ИЗ ДвиженияРаспоряженияНаВыпускПродукцииИзменение КАК Т");
		ЗапросДаты.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
		ВыборкаДаты = ЗапросДаты.Выполнить().Выбрать();
		
		ВыполнятьКонтрольДатыВыпуска = ВыборкаДаты.Следующий() И ЗначениеЗаполнено(ВыборкаДаты.Дата);
		ДатаОстатка = ?(ВыполнятьКонтрольДатыВыпуска, ВыборкаДаты.Дата, '00010101');
		
		ПакетЗапросов.УстановитьПараметр("ДатаКонтроля", ДатаОстатка);
		ПакетЗапросов.УстановитьПараметр("ВыполнятьКонтрольДатыВыпуска", ВыполнятьКонтрольДатыВыпуска);
		
	КонецЕсли;
	
	// Контроль отрицательных остатков РаспоряженияНаПередачуИзПроизводства
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменение") Тогда
		
		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			МассивКонтролей.Добавить(Врег("ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль"));
			МассивКонтролей.Добавить(Врег("ВТ_РаспоряженияНаПередачуИзПроизводстваКонтрольНаДату"));
			МассивКонтролей.Добавить(Врег("РаспоряженияНаПередачуИзПроизводства"));
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.Распоряжение                  КАК Заказ,
			|	ТаблицаОстатков.КодСтроки                     КАК КодСтроки,
			|	ТаблицаОстатков.Отправитель                   КАК Отправитель,
			|	ТаблицаОстатков.Получатель                    КАК Получатель,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Назначение                    КАК Назначение,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.Операция                      КАК Операция,
			|	ТаблицаОстатков.КоличествоОстаток             КАК Количество
			|ПОМЕСТИТЬ ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль
			|ИЗ
			|	РегистрНакопления.РаспоряженияНаПередачуИзПроизводства.Остатки(,
			|			(Распоряжение, КодСтроки, Отправитель, Получатель, Номенклатура, Характеристика, Назначение, Серия, Операция) В
			|				(ВЫБРАТЬ
			|					Таблица.Распоряжение,
			|					Таблица.КодСтроки,
			|					Таблица.Отправитель,
			|					Таблица.Получатель,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Назначение,
			|					Таблица.Серия,
			|					Таблица.Операция
			|				ИЗ
			|					ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КоличествоОстаток < 0
			|;
			|///////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.Распоряжение,
			|	Таблица.КодСтроки,
			|	Таблица.Отправитель,
			|	Таблица.Получатель,
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Назначение,
			|	Таблица.Серия,
			|	Таблица.Операция
			|ПОМЕСТИТЬ ВТ_РаспоряженияНаПередачуИзПроизводстваКонтрольНаДату
			|ИЗ
			|	ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменение КАК Таблица
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль
			|	ПО Таблица.Распоряжение = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Заказ
			|		И Таблица.КодСтроки = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.КодСтроки
			|		И Таблица.Отправитель = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Отправитель
			|		И Таблица.Получатель = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Получатель
			|		И Таблица.Номенклатура = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Номенклатура
			|		И Таблица.Характеристика = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Характеристика
			|		И Таблица.Назначение = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Назначение
			|		И Таблица.Серия = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Серия
			|		И Таблица.Операция = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Операция
			|
			|ГДЕ 
			|	ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Заказ ЕСТЬ NULL
			|;
			|///////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЛОЖЬ                                          КАК КонтрольНаДату,
			|	ТаблицаОстатков.Заказ                         КАК Заказ,
			|	ТаблицаОстатков.Отправитель                   КАК Отправитель,
			|	ТаблицаОстатков.Получатель                    КАК Получатель,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.ЕдиницаИзмерения              КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Назначение                    КАК Назначение,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.Операция                      КАК Операция,
			|	ТаблицаОстатков.Количество                    КАК Количество
			|ИЗ
			|	ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль КАК ТаблицаОстатков
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ИСТИНА                                        КАК КонтрольНаДату,
			|	ТаблицаОстатков.Распоряжение                  КАК Заказ,
			|	ТаблицаОстатков.Отправитель                   КАК Отправитель,
			|	ТаблицаОстатков.Получатель                    КАК Получатель,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Назначение                    КАК Назначение,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.Операция                      КАК Операция,
			|	ТаблицаОстатков.КоличествоОстаток             КАК Количество
			|ИЗ
			|	РегистрНакопления.РаспоряженияНаПередачуИзПроизводства.Остатки(&ДатаКонтроля,
			|			(Распоряжение, КодСтроки, Отправитель, Получатель, Номенклатура, Характеристика, Назначение, Серия, Операция) В
			|				(ВЫБРАТЬ
			|					Таблица.Распоряжение,
			|					Таблица.КодСтроки,
			|					Таблица.Отправитель,
			|					Таблица.Получатель,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Назначение,
			|					Таблица.Серия,
			|					Таблица.Операция
			|				ИЗ
			|					ВТ_РаспоряженияНаПередачуИзПроизводстваКонтрольНаДату КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КоличествоОстаток < 0
			|;
			|///////////////////////////////////////////////////////////////////
			|";
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов")
			И Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства Тогда
			
			Если НЕ ПакетЗапросов.Параметры.Свойство("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров") Тогда
				ПакетЗапросов.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров",
					Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить());
			КонецЕсли;
			
			Если НЕ ПакетЗапросов.Параметры.Свойство("МерныеТипыЕдиницИзмерений") Тогда
				ПакетЗапросов.УстановитьПараметр("МерныеТипыЕдиницИзмерений",
					Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
			КонецЕсли;
			
			МассивКонтролей.Добавить(Врег("ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменениеМерныеТовары"));
			МассивКонтролей.Добавить(Врег("ВТДопустимыеОтклоненияРаспоряженияНаПередачуИзПроизводства"));
			МассивКонтролей.Добавить(Врег("ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль"));
			МассивКонтролей.Добавить(Врег("ВТ_РаспоряженияНаПередачуИзПроизводстваКонтрольНаДату"));
			МассивКонтролей.Добавить(Врег("РаспоряженияНаПередачуИзПроизводства"));
			
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	Таблица.Отправитель,
			|	Таблица.Получатель,
			|	Таблица.Распоряжение,
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Назначение,
			|	Таблица.Серия,
			|	Таблица.Операция,
			|	Таблица.КодСтроки
			|ПОМЕСТИТЬ ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменениеМерныеТовары
			|ИЗ
			|	ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменение КАК Таблица
			|
			|ГДЕ
			|	Таблица.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.Отправитель,
			|	Таблица.Получатель,
			|	Таблица.Распоряжение,
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Назначение,
			|	Таблица.Серия,
			|	Таблица.Операция,
			|	Таблица.КодСтроки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Таблица.Отправитель,
			|	Таблица.Получатель,
			|	Таблица.Распоряжение,
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Назначение,
			|	Таблица.Серия,
			|	Таблица.Операция,
			|	Таблица.КодСтроки
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			// Допустимые отклонения
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	КПередаче.Отправитель,
			|	КПередаче.Получатель,
			|	КПередаче.Распоряжение,
			|	КПередаче.Номенклатура,
			|	КПередаче.Характеристика,
			|	КПередаче.Назначение,
			|	КПередаче.Серия,
			|	КПередаче.Операция,
			|	КПередаче.КодСтроки,
			|	СУММА(КПередаче.Количество
			|		* (&ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100)) КАК ДопустимоеОтклонение
			|ПОМЕСТИТЬ ВТДопустимыеОтклоненияРаспоряженияНаПередачуИзПроизводства
			|ИЗ
			|	РегистрНакопления.РаспоряженияНаПередачуИзПроизводства КАК КПередаче
			|
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменениеМерныеТовары КАК Изменения
			|	ПО КПередаче.Отправитель			= Изменения.Отправитель
			|	И КПередаче.Получатель				= Изменения.Получатель
			|	И КПередаче.Распоряжение			= Изменения.Распоряжение
			|	И КПередаче.Номенклатура			= Изменения.Номенклатура
			|	И КПередаче.Характеристика			= Изменения.Характеристика
			|	И КПередаче.Назначение				= Изменения.Назначение
			|	И КПередаче.Серия					= Изменения.Серия
			|	И КПередаче.Операция				= Изменения.Операция
			|	И КПередаче.КодСтроки				= Изменения.КодСтроки
			|
			|ГДЕ
			|	КПередаче.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	КПередаче.Отправитель,
			|	КПередаче.Получатель,
			|	КПередаче.Распоряжение,
			|	КПередаче.Номенклатура,
			|	КПередаче.Характеристика,
			|	КПередаче.Назначение,
			|	КПередаче.Серия,
			|	КПередаче.Операция,
			|	КПередаче.КодСтроки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	КПередаче.Отправитель,
			|	КПередаче.Получатель,
			|	КПередаче.Распоряжение,
			|	КПередаче.Номенклатура,
			|	КПередаче.Характеристика,
			|	КПередаче.Назначение,
			|	КПередаче.Серия,
			|	КПередаче.Операция,
			|	КПередаче.КодСтроки
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.Распоряжение                  КАК Заказ,
			|	ТаблицаОстатков.КодСтроки                     КАК КодСтроки,
			|	ТаблицаОстатков.Отправитель                   КАК Отправитель,
			|	ТаблицаОстатков.Получатель                    КАК Получатель,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Назначение                    КАК Назначение,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.Операция                      КАК Операция,
			|	ТаблицаОстатков.КоличествоОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение, 0) КАК Количество
			|ПОМЕСТИТЬ ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль
			|ИЗ
			|	РегистрНакопления.РаспоряженияНаПередачуИзПроизводства.Остатки(,
			|			(Распоряжение, КодСтроки, Отправитель, Получатель, Номенклатура, Характеристика, Назначение, Серия, Операция) В
			|				(ВЫБРАТЬ
			|					Таблица.Распоряжение,
			|					Таблица.КодСтроки,
			|					Таблица.Отправитель,
			|					Таблица.Получатель,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Назначение,
			|					Таблица.Серия,
			|					Таблица.Операция
			|				ИЗ
			|					ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДопустимыеОтклоненияРаспоряженияНаПередачуИзПроизводства КАК ДопустимыеОтклонения
			|	ПО ТаблицаОстатков.Отправитель		= ДопустимыеОтклонения.Отправитель
			|	И ТаблицаОстатков.Получатель		= ДопустимыеОтклонения.Получатель
			|	И ТаблицаОстатков.Распоряжение		= ДопустимыеОтклонения.Распоряжение
			|	И ТаблицаОстатков.Номенклатура		= ДопустимыеОтклонения.Номенклатура
			|	И ТаблицаОстатков.Характеристика	= ДопустимыеОтклонения.Характеристика
			|	И ТаблицаОстатков.Назначение		= ДопустимыеОтклонения.Назначение
			|	И ТаблицаОстатков.Серия				= ДопустимыеОтклонения.Серия
			|	И ТаблицаОстатков.Операция			= ДопустимыеОтклонения.Операция
			|	И ТаблицаОстатков.КодСтроки			= ДопустимыеОтклонения.КодСтроки
			|
			|ГДЕ
			|	ТаблицаОстатков.КоличествоОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение, 0) < 0
			|;
			|///////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.Распоряжение,
			|	Таблица.КодСтроки,
			|	Таблица.Отправитель,
			|	Таблица.Получатель,
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Назначение,
			|	Таблица.Серия,
			|	Таблица.Операция
			|ПОМЕСТИТЬ ВТ_РаспоряженияНаПередачуИзПроизводстваКонтрольНаДату
			|ИЗ
			|	ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменение КАК Таблица
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль
			|	ПО Таблица.Распоряжение = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Заказ
			|	И Таблица.КодСтроки = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.КодСтроки
			|	И Таблица.Отправитель = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Отправитель
			|	И Таблица.Получатель = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Получатель
			|	И Таблица.Номенклатура = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Номенклатура
			|	И Таблица.Характеристика = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Характеристика
			|	И Таблица.Назначение = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Назначение
			|	И Таблица.Серия = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Серия
			|	И Таблица.Операция = ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Операция
			|
			|ГДЕ
			|	ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль.Заказ ЕСТЬ NULL
			|;
			|///////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЛОЖЬ                                          КАК КонтрольНаДату,
			|	ТаблицаОстатков.Заказ                         КАК Заказ,
			|	ТаблицаОстатков.Отправитель                   КАК Отправитель,
			|	ТаблицаОстатков.Получатель                    КАК Получатель,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.ЕдиницаИзмерения              КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Назначение                    КАК Назначение,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.Операция                      КАК Операция,
			|	ТаблицаОстатков.Количество                    КАК Количество
			|ИЗ
			|	ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль КАК ТаблицаОстатков
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ИСТИНА                                        КАК КонтрольНаДату,
			|	ТаблицаОстатков.Распоряжение                  КАК Заказ,
			|	ТаблицаОстатков.Отправитель                   КАК Отправитель,
			|	ТаблицаОстатков.Получатель                    КАК Получатель,
			|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                КАК Характеристика,
			|	ТаблицаОстатков.Назначение                    КАК Назначение,
			|	ТаблицаОстатков.Серия                         КАК Серия,
			|	ТаблицаОстатков.Операция                      КАК Операция,
			|	ТаблицаОстатков.КоличествоОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение, 0) КАК Количество
			|ИЗ
			|	РегистрНакопления.РаспоряженияНаПередачуИзПроизводства.Остатки(&ДатаКонтроля,
			|			(Распоряжение, КодСтроки, Отправитель, Получатель, Номенклатура, Характеристика, Назначение, Серия, Операция) В
			|				(ВЫБРАТЬ
			|					Таблица.Распоряжение,
			|					Таблица.КодСтроки,
			|					Таблица.Отправитель,
			|					Таблица.Получатель,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Назначение,
			|					Таблица.Серия,
			|					Таблица.Операция
			|				ИЗ
			|					ВТ_РаспоряженияНаПередачуИзПроизводстваКонтрольНаДату КАК Таблица)
			|	) КАК ТаблицаОстатков
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДопустимыеОтклоненияРаспоряженияНаПередачуИзПроизводства КАК ДопустимыеОтклонения
			|	ПО ТаблицаОстатков.Отправитель		= ДопустимыеОтклонения.Отправитель
			|	И ТаблицаОстатков.Получатель		= ДопустимыеОтклонения.Получатель
			|	И ТаблицаОстатков.Распоряжение		= ДопустимыеОтклонения.Распоряжение
			|	И ТаблицаОстатков.Номенклатура		= ДопустимыеОтклонения.Номенклатура
			|	И ТаблицаОстатков.Характеристика	= ДопустимыеОтклонения.Характеристика
			|	И ТаблицаОстатков.Назначение		= ДопустимыеОтклонения.Назначение
			|	И ТаблицаОстатков.Серия				= ДопустимыеОтклонения.Серия
			|	И ТаблицаОстатков.Операция			= ДопустимыеОтклонения.Операция
			|	И ТаблицаОстатков.КодСтроки			= ДопустимыеОтклонения.КодСтроки
			|
			|ГДЕ
			|	ТаблицаОстатков.КоличествоОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение, 0) < 0
			|;
			|///////////////////////////////////////////////////////////////////
			|";
		Иначе
			// Выпуск разрешен с превышением на любой объем
		КонецЕсли;
		
		ЗапросДаты = Новый Запрос("ВЫБРАТЬ МИНИМУМ(Т.ДатаКонтроля) КАК Дата ИЗ ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменение КАК Т");
		ЗапросДаты.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
		ВыборкаДаты = ЗапросДаты.Выполнить().Выбрать();
		
		ДатаОстатка = ?(ВыборкаДаты.Следующий() И ЗначениеЗаполнено(ВыборкаДаты.Дата), ВыборкаДаты.Дата, Объект.Дата);
		
		ПакетЗапросов.УстановитьПараметр("ДатаКонтроля", ДатаОстатка);
		
	КонецЕсли;
	
	//-- НЕ УТКА
	
	// Контроль отрицательных остатков РаспоряженияНаСписаниеПоНормативам
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияРаспоряженияНаСписаниеПоНормативамИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль"));
		МассивКонтролей.Добавить(Врег("РаспоряженияНаСписаниеПоНормативам_КонтрольНаДату"));
		
		МассивКонтролей.Добавить(Врег("РаспоряженияНаСписаниеПоНормативам"));
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	ТаблицаОстатков.Организация КАК Организация,
		|	ТаблицаОстатков.Подразделение КАК Подразделение,
		|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика КАК Характеристика,
		|	ТаблицаОстатков.Распоряжение КАК Распоряжение,
		|	ТаблицаОстатков.КодСтроки КАК КодСтроки,
		|	ТаблицаОстатков.Назначение КАК Назначение,
		|	ТаблицаОстатков.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль
		|ИЗ
		|	РегистрНакопления.РаспоряженияНаСписаниеПоНормативам.Остатки(
		|			,
		|			(Организация, Подразделение, Номенклатура, Характеристика, Распоряжение, КодСтроки, Назначение) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.Подразделение,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Распоряжение,
		|					Таблица.КодСтроки,
		|					Таблица.Назначение
		|				ИЗ
		|					ДвиженияРаспоряженияНаСписаниеПоНормативамИзменение КАК Таблица)) КАК ТаблицаОстатков
		|ГДЕ
		|	ТаблицаОстатков.КоличествоОстаток < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Организация,
		|	Таблица.Подразделение,
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.Распоряжение,
		|	Таблица.КодСтроки,
		|	Таблица.Назначение
		|ПОМЕСТИТЬ РаспоряженияНаСписаниеПоНормативам_КонтрольНаДату
		|ИЗ
		|	ДвиженияРаспоряженияНаСписаниеПоНормативамИзменение КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль КАК РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль
		|		ПО Таблица.Организация = РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль.Организация
		|			И Таблица.Подразделение = РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль.Подразделение
		|			И Таблица.Номенклатура = РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль.Номенклатура
		|			И Таблица.Характеристика = РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль.Характеристика
		|			И Таблица.Распоряжение = РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль.Распоряжение
		|			И Таблица.КодСтроки = РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль.КодСтроки
		|			И Таблица.Назначение = РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль.Назначение
		|ГДЕ
		|	РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль.Распоряжение ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК КонтрольНаДату,
		|	ТаблицаОстатков.Организация КАК Организация,
		|	ТаблицаОстатков.Подразделение КАК Подразделение,
		|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
		|	ТаблицаОстатков.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика КАК Характеристика,
		|	ТаблицаОстатков.Распоряжение КАК Распоряжение,
		|	ТаблицаОстатков.КодСтроки КАК КодСтроки,
		|	ТаблицаОстатков.Назначение КАК Назначение,
		|	ТаблицаОстатков.Количество КАК Количество
		|ИЗ
		|	РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль КАК ТаблицаОстатков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ТаблицаОстатков.Организация,
		|	ТаблицаОстатков.Подразделение,
		|	ТаблицаОстатков.Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика,
		|	ТаблицаОстатков.Распоряжение,
		|	ТаблицаОстатков.КодСтроки,
		|	ТаблицаОстатков.Назначение,
		|	-(ТаблицаОстатков.КоличествоРасход - ТаблицаОстатков.КоличествоПриход)
		|ИЗ
		|	РегистрНакопления.РаспоряженияНаСписаниеПоНормативам.Обороты(
		|			&ДатаКонтроляПередЗаписьюНачало,
		|			&ДатаКонтроляПередЗаписьюКонец,
		|			,
		|			(Организация, Подразделение, Номенклатура, Характеристика, Распоряжение, КодСтроки, Назначение) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.Подразделение,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Распоряжение,
		|					Таблица.КодСтроки,
		|					Таблица.Назначение
		|				ИЗ
		|					РаспоряженияНаСписаниеПоНормативам_КонтрольНаДату КАК Таблица)
		|					И &ДатаКонтроляПередЗаписьюНачало <> ДатаВремя(1,1,1)) КАК ТаблицаОстатков
		|ГДЕ
		|	ТаблицаОстатков.КоличествоРасход > ТаблицаОстатков.КоличествоПриход
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ТаблицаОстатков.Организация,
		|	ТаблицаОстатков.Подразделение,
		|	ТаблицаОстатков.Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика,
		|	ТаблицаОстатков.Распоряжение,
		|	ТаблицаОстатков.КодСтроки,
		|	ТаблицаОстатков.Назначение,
		|	-(ТаблицаОстатков.КоличествоРасход - ТаблицаОстатков.КоличествоПриход)
		|ИЗ
		|	РегистрНакопления.РаспоряженияНаСписаниеПоНормативам.Обороты(
		|			&ДатаКонтроляПриЗаписиНачало,
		|			&ДатаКонтроляПриЗаписиКонец,
		|			,
		|			(Организация, Подразделение, Номенклатура, Характеристика, Распоряжение, КодСтроки, Назначение) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.Подразделение,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Распоряжение,
		|					Таблица.КодСтроки,
		|					Таблица.Назначение
		|				ИЗ
		|					РаспоряженияНаСписаниеПоНормативам_КонтрольНаДату КАК Таблица)
		|					И &ДатаКонтроляПриЗаписиНачало <> ДатаВремя(1,1,1)) КАК ТаблицаОстатков
		|ГДЕ
		|	ТаблицаОстатков.КоличествоРасход > ТаблицаОстатков.КоличествоПриход
		|;
		|///////////////////////////////////////////////////////////////////
		|";
		
		ЗапросДаты = Новый Запрос("ВЫБРАТЬ МИНИМУМ(Т.ДатаКонтроляПередЗаписью) КАК ДатаКонтроляПередЗаписью,
			|МИНИМУМ(Т.ДатаКонтроляПриЗаписи) КАК ДатаКонтроляПриЗаписи ИЗ ДвиженияРаспоряженияНаСписаниеПоНормативамИзменение КАК Т");
			
		ЗапросДаты.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
		ВыборкаДаты = ЗапросДаты.Выполнить().Выбрать();
		
		ДатаКонтроляПередЗаписьюНачало = Дата("00010101");
		ДатаКонтроляПередЗаписьюКонец = Дата("00010101");
		
		ДатаКонтроляПриЗаписиНачало = Дата("00010101");
		ДатаКонтроляПриЗаписиКонец = Дата("00010101");
		
		Если ВыборкаДаты.Следующий() Тогда
			
			Если ЗначениеЗаполнено(ВыборкаДаты.ДатаКонтроляПередЗаписью) Тогда
				ДатаКонтроляПередЗаписьюНачало = НачалоМесяца(ВыборкаДаты.ДатаКонтроляПередЗаписью);
				ДатаКонтроляПередЗаписьюКонец = КонецМесяца(ВыборкаДаты.ДатаКонтроляПередЗаписью);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДаты.ДатаКонтроляПриЗаписи) Тогда
				ДатаКонтроляПриЗаписиНачало = НачалоМесяца(ВыборкаДаты.ДатаКонтроляПриЗаписи);
				ДатаКонтроляПриЗаписиКонец = КонецМесяца(ВыборкаДаты.ДатаКонтроляПриЗаписи);
			КонецЕсли;
			
		КонецЕсли;
		
		ПакетЗапросов.УстановитьПараметр("ДатаКонтроляПередЗаписьюНачало",  ДатаКонтроляПередЗаписьюНачало);
		ПакетЗапросов.УстановитьПараметр("ДатаКонтроляПередЗаписьюКонец",   ДатаКонтроляПередЗаписьюКонец);
		
		ПакетЗапросов.УстановитьПараметр("ДатаКонтроляПриЗаписиНачало",     ДатаКонтроляПриЗаписиНачало);
		ПакетЗапросов.УстановитьПараметр("ДатаКонтроляПриЗаписиКонец",      ДатаКонтроляПриЗаписиКонец);
		
	КонецЕсли;
	
	//++ НЕ УТКА
	// Контроль отрицательных остатков ЗаказыНаПроизводствоСпецификации
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаказыНаПроизводствоСпецификацииИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ЗаказыНаПроизводствоСпецификации"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.ЗаказНаПроизводство           КАК Заказ,
		|	ТаблицаОстатков.КодСтрокиПродукция            КАК КодСтроки,
		|	ТаблицаОстатков.КодСтрокиЭтапыГрафик          КАК КодСтрокиЭтапыГрафик,
		|	ТаблицаОстатков.Этап                          КАК Этап,
		|	ТаблицаОстатков.Подразделение                 КАК Подразделение,
		|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                КАК Характеристика,
		|	ТаблицаОстатков.Назначение                    КАК Назначение,
		|	ТаблицаОстатков.ТипДвиженияЗапасов            КАК ТипДвиженияЗапасов,
		|	ТаблицаОстатков.ПроизводитсяВПроцессе         КАК ПроизводитсяВПроцессе,
		|	ТаблицаОстатков.ВариантОбеспечения            КАК ВариантОбеспечения,
		|	ТаблицаОстатков.ДатаПотребности               КАК ДатаПотребности,
		|	ТаблицаОстатков.Серия                         КАК Серия,
		|	ТаблицаОстатков.ЗаказаноОстаток               КАК КоличествоЗаказано
		|ИЗ
		|	РегистрНакопления.ЗаказыНаПроизводствоСпецификации.Остатки(,
		|			(ЗаказНаПроизводство, КодСтрокиПродукция, КодСтрокиЭтапыГрафик, Этап, Подразделение,
		|				Номенклатура, Характеристика, Назначение, ТипДвиженияЗапасов, ПроизводитсяВПроцессе, ВариантОбеспечения, ДатаПотребности, Серия) В
		|				(ВЫБРАТЬ
		|					Таблица.ЗаказНаПроизводство      КАК ЗаказНаПроизводство,
		|					Таблица.КодСтрокиПродукция       КАК КодСтрокиПродукция,
		|					Таблица.КодСтрокиЭтапыГрафик     КАК КодСтрокиЭтапыГрафик,
		|					Таблица.Этап                     КАК Этап,
		|					Таблица.Подразделение            КАК Подразделение,
		|					Таблица.Номенклатура             КАК Номенклатура,
		|					Таблица.Характеристика           КАК Характеристика,
		|					Таблица.Назначение               КАК Назначение,
		|					Таблица.ТипДвиженияЗапасов       КАК ТипДвиженияЗапасов,
		|					Таблица.ПроизводитсяВПроцессе    КАК ПроизводитсяВПроцессе,
		|					Таблица.ВариантОбеспечения       КАК ВариантОбеспечения,
		|					Таблица.ДатаПотребности          КАК ДатаПотребности,
		|					Таблица.Серия                    КАК Серия
		|				ИЗ
		|					ДвиженияЗаказыНаПроизводствоСпецификацииИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	(ТаблицаОстатков.ЗаказаноОстаток < 0);
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	// Контроль отрицательных остатков ТрудозатратыКОформлению
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТрудозатратыКОформлениюИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("ТрудозатратыКОформлению"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.Организация                     КАК Организация,
		|	ТаблицаОстатков.ПартияПроизводства              КАК ПартияПроизводства,
		|	ТаблицаОстатков.Распоряжение                    КАК Распоряжение,
		|	ТаблицаОстатков.ВидРабот                        КАК ВидРабот,
		|	ТаблицаОстатков.ВидРабот.ЕдиницаИзмерения       КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Исполнитель                     КАК Исполнитель,
		|	ТаблицаОстатков.Подразделение                   КАК Подразделение,
		|	ТаблицаОстатков.КодСтрокиРаспоряжения           КАК КодСтрокиРаспоряжения,
		|	ТаблицаОстатков.КоличествоОстаток               КАК Количество
		|ИЗ
		|	РегистрНакопления.ТрудозатратыКОформлению.Остатки(,
		|			(Организация, ПартияПроизводства, Распоряжение, ВидРабот, Исполнитель, Подразделение, КодСтрокиРаспоряжения) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.ПартияПроизводства,
		|					Таблица.Распоряжение,
		|					Таблица.ВидРабот,
		|					Таблица.Исполнитель,
		|					Таблица.Подразделение,
		|					Таблица.КодСтрокиРаспоряжения
		|				ИЗ
		|					ДвиженияТрудозатратыКОформлениюИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|ГДЕ
		|	(ТаблицаОстатков.КоличествоОстаток < 0);
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	// Контроль отрицательных остатков БракВПроизводстве
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияБракВПроизводствеИзменение") Тогда
		МассивКонтролей.Добавить(Врег("БракВПроизводстве"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.МаршрутныйЛист                  КАК МаршрутныйЛист,
		|	ТаблицаОстатков.КоличествоОстаток               КАК Количество
		|ИЗ
		|	РегистрНакопления.БракВПроизводстве.Остатки(,
		|			МаршрутныйЛист В
		|				(ВЫБРАТЬ
		|					Таблица.МаршрутныйЛист
		|				ИЗ
		|					ДвиженияБракВПроизводствеИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|ГДЕ
		|	(ТаблицаОстатков.КоличествоОстаток < 0);
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	//-- НЕ УТКА
	//-- НЕ УТ
	
	// Контроль отрицательных остатков ПринятаяВозвратнаяТара.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияПринятаяВозвратнаяТараИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ПринятаяВозвратнаяТара"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.Партнер                        КАК Партнер,
		|	ТаблицаОстатков.Номенклатура                   КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                 КАК Характеристика,
		|	ТаблицаОстатков.ДокументПоступления            КАК ДокументПоступления,
		|	ТаблицаОстатков.ПредусмотренЗалог              КАК ПредусмотренЗалог,
		|	ТаблицаОстатков.КоличествоОстаток              КАК Количество,
		|	ТаблицаОстатков.СуммаОстаток                   КАК Сумма
		|ИЗ
		|	РегистрНакопления.ПринятаяВозвратнаяТара.Остатки(,
		|			(Партнер, Номенклатура, Характеристика, ДокументПоступления, ПредусмотренЗалог) В
		|				(ВЫБРАТЬ
		|					Таблица.Партнер,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.ДокументПоступления,
		|					Таблица.ПредусмотренЗалог
		|				ИЗ
		|					ДвиженияПринятаяВозвратнаяТараИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	ТаблицаОстатков.КоличествоОстаток < 0;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	// Контроль отрицательных остатков ПереданнаяВозвратнаяТара.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияПереданнаяВозвратнаяТараИзменение") Тогда

		МассивКонтролей.Добавить(Врег("ПереданнаяВозвратнаяТара"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.Партнер                        КАК Партнер,
		|	ТаблицаОстатков.Номенклатура                   КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика                 КАК Характеристика,
		|	ТаблицаОстатков.ДокументПередачи               КАК ДокументПередачи,
		|	ТаблицаОстатков.ПредусмотренЗалог              КАК ПредусмотренЗалог,
		|	ТаблицаОстатков.ВидЗапасов                     КАК ВидЗапасов,
		|	ТаблицаОстатков.НомерГТД                       КАК НомерГТД,
		|	ТаблицаОстатков.КоличествоОстаток              КАК Количество,
		|	ТаблицаОстатков.СуммаОстаток                   КАК Сумма
		|ИЗ
		|	РегистрНакопления.ПереданнаяВозвратнаяТара.Остатки(,
		|			(Партнер, Номенклатура, Характеристика, ДокументПередачи, ВидЗапасов, НомерГТД, ПредусмотренЗалог) В
		|				(ВЫБРАТЬ
		|					Таблица.Партнер,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.ДокументПередачи,
		|					Таблица.ВидЗапасов,
		|					Таблица.НомерГТД,
		|					Таблица.ПредусмотренЗалог
		|				ИЗ
		|					ДвиженияПереданнаяВозвратнаяТараИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	ТаблицаОстатков.КоличествоОстаток < 0;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	// Контроль отрицательных остатков ПрочиеРасходы.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц, "ДвиженияПрочиеРасходыИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("ПрочиеРасходы"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.Организация,
		|	ТаблицаОстатков.Подразделение,
		|	ТаблицаОстатков.СтатьяРасходов,
		|	ТаблицаОстатков.АналитикаРасходов,
		|	ТаблицаОстатков.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ПрочиеРасходы.Остатки(,
		|			(Организация, Подразделение, СтатьяРасходов, АналитикаРасходов) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.Подразделение,
		|					Таблица.СтатьяРасходов,
		|					Таблица.АналитикаРасходов
		|				ИЗ
		|					ДвиженияПрочиеРасходыИзменение КАК Таблица)
		|	) КАК ТаблицаОстатков
		|
		|ГДЕ
		|	ТаблицаОстатков.СуммаОстаток < 0;
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	//++ НЕ УТ
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц, "ДвиженияЗаказыМатериаловСУчетомКорректировокИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("ЗаказыМатериаловСУчетомКорректировок"));
		ТекстЗапроса = ТекстЗапроса + 
		"
		|ВЫБРАТЬ
		|	ТаблицаОбороты.Организация                КАК Организация,
		|	ТаблицаОбороты.Подразделение              КАК Подразделение,
		|	ТаблицаОбороты.Распоряжение               КАК Распоряжение,
		|	ТаблицаОбороты.КодСтрокиРаспоряжения      КАК КодСтрокиРаспоряжения,
		|	ТаблицаОбороты.ВариантОбеспечения         КАК ВариантОбеспечения,
		|	ТаблицаОбороты.ДатаПотребности            КАК ДатаПотребности,
		|	ТаблицаОбороты.КодСтроки                  КАК КодСтроки,
		|	ТаблицаОбороты.Отменено                   КАК Отменено,
		|	ТаблицаОбороты.ПроизводствоНаСтороне      КАК ПроизводствоНаСтороне,
		|	ТаблицаОбороты.Серия                      КАК Серия,
		|	ТаблицаОбороты.Склад                      КАК Склад,
		|	ВЫБОР
		|		КОГДА ТаблицаОбороты.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ТаблицаОбороты.Упаковка.Представление                 
		|		ИНАЧЕ ТаблицаОбороты.Номенклатура.ЕдиницаИзмерения.Представление
		|	КОНЕЦ КАК УпаковкаПредставление,
		|	ТаблицаОбороты.Номенклатура.Представление    КАК НоменклатураПредставление,
		|	ТаблицаОбороты.Характеристика.Представление  КАК ХарактеристикаПредставление,
		|	ТаблицаОбороты.КоличествоУпаковокОборот   КАК КоличествоУпаковок
		|ИЗ
		|	РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Обороты(,,, 
		|				(Организация,Подразделение,Распоряжение,КодСтрокиРаспоряжения) В 
		|					(ВЫБРАТЬ
		|						Таблица.Организация,
		|						Таблица.Подразделение,
		|						Таблица.Распоряжение,
		|						Таблица.КодСтрокиРаспоряжения
		|					ИЗ
		|						ЗаказыМатериаловСУчетомКорректировокИзменение КАК Таблица)
		|				)КАК ТаблицаОбороты
		|
		|ГДЕ
		|	ТаблицаОбороты.КоличествоУпаковокОборот < 0;
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	//-- НЕ УТ
	
	//++ НЕ УТКА
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц, "ДвиженияЭтапыПроизводстваИзменение") Тогда
		
		МассивКонтролей.Добавить(Врег("ВременнаяТаблицаЭтапыПроизводства"));
		МассивКонтролей.Добавить(Врег("ЭтапыПроизводства"));
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	ТаблицаОбороты.Распоряжение                         КАК Распоряжение,
		|	ТаблицаОбороты.КодСтрокиПродукция                   КАК КодСтрокиПродукция,
		|	ТаблицаОбороты.КодСтрокиЭтапыГрафик                 КАК КодСтрокиЭтапыГрафик,
		|
		|	ТаблицаОбороты.ЗапланированоЗаказомОборот           КАК ЗапланированоЗаказом,
		|	ТаблицаОбороты.ЗапланированоПроизводствомОборот
		|		+ ТаблицаОбороты.КВыполнениюОборот
		|		+ ТаблицаОбороты.ВыполненоОборот
		|		+ ТаблицаОбороты.БракОборот                     КАК ЗапланированоПроизводством
		|
		|ПОМЕСТИТЬ ВременнаяТаблицаЭтапыПроизводства
		|
		|ИЗ
		|	РегистрНакопления.ЭтапыПроизводства.Обороты(,,, 
		|				(Распоряжение, КодСтрокиПродукция, КодСтрокиЭтапыГрафик) В 
		|					(ВЫБРАТЬ
		|						Т.Распоряжение,
		|						Т.КодСтрокиПродукция,
		|						Т.КодСтрокиЭтапыГрафик
		|					ИЗ
		|						ДвиженияЭтапыПроизводстваИзменение КАК Т)
		|				)КАК ТаблицаОбороты
		|
		|ГДЕ
		|	ТаблицаОбороты.ЗапланированоЗаказомОборот < ТаблицаОбороты.ЗапланированоПроизводствомОборот 
		|													+ ТаблицаОбороты.КВыполнениюОборот 
		|													+ ТаблицаОбороты.ВыполненоОборот 
		|													+ ТаблицаОбороты.БракОборот
		|	ИНДЕКСИРОВАТЬ ПО
		|		Распоряжение,
		|		КодСтрокиПродукция
		|;
		|///////////////////////////////////////////////////////////////////
		|
		|	ВЫБРАТЬ
		|		ТЭтапыПроизводства.Распоряжение               КАК Распоряжение,
		|		ТЭтапыПроизводства.КодСтрокиПродукция         КАК КодСтрокиПродукция,
		|		ТПродукция.НомерСтроки                        КАК НомерСтроки,
		|		ТПродукция.Номенклатура.Представление         КАК НоменклатураПредставление,
		|		ТПродукция.Характеристика.Представление       КАК ХарактеристикаПредставление,
		|		ТЭтапыПроизводства.КодСтрокиЭтапыГрафик       КАК КодСтрокиЭтапыГрафик,
		|		ТЭтапыПроизводства.ЗапланированоЗаказом       КАК ЗапланированоЗаказом,
		|		ТЭтапыПроизводства.ЗапланированоПроизводством КАК ЗапланированоПроизводством
		|ИЗ
		|	ВременнаяТаблицаЭтапыПроизводства КАК ТЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Продукция КАК ТПродукция
		|		ПО ТЭтапыПроизводства.Распоряжение = ТПродукция.Ссылка
		|			И ТЭтапыПроизводства.КодСтрокиПродукция = ТПродукция.КодСтроки
		|		
		|;
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	//-- НЕ УТКА
	
	// Контроль отрицательных остатков ТоварыКОформлениюЗаявленийОВвозе.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ТоварыКОформлениюЗаявленийОВвозеИзменение") Тогда
		МассивКонтролей.Добавить(Врег("ТоварыКОформлениюЗаявленийОВвозе"));
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	ТаблицаОстатков.ДокументПоступления           КАК ДокументПоступления,
		|	ТаблицаОстатков.Номенклатура                  КАК Номенклатура,
		|	ТаблицаОстатков.Характеристика                КАК Характеристика,
		|	ТаблицаОстатков.Серия                         КАК Серия,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Склад                         КАК Склад,
		|	ТаблицаОстатков.КОформлениюОстаток            КАК КОформлению
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюЗаявленийОВвозе.Остатки(
		|			,
		|			(ДокументПоступления, Номенклатура, Характеристика, Серия, Склад) В
		|				(ВЫБРАТЬ
		|					Таблица.ДокументПоступления,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Серия,
		|					Таблица.Склад
		|				ИЗ
		|					ТоварыКОформлениюЗаявленийОВвозеИзменение КАК Таблица)) КАК ТаблицаОстатков
		|ГДЕ
		|	ТаблицаОстатков.КОформлениюОстаток < 0
		|		
		|;
		|///////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	ЗапасыСервер.ДобавитьКонтрольПоТоварамОрганизаций(Объект, ПакетЗапросов, ТекстЗапроса, МассивКонтролей, ДанныеТаблиц);
	
	Если МассивКонтролей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПакетЗапросов.Текст = ТекстЗапроса;
	ПакетЗапросов.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	МассивРезультатов = ПакетЗапросов.ВыполнитьПакет();

//{{20201009 Глазунов
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		
		//МассивРезультатовЗаказ = ПакетЗапросов.ВыполнитьПакет();
		//Для Каждого РезультатЗаказ Из МассивРезультатовЗаказ Цикл
		Итератор = -1;
		СтрокУдалить = 0;
		Для Каждого РезультатЗаказ Из МассивРезультатов Цикл

			Итератор = Итератор + 1;
			Если РезультатЗаказ.Пустой() Тогда
				Продолжить;
			КонецЕсли;

			ИмяКонтроля = МассивКонтролей[Итератор];

			Если ИмяКонтроля = Врег("ТоварыКОтгрузке") Тогда
				ВыборкаЗаказ = РезультатЗаказ.Выбрать();
				ВсеСтрокиВозвращены = Ложь;
				Пока ВыборкаЗаказ.Следующий() Цикл
					Попытка 
						ВыборкаЗаказДокументОтгрузки = ВыборкаЗаказ.ДокументОтгрузки;
					Исключение
						Продолжить;
					КонецПопытки;
					ЗаказОтмененоКоличество = ВыборкаЗаказ.Количество;
		
					Запрос1 = Новый Запрос;
					Запрос1.Текст = 
						"ВЫБРАТЬ
						|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
						|ИЗ
						|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
						|ГДЕ
						|	РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента";
					
					Запрос1.УстановитьПараметр("ЗаказКлиента", ВыборкаЗаказДокументОтгрузки);
					
					РезультатЗапроса1 = Запрос1.Выполнить();
					
					ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						Запрос2 = Новый Запрос;
						Запрос2.Текст = 
							"ВЫБРАТЬ
							|	ВозвратТоваровОтКлиентаТовары.Ссылка КАК Ссылка,
							|	ВозвратТоваровОтКлиентаТовары.Номенклатура КАК Номенклатура,
							|	ВозвратТоваровОтКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок
							|ИЗ
							|	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
							|ГДЕ
							|	ВозвратТоваровОтКлиентаТовары.Номенклатура = &СтрокаНоменклатура
							|	И ВозвратТоваровОтКлиентаТовары.Ссылка.Партнер = &Партнер
							|	И ВозвратТоваровОтКлиентаТовары.Ссылка.ДокументРеализации = &ДокументРеализации";
						
						Запрос2.УстановитьПараметр("ДокументРеализации", ВыборкаДетальныеЗаписи1.Ссылка);
						Запрос2.УстановитьПараметр("СтрокаНоменклатура", ВыборкаЗаказ.Номенклатура);
						Запрос2.УстановитьПараметр("Партнер", ВыборкаЗаказ.Получатель);
						
						РезультатЗапроса2 = Запрос2.Выполнить();
						ВыборкаДетальныеЗаписи2 = РезультатЗапроса2.Выбрать();
						Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							ЗаказОтмененоКоличество = ЗаказОтмененоКоличество + ВыборкаДетальныеЗаписи2.КоличествоУпаковок;
						КонецЦикла;

						Если ЗаказОтмененоКоличество = 0 Тогда
							ВсеСтрокиВозвращены = Истина;	
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				Если ВсеСтрокиВозвращены Тогда
					МассивРезультатов.Удалить(Итератор);
					МассивКонтролей.Удалить(Итератор);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//МассивРезультатов = МассивРезультатовЗаказ;
	КонецЕсли;	
//}}20201009 Глазунов
//{{20210120 Глазунов Обход проверки на Обеспечение заказа Продукцией Типа "БРАК"
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда
		Итератор = -1;
		СтрокУдалить = 0;
		Для Каждого РезультатЗаказ Из МассивРезультатов Цикл

			Итератор = Итератор + 1;
			Если РезультатЗаказ.Пустой() Тогда
				Продолжить;
			КонецЕсли;

			ИмяКонтроля = МассивКонтролей[Итератор];

			Если ИмяКонтроля = Врег("ОБЕСПЕЧЕНИЕЗАКАЗОВ") Тогда
				ВыборкаЗаказ = РезультатЗаказ.Выбрать();
				ВсеСтрокиВозвращены = Ложь;
				СтрокЗаказа = 0;
				Пока ВыборкаЗаказ.Следующий() Цикл
					Если ВыборкаЗаказ.Назначение = Справочники.Назначения.Брак
							Или ВыборкаЗаказ.Назначение = Справочники.Назначения.ЗаменаБрака
					    	Или ВыборкаЗаказ.Назначение = Справочники.Назначения.Излишки Тогда
						СтрокЗаказа = СтрокЗаказа + 1;
					КонецЕсли;
				КонецЦикла;
				Если ВыборкаЗаказ.Количество() = СтрокЗаказа Тогда
					ВсеСтрокиВозвращены = Истина;
				КонецЕсли;
				Если ВсеСтрокиВозвращены Тогда
					МассивРезультатов.Удалить(Итератор);
					МассивКонтролей.Удалить(Итератор);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
//}}20210120 Глазунов

	Итератор = -1;
	Для Каждого Результат Из МассивРезультатов Цикл

		Итератор = Итератор + 1;
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;

		ИмяКонтроля = МассивКонтролей[Итератор];

		Если ИмяКонтроля = Врег("ТоварыКОтгрузке") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструТоварыКОтгрузке(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ОбеспечениеВременнаяТаблица1") Тогда

		ИначеЕсли ИмяКонтроля = Врег("ОбеспечениеВременнаяТаблица2") Тогда

		ИначеЕсли ИмяКонтроля = Врег("Обеспечение") Тогда

			СообщитьОбОшибкахПроведенияПоРегистрамСвободныеОстаткиИДвижениеТоваров(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ДенежныеСредстваКВыплате") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредстваКВыплате(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("РасчетыСКлиентами") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструРасчетыСКлиентами(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ВременнаяТаблицаДанныеДоговоровИзменениеСуммыДолга") Тогда

			// Временная таблица

		ИначеЕсли ИмяКонтроля = Врег("ВременнаяТаблицаДанныеДоговоровИзменениеКонтрольСрока") Тогда

			// Временная таблица

		ИначеЕсли ИмяКонтроля = Врег("ВременнаяТаблицаДанныеДоговоровПредварительные") Тогда

			// Временная таблица

		ИначеЕсли ИмяКонтроля = Врег("ВременнаяТаблицаДанныеДоговоров") Тогда

			// Временная таблица

		ИначеЕсли ИмяКонтроля = Врег("ВременнаяТаблицаОбъектыРасчетов") Тогда

			// Временная таблица

		ИначеЕсли ИмяКонтроля = Врег("ОграничениеСуммыЗадолженности") Тогда

			СообщитьОбОшибкахПроведенияПриОграниченииСуммыЗадолженности(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("КонтрольЗачтенныхАвансовПоНакладнымКлиент") Тогда

			СообщитьОбОшибкахПроведенияЗачетаАвансовПоНакладным(Объект, Отказ, Результат);
		
		ИначеЕсли ИмяКонтроля = Врег("КонтрольЗачтенныхАвансовПоНакладнымПоставщик") Тогда

			СообщитьОбОшибкахПроведенияЗачетаАвансовПоНакладным(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("КонтрольСрокаЗадолженности") Тогда

			СообщитьОбОшибкахПроведенияПриКонтролеСрокаЗадолженности(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ОшибкиЕстьВводОстатковПослеКлиенты") Тогда

			СообщитьОбОшибкахПроведенияВводОстатковПослеКлиенты(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ОшибкиЕстьДвиженияДоКлиенты") Тогда

			СообщитьОбОшибкахПроведенияЕстьДвиженияДоКлиенты(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ОшибкиЕстьВводОстатковПослеПоставщики") Тогда

			СообщитьОбОшибкахПроведенияВводОстатковПослеПоставщики(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ОшибкиЕстьДвиженияДоПоставщики") Тогда

			СообщитьОбОшибкахПроведенияЕстьДвиженияДоПоставщики(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ЗаказыНаПеремещение") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструЗаказыНаПеремещение(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ЗаказыНаВнутреннееПотребление") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструЗаказыНаВнутреннееПотребление(Объект, Отказ, Результат);
			
		//++ НЕ УТКА
		ИначеЕсли ИмяКонтроля = Врег("РаспоряженияНаВыпускПродукции") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструРаспоряженияНаВыпускПродукции(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ДвиженияРаспоряженияНаПередачуИзПроизводстваИзменениеМерныеТовары")
			ИЛИ ИмяКонтроля = Врег("ВТДопустимыеОтклоненияРаспоряженияНаПередачуИзПроизводства")
			ИЛИ ИмяКонтроля = Врег("ВТ_РаспоряженияНаПередачуИзПроизводстваОперативныйКонтроль")
			ИЛИ ИмяКонтроля = Врег("ВТ_РаспоряженияНаПередачуИзПроизводстваКонтрольНаДату")
			ИЛИ ИмяКонтроля = Врег("ВТ_РаспоряженияНаПередачуИзПроизводстваКонтрольНаДатуОстаток")
			ИЛИ ИмяКонтроля = Врег("ВТ_РаспоряженияНаПередачуИзПроизводства") Тогда
			
			// временная таблица
			
		ИначеЕсли ИмяКонтроля = Врег("РаспоряженияНаПередачуИзПроизводства") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструРаспоряженияНаПередачуИзПроизводства(Объект, Отказ, Результат);
		
		//-- НЕ УТКА
		//++ НЕ УТ
		ИначеЕсли ИмяКонтроля = Врег("ЗаказыМатериаловВПроизводство") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструЗаказыМатериаловВПроизводство(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ДенежныеДокументы") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструДенежныеДокументы(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("РаспоряженияНаСписаниеПоНормативам_ОперативныйКонтроль") Или
			ИмяКонтроля = Врег("РаспоряженияНаСписаниеПоНормативам_КонтрольНаДату") Тогда
			
			// временная таблица
			
		ИначеЕсли ИмяКонтроля = Врег("РаспоряженияНаСписаниеПоНормативам") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструРаспоряженияНаСписаниеПоНормативам(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ТоварыПереданныеПереработчику") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструТоварыПереданныеПереработчику(Объект, Отказ, Результат);
			
		//-- НЕ УТ
		//++ НЕ УТКА
		ИначеЕсли ИмяКонтроля = Врег("ЗаказыНаПроизводствоСпецификации") Тогда
		
			СообщитьОбОшибкахПроведенияПриОформленииЗаказаНаПроизводство(Объект, Отказ, Результат);
		
		ИначеЕсли ИмяКонтроля = Врег("УслугиДавальцуКОформлению") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструУслугиДавальцуКОформлению(Объект, Отказ, Результат);
			
		//-- НЕ УТКА
		ИначеЕсли ИмяКонтроля = Врег("ЗаказыКлиентов")
			  Или ИмяКонтроля = Врег("ЗаказыПоставщикам") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструЗаказыКлиентовПоставщикам(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ДвиженияЗаказыКлиентовИзменениеМерныеТовары")
			ИЛИ ИмяКонтроля = Врег("ВТДопустимыеОтклоненияЗаказыКлиентов")
			ИЛИ ИмяКонтроля = Врег("ВТЗаказыКлиентовОстатки") Тогда
			
			// временная таблица
			
		ИначеЕсли ИмяКонтроля = Врег("ВТ_ОстатокКОформлениюПоЗаявкам")
			Или ИмяКонтроля = Врег("ВТ_ОтборАналитикУчетаНоменклатуры")
			Или ИмяКонтроля = Врег("ВТ_ОстатокПоТоварамОрганизаций") Тогда

			// временная таблица
		
		ИначеЕсли ИмяКонтроля = Врег("ЗаявкиНаВозвратТоваровОтКлиентов") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструЗаявкиНаВозвратТоваровОтКлиентов(Объект, Отказ, Результат);
		ИначеЕсли ИмяКонтроля = Врег("ВозвратТоваровОтХранителей") Тогда

			СообщитьОбОшибкахПроведенияПриВозвратеТоваровОтХранителей(Объект, Отказ, Результат);
		ИначеЕсли ИмяКонтроля = Врег("ЗаказыНаСборку") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструЗаказыНаСборку(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ВТМногооборотнаяТара") Тогда
			
			// временная таблица
			
		ИначеЕсли ИмяКонтроля = Врег("ВТЯчейкиКонтролироватьОбособление") Тогда
			
			// временная таблица

		ИначеЕсли ИмяКонтроля = Врег("ТоварыВЯчейках") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструТоварыВЯчейках(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("НесколькоНазначенийВОбособленныхЯчейках") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструТоварыВЯчейкахНесколькоНазначений(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ТоварыНаСкладах") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструТоварыНаСкладах(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ВременнаяТаблицаОстатковСТоварнымиМестами")
			Или ИмяКонтроля = Врег("ВременнаяТаблицаОборотовСТоварнымиМестами")
			Или ИмяКонтроля = Врег("ВременнаяТаблицаОстатков")
			Или ИмяКонтроля = Врег("ВременнаяТаблицаОборотов")
			Или ИмяКонтроля = Врег("ТоварныеМестаНоменклатуры") Тогда

			// временная таблица

		ИначеЕсли ИмяКонтроля = Врег("ТоварыКОтбору") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструТоварыКОтбору(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ТоварыКОформлениюДокументовИмпорта") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструТоварыКОформлениюДокументовИмпорта(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ДвиженияОбеспечениеЗаказовИзменениеМерныеТовары") 
			ИЛИ ИмяКонтроля = Врег("ВТДопустимыеОтклоненияОбеспечениеЗаказов") Тогда
			
			// временная таблица
			
		ИначеЕсли ИмяКонтроля = Врег("ОбеспечениеЗаказов") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструОбеспечениеЗаказов(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ДвиженияТоварыКОтгрузкеСводно") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструСерии(Объект, Отказ, Результат);
			
 		//++ НЕ УТКА
		ИначеЕсли ИмяКонтроля = Врег("БракВПроизводстве") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструБракВПроизводстве(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ВТ_РаспоряженияНаВыпускПродукцииОперативныйКонтроль")
			ИЛИ ИмяКонтроля = Врег("ВТ_РаспоряженияНаВыпускПродукцииКонтрольНаДату")
			ИЛИ ИмяКонтроля = Врег("ВТ_УслугиДавальцуКОформлениюОперативныйКонтроль")
			ИЛИ ИмяКонтроля = Врег("ВТ_УслугиДавальцуКОформлениюКонтрольНаДату") Тогда
			
			// Временная таблица
			
		//-- НЕ УТКА
		ИначеЕсли ИмяКонтроля = Врег("ПринятаяВозвратнаяТара") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструПринятаяВозвратнаяТара(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ПереданнаяВозвратнаяТара") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструПереданнаяВозвратнаяТара(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ОбеспечениеЗаказовРаботами") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструОбеспечениеЗаказовРаботами(Объект, Отказ, Результат);

		ИначеЕсли ИмяКонтроля = Врег("ОстаткиОрганизацийВТ") Тогда
			// Временная таблица
			
		ИначеЕсли ИмяКонтроля = Врег("ПрочиеРасходы") Тогда
			СообщитьОбОшибкахПроведенияПоРегиструПрочиеРасходы(Объект, Отказ, Результат);
			
		//++ НЕ УТ
		ИначеЕсли ИмяКонтроля = Врег("ТрудозатратыКОформлению") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструТрудозатратыКОформлению(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("ЗаказыМатериаловСУчетомКорректировок") Тогда
			СообщитьОбОшибкахПроведенияПоРегиструЗаказыМатериаловСУчетомКорректировок(Объект, Отказ, Результат);
		//-- НЕ УТ
		
		//++ НЕ УТКА
		ИначеЕсли ИмяКонтроля = Врег("ВременнаяТаблицаЭтапыПроизводства") Тогда
			
			// Временная таблица
		
		ИначеЕсли ИмяКонтроля = Врег("ЭтапыПроизводства") Тогда
			СообщитьОбОшибкахПроведенияПоРегиструЭтапыПроизводства(Объект, Отказ, Результат);
		//-- НЕ УТКА
		
		ИначеЕсли ИмяКонтроля = Врег("ТоварыКОформлениюЗаявленийОВвозе") Тогда
			СообщитьОбОшибкахПроведенияПоРегиструТоварыКОформлениюЗаявленийОВвозе(Объект, Отказ, Результат);
			
		ИначеЕсли ЗапасыСервер.ЭтоИмяКонтроляПоТоварамОрганизацийИРезервам(ИмяКонтроля) Тогда
			
			ЗапасыСервер.СообщитьОбОшибкахПроведенияПоТоварамОрганизацийИРезервам(ИмяКонтроля, Объект, Отказ, Результат);
			
		Иначе

			ВызватьИсключение НСтр("ru = 'Ошибка контроля проведения!';
									|en = 'Posting control error'");

		КонецЕсли;
	КонецЦикла;

	ПроведениеСерверЛокализация.ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ);
	
	Если Отказ Тогда

		Если Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ТекстСообщения = НСтр("ru = 'Проведение не выполнено %ПредставлениеОбъекта%';
									|en = 'Posting is not executed %ПредставлениеОбъекта%'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Отмена проведения не выполнена %ПредставлениеОбъекта%';
									|en = 'Posting was not canceled %ПредставлениеОбъекта%'");
		КонецЕсли;

		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеОбъекта%", Строка(Объект));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект);

	КонецЕсли;

КонецПроцедуры

