
#Область РаботаСWEB

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.HTTPСервер = "web.se-ecatalog.ru";	
	Объект.HTTPПорт = 80;
	Объект.АвторизационныйКлюч = "HYHlIz771aID8quFHxxq6gwNLlgcEsiZ";

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	НоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	
	Если ТипЗнч(Объект.Номенклатура) = Тип("СписокЗначений") Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));		
		
		Объект.Номенклатура.ТипЗначения = Новый ОписаниеТипов(МассивТипов);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиничныйЗапрос(Команда)
	
	ЕдиничныйЗапросНаСервере();
	
КонецПроцедуры
	
&НаСервере
Процедура ЕдиничныйЗапросНаСервере()
	
	ОбъектВЗначении = РеквизитФормыВЗначение("Объект");
	ОбъектВЗначении.ВыполнитьЕдиничныйЗапрос(КодСостояния, Ответ);
	
	ЗначениеВРеквизитФормы(ОбъектВЗначении, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповойЗапрос(Команда)
	
	ГрупповойЗапросНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ГрупповойЗапросНаСервере()
	
	ОбъектВЗначении = РеквизитФормыВЗначение("Объект");
	ОбъектВЗначении.ВыполнитьГрупповойЗапрос(КодСостояния, Ответ);
	
	ЗначениеВРеквизитФормы(ОбъектВЗначении, "Объект");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

&НаСервере
Процедура ИзФайловНаСервереКлассы(ПутьКФайлу)
	
	ОбъектВЗначении = РеквизитФормыВЗначение("Объект");
	ОбъектВЗначении.ПрочитатьФайлXMLЧерезDOM_Классы(ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Процедура ИзФайловНаСервереГруппы(ПутьКФайлу)
	
	ОбъектВЗначении = РеквизитФормыВЗначение("Объект");
	ОбъектВЗначении.ПрочитатьФайлXMLЧерезDOM_Группы(ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Функция  ПроверитьЗагруженныГруппы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Рин1_ГруппыКлассыETIM.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.Рин1_ГруппыКлассыETIM КАК Рин1_ГруппыКлассыETIM";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат(Ложь);	
	Иначе 
		Возврат(Истина);			
	КонецЕсли;	
	
КонецФункции// ПроверитьЗагруженыЛиГруппы()

&НаКлиенте
Процедура ИзФайловКлассы(Команда)	
	
	Если не ПроверитьЗагруженныГруппы() Тогда 
		Сообщить("Перед загрузкой классов надо загрузить группы. Загрузка отменена!");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
	Текст = "ru = ""Текст""; en = ""Text"""; 
	Фильтр = НСтр(Текст)+"(*.xml)|*.xml"; 
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Истина; 
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы для загрузки КЛАССОВ"; 
	Начало = ТекущаяДата();
	Если ДиалогОткрытияФайла.Выбрать() Тогда 
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы; 
		Для Каждого ИмяФайла Из МассивФайлов Цикл 
			ВыбФайл = Новый Файл(ИмяФайла); 
			Текст = "ru = ""; Размер = ""; en = ""; Size = """; 
			Сообщить(ИмяФайла+НСтр(Текст)+Окр(ВыбФайл.Размер()/1024,1)+" КБ.");
			ИзФайловНаСервереКлассы(ИмяФайла);
		КонецЦикла; 
	Иначе 
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!"""; 
		Предупреждение(НСтр(Текст)); 
		Возврат;
	КонецЕсли; 
	Окончание = ТекущаяДата();
	Сообщить("Окончание обработки: "+Окончание+" Обработано за: "+(Окончание-Начало)+" с.");	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзФайловГруппы(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
	Текст = "ru = ""Текст""; en = ""Text"""; 
	Фильтр = НСтр(Текст)+"(*.xml)|*.xml"; 
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Истина; 
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы для загрузки ГРУПП"; 
	Начало = ТекущаяДата();
	Если ДиалогОткрытияФайла.Выбрать() Тогда 
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы; 
		Для Каждого ИмяФайла Из МассивФайлов Цикл 
			ВыбФайл = Новый Файл(ИмяФайла); 
			Текст = "ru = ""; Размер = ""; en = ""; Size = """; 
			Сообщить(ИмяФайла+НСтр(Текст)+Окр(ВыбФайл.Размер()/1024,1)+" КБ.");
			ИзФайловНаСервереГруппы(ИмяФайла);
		КонецЦикла; 
	Иначе 
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!"""; 
		Предупреждение(НСтр(Текст));
		Возврат;
	КонецЕсли; 
	Окончание = ТекущаяДата();
	Сообщить("Окончание обработки: "+Окончание+" Обработано за: "+(Окончание-Начало)+" с.");	
	
КонецПроцедуры

#КонецОбласти
