//++Шерстюк Ю.Ю. 10.02.2021 пока убираем подписки на события до выяснения подробностей от пользователей
//////{{20210128 ГлазуновДВ
////#Область ПроверкаПодпискиНаСобытия_ПометкаУдаления_ОтменаПроведения

//////Проверка на Отмену Проведения
Процедура Рин1_ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
////	
////	Если Отказ Тогда
////		Возврат;
////	КонецЕсли;
////	
////	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("Рин1_РедактированиеРеализации") Тогда
////		ОбщегоНазначения.СообщитьПользователю("Запрещается отмена проведения документа! Обратитесь к пользователю с полными правами.");
////		Отказ = Истина;
////		Возврат;
////	КонецЕсли;
////	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Документ) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка.Проведен";    		
	Запрос.УстановитьПараметр("Документ", Источник.Ссылка);		
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Сообщить("На основании документа имеются проведенные документы!", СтатусСообщения.ОченьВажное);
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

//////Проверка на смену статуса "Не согласован" и Проверка на Пометку Удаления
Процедура Рин1_ПередЗаписью(Источник, Отказ) Экспорт
////	
////	Если Отказ Тогда
////		Возврат;
////	КонецЕсли;
////	
////	Если Источник.Ссылка.ПометкаУдаления = Ложь И Источник.ПометкаУдаления = Истина Тогда
////		Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("Рин1_РедактированиеРеализации") Тогда
////			ОбщегоНазначения.СообщитьПользователю("Запрещается пометка на удаление документа! Обратитесь к пользователю с полными правами.");
////			Отказ = Истина;
////			Возврат;
////		КонецЕсли;
////	КонецЕсли;
////	
//////В документе может и не быть реквизита "Статус"	
////	Попытка
////		Если (Источник.Ссылка.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Или Источник.Ссылка.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт) И Источник.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
////			Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("Рин1_РедактированиеРеализации") Тогда
////				Сообщить("Отсутствует право на изменение статуса. Обратитесь к пользователю с полными правами!");
////				Отказ = Истина;
////				Возврат;
////			КонецЕсли;
////		КонецЕсли;
////	Исключение
////	КонецПопытки;
////	
КонецПроцедуры

////#КонецОбласти
//////}}20210128 ГлазуновДВ

//++Шерстюк Ю.Ю. 17.02.2021 проверка док.Заявка на расходование ДС задача 5647 в статусе "Согласовано" обязательное заполнение РС получателя
Процедура Рин1_ОбработкаПроведения(Источник, Отказ) Экспорт
	Если Отказ или Не ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию или
		Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию или
	    Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств Тогда
		Возврат;
	КонецЕсли;
	
	
	
	Если Источник.Статус <> Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована или Источник.Статус <> Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена Тогда 
		Если Источник.ФормаОплатыБезналичная и (Не ЗначениеЗаполнено(Источник.БанковскийСчетКонтрагента) и Не ЗначениеЗаполнено(Источник.БанковскийСчетПолучатель)) Тогда 
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ, заполните, пожалуйста, расчетный счет получателя.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//--Шерстюк Ю.Ю.
