
&Вместо("КоммерческоеПредложениеКлиентуПриИзмененииНоменклатуры")
Процедура Рин1_КоммерческоеПредложениеКлиентуПриИзмененииНоменклатуры(Форма, ТекущаяСтрока, ТекущийЭлемент, ТребуетсяСерверныйВызов)
	Объект                  = Форма.Объект;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	НалогообложениеНДС = КоммерческиеПредложенияДокументыКлиентСерверУТ.НалогообложениеНДСПоНалогообложениюКоммерческихПредложений(Объект.Налогообложение);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",          ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу",       ТекущаяСтрока.ЕдиницаИзмерения);
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи",                        ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры",             Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",                          Новый Структура("НалогообложениеНДС, Дата",НалогообложениеНДС, Объект.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",                         СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС",                        СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму",                            "Количество");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки",         Новый Структура("Очищать, ИмяКоличества", Истина, "Количество"));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать, ИмяКоличества", Истина, "Количество"));		
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый",    СтруктураПереопределяемыеДействия(Форма));
	
	// + [Rineco], [Киселев А.] [04.08.2021] 
	// Задача: [№ 8311], [# Заполнение скидок перед расчетом(отложена до обновления)]
	ДоработкиСУчетомСкидки(Объект, СтруктураДействий, ТекущаяСтрока);
	// - [Rineco], [Киселев А.] [04.08.2021]
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(Форма);
КонецПроцедуры


&Вместо("КоммерческоеПредложениеКлиентуПриИзмененииКоличества")
Процедура Рин1_КоммерческоеПредложениеКлиентуПриИзмененииКоличества(Форма, ТекущаяСтрока, ТребуетсяСерверныйВызов)
	Объект                  = Форма.Объект;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
		

	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",                         СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС",                        СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму",                            "Количество");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки",         Новый Структура("Очищать, ИмяКоличества", Ложь,   "Количество"));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать, ИмяКоличества", Истина, "Количество"));
	
	// + [Rineco], [Киселев А.] [04.08.2021] 
	// Задача: [№ 8311], [# Заполнение скидок перед расчетом (отложена до обновления)]
	ДоработкиСУчетомСкидки(Объект, СтруктураДействий, ТекущаяСтрока);
	// - [Rineco], [Киселев А.] [04.08.2021]
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(Форма);
КонецПроцедуры

// + [Rineco], [Киселев А.] [04.08.2021] 
	// Задача: [№ 8311], [# Заполнение скидок перед расчетом(отложена до обновления)]
Процедура ДоработкиСУчетомСкидки(Объект, СтруктураДействий, ТекущаяСтрока,ИзменениеВидаЦены = Неопределено)
	
	//Перем ПрименныеСкидки;
	//
	//Если ИзменениеВидаЦены <> Неопределено Тогда 
	//	Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(ТекущаяСтрока.ПроцентАвтоматическойСкидки) Тогда
	//	ПрименныеСкидки = ГИГ_МодульВызовСервера.ПолучитьОбработатьСкидки(ТекущаяСтрока.Номенклатура,Объект);
	//	ПрименныеСкидки.Свойство("АвтоСкидка",ТекущаяСтрока.ПроцентАвтоматическойСкидки);
	//КонецЕсли;
	//СтруктураДействий.Вставить("ПересчитатьСуммуАвтоматическойСкидки","Количество");
	//СтруктураДействий.ПересчитатьСуммуСУчетомАвтоматическойСкидки.Очищать = Ложь;
		
КонецПроцедуры

&Вместо("КоммерческоеПредложениеКлиентуПриИзмененииЦены")
Процедура Рин1_КоммерческоеПредложениеКлиентуПриИзмененииЦены(Форма, ТекущаяСтрока, ТребуетсяСерверныйВызов)
	Объект                  = Форма.Объект;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи",                        ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",                         СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС",                        СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму",                            "Количество");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки",         Новый Структура("Очищать, ИмяКоличества", Ложь,   "Количество"));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать, ИмяКоличества", Истина, "Количество"));
	
	// + [Rineco], [Киселев А.] [04.08.2021] 
	// Задача: [№ 8311], [# Заполнение скидок перед расчетом(отложена до обновления)]
	ДоработкиСУчетомСкидки(Объект, СтруктураДействий, ТекущаяСтрока,Истина);
	// - [Rineco], [Киселев А.] [04.08.2021]
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(Форма);

КонецПроцедуры

&Вместо("КоммерческоеПредложениеКлиентуПриИзмененииВидаЦены")
Процедура Рин1_КоммерческоеПредложениеКлиентуПриИзмененииВидаЦены(Форма, ТекущаяСтрока, ТребуетсяСерверныйВызов)
	Объект                  = Форма.Объект;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи",                        ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",                         СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС",                        СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму",                            "Количество");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки",         Новый Структура("Очищать, ИмяКоличества", Ложь,   "Количество"));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать, ИмяКоличества", Истина, "Количество"));
	
	// + [Rineco], [Киселев А.] [04.08.2021] 
	// Задача: [№ 8311], [# Заполнение скидок перед расчетом(отложена до обновления)]
	ДоработкиСУчетомСкидки(Объект, СтруктураДействий, ТекущаяСтрока);
	// - [Rineco], [Киселев А.] [04.08.2021]

	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(Форма);
КонецПроцедуры

&Вместо("КоммерческоеПредложениеКлиентуПриИзмененииЕдиницыИзмерения")
Процедура Рин1_КоммерческоеПредложениеКлиентуПриИзмененииЕдиницыИзмерения(Форма, ТекущаяСтрока, ТребуетсяСерверныйВызов)
	Объект                  = Форма.Объект;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
		СтруктураЗаполненияЦены = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект);
		СтруктураЗаполненияЦены.Вставить("ИмяКолонкиУпаковка", "ЕдиницаИзмерения");
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);
	ИначеЕсли ТекущаяСтрока.Количество > 0 Тогда
		СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущаяСтрока.Количество);
		СтруктураДействий.Вставить("ПересчитыватьКоличествоЕдиницПриПересчетеЦеныЗаУпаковку");
	КонецЕсли;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",                         СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС",                        СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму",                            "Количество");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки",         Новый Структура("Очищать, ИмяКоличества", Ложь,   "Количество"));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать, ИмяКоличества", Истина, "Количество"));
	
	// + [Rineco], [Киселев А.] [04.08.2021] 
	// Задача: [№ 8311], [# Заполнение скидок перед расчетом(отложена до обновления)]
	ДоработкиСУчетомСкидки(Объект, СтруктураДействий, ТекущаяСтрока);
	// - [Rineco], [Киселев А.] [04.08.2021]
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(Форма);

КонецПроцедуры

&Вместо("КоммерческоеПредложениеКлиентуПриИзмененииСтавкаНДС")
Процедура Рин1_КоммерческоеПредложениеКлиентуПриИзмененииСтавкаНДС(Форма, ТекущаяСтрока, ТребуетсяСерверныйВызов)
	Объект                  = Форма.Объект;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",                         СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС",                        СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму",                            "Количество");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки",         Новый Структура("Очищать, ИмяКоличества", Ложь,   "Количество"));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать, ИмяКоличества", Истина, "Количество"));
	
	// + [Rineco], [Киселев А.] [04.08.2021] 
	// Задача: [№ 8311], [# Заполнение скидок перед расчетом(отложена до обновления)]
	ДоработкиСУчетомСкидки(Объект, СтруктураДействий, ТекущаяСтрока);
	// - [Rineco], [Киселев А.] [04.08.2021]

	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(Форма);
КонецПроцедуры
	// - [Rineco], [Киселев А.] [04.08.2021]

