
&После("ЗаполнитьТоварыПоТоварамКПоступлению")
Процедура Рин1_ЗаполнитьТоварыПоТоварамКПоступлению(ВидЗаполнения, ДатаПоступления)
	ТЧДляСортировки = ЭтотОбъект.Товары.Выгрузить();
	пЗапрос = Новый Запрос("ВЫБРАТЬ
	                       |	ТчТовары.Номенклатура КАК НоменклатураТаблицы,
	                       |	ТчТовары.Характеристика КАК Характеристика,
	                       |	ТчТовары.Назначение КАК Назначение,
	                       |	ТчТовары.Упаковка КАК Упаковка,
	                       |	ТчТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	                       |	ТчТовары.Количество КАК Количество,
	                       |	ТчТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	                       |	ТчТовары.ДокументОтгрузки КАК ДокументОтгрузки,
	                       |	ТчТовары.УпаковочныйЛист КАК УпаковочныйЛист,
	                       |	ТчТовары.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
	                       |	ТчТовары.Штрихкод КАК Штрихкод,
	                       |	ТчТовары.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
	                       |	ТчТовары.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
	                       |	ТчТовары.Комментарий КАК Комментарий,
	                       |	ТчТовары.Серия КАК Серия
	                       |ПОМЕСТИТЬ ТаблицаТовары
	                       |ИЗ
	                       |	&ТчТовары КАК ТчТовары
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ТаблицаТовары.НоменклатураТаблицы КАК Номенклатура,
	                       |	ТаблицаТовары.Характеристика КАК Характеристика,
	                       |	ТаблицаТовары.Назначение КАК Назначение,
	                       |	ТаблицаТовары.Упаковка КАК Упаковка,
	                       |	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	                       |	ТаблицаТовары.Количество КАК Количество,
	                       |	ТаблицаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	                       |	ТаблицаТовары.ДокументОтгрузки КАК ДокументОтгрузки,
	                       |	ТаблицаТовары.УпаковочныйЛист КАК УпаковочныйЛист,
	                       |	ТаблицаТовары.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
	                       |	ТаблицаТовары.Штрихкод КАК Штрихкод,
	                       |	ТаблицаТовары.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
	                       |	ТаблицаТовары.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
	                       |	ТаблицаТовары.Комментарий КАК Комментарий,
	                       |	ТаблицаТовары.Серия КАК Серия
	                       |ИЗ
	                       |	ТаблицаТовары КАК ТаблицаТовары
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                       |		ПО ТаблицаТовары.НоменклатураТаблицы = Номенклатура.Ссылка
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	УпаковочныйЛистРодитель,
	                       |	УпаковочныйЛист,
	                       |	Номенклатура.ВидНоменклатуры,
	                       |	Номенклатура.Производитель,
	                       |	Номенклатура.Артикул");
	пЗапрос.УстановитьПараметр("ТчТовары",ТЧДляСортировки);
	ЭтотОбъект.Товары.Загрузить(пЗапрос.Выполнить().Выгрузить());
КонецПроцедуры
