&НаСервере
Процедура гиг_ПрограммноеДобавлениеРеквизитов()
	
	//ИмяЭлементаПланируемаяДатаОкончанияНаФорме = "ПланируемаяДатаОкончания";
	//ИмяЭлементаТрудозатратыЗавершены = "ТрудозатратыЗавершены";
	//ИмяЭлементаРасходМатериаловЗавершен = "РасходМатериаловЗавершен";
	//
	//	
	//МассивТиповБулево = Новый Массив;
	//МассивТиповБулево.Добавить(Тип("Булево"));
	//ОписаниеТиповБулево = Новый ОписаниеТипов(МассивТиповБулево);
	//
	//МассивТиповДата = Новый Массив;
	//МассивТиповДата.Добавить(Тип("Дата"));
	//ОписаниеТиповДата = Новый ОписаниеТипов(МассивТиповДата);
	//
	//	
	//МассивРеквизитов = Новый Массив;
	//МассивУдаляемыхИменРеквизитов = Новый Массив;
	//
	//МассивРеквизитов.Добавить(Новый РеквизитФормы("ПланируемаяДатаОкончания", ОписаниеТиповДата, "", "Планируемая дата окончания"));
	//МассивРеквизитов.Добавить(Новый РеквизитФормы("ТрудозатратыЗавершены", ОписаниеТиповБулево, "", "Трудозатраты завершены"));
	//МассивРеквизитов.Добавить(Новый РеквизитФормы("РасходМатериаловЗавершен", ОписаниеТиповБулево, "", "Расход материалов завершен"));
	//	
	//Форма.ИзменитьРеквизиты(МассивРеквизитов, МассивУдаляемыхИменРеквизитов);
	
	//добавление реквизитов на форму
	ГруппаИзрасходованныеМатериалыДляДобавления = ЭтаФорма.Элементы.Найти("ГруппаИзрасходованныеМатериалы");
	
	Если ГруппаИзрасходованныеМатериалыДляДобавления = Неопределено Тогда
		Сообщить ("Не удалось сформировать реквизит формы ""Расход материалов завершен"". Не найдена группа формы");
	Иначе
		НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("РасходМатериаловЗавершен", Тип("ПолеФормы"), ГруппаИзрасходованныеМатериалыДляДобавления);
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементФормы.ПутьКДанным = "Объект.гиг_РасходМатериаловЗавершен";
		НовыйЭлементФормы.Заголовок = "Расход материалов завершен";
	КонецЕсли;
	
	ГруппаТрудозатратыЗавершеныДляДобавления = ЭтаФорма.Элементы.Найти("СтраницаТрудозатраты");
	
	Если ГруппаТрудозатратыЗавершеныДляДобавления = Неопределено Тогда
		Сообщить ("Не удалось сформировать реквизит формы ""Трудозатраты завершены"". Не найдена группа формы");
	Иначе
		НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("ТрудозатратыЗавершены", Тип("ПолеФормы"), ГруппаТрудозатратыЗавершеныДляДобавления);
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементФормы.ПутьКДанным = "Объект.гиг_ТрудозатратыЗавершены";
		НовыйЭлементФормы.Заголовок = "Трудозатраты завершены";
	КонецЕсли;
	
	ГруппаПланируемаяДатаОкончанияДляДобавления = ЭтаФорма.Элементы.Найти("Группа20");
	
	Если ГруппаПланируемаяДатаОкончанияДляДобавления = Неопределено Тогда
		Сообщить ("Не удалось сформировать реквизит формы ""Планируемая дата окончания"". Не найдена группа формы");
	Иначе
		НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("ПланируемаяДатаОкончания", Тип("ПолеФормы"), ГруппаПланируемаяДатаОкончанияДляДобавления);
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементФормы.ПутьКДанным = "Объект.гиг_ПланируемаяДатаОкончания";
		НовыйЭлементФормы.Заголовок = "Планируемая дата окончания";
	КонецЕсли;
	
	//изменим положение заголовка элемента "ПричинаЗадержкиВыполненияЭтапа"
	ПричинаЗадержкиВыполненияЭтапаЭлемент = ЭтаФорма.Элементы.Найти("ПричинаЗадержкиВыполненияЭтапа");
	Если НЕ ПричинаЗадержкиВыполненияЭтапаЭлемент = Неопределено Тогда
		ПричинаЗадержкиВыполненияЭтапаЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	КонецЕсли;
	
	// + [Rineco], [Киселев А.] [28.07.2021] 
// Задача: [№13393 ], [# ОбъединениеСтрок]

	
	КомандаОбъединить = Команды.Добавить("КомандаОбъединить");
	КомандаОбъединить.Действие = "СвернутьСтроки"; 
	КомандаОбъединить.Картинка = БиблиотекаКартинок.ОбъединитьСтроки;
	КомандаОбъединить.Подсказка = "Объединить строки номенклатуры";
	
	КнопкаСвернуть = Элементы.Вставить("СвернутьСтроки",Тип("КнопкаФормы"),Элементы.ОбеспечениеМатериаламиИРаботами.КоманднаяПанель,Элементы.ОбеспечениеМатериаламиИРаботамиГруппаЗаполнить);
	КнопкаСвернуть.ИмяКоманды = "КомандаОбъединить";
	// - [Rineco], [Киселев А.] [28.07.2021]
КонецПроцедуры

	// + [Rineco], [Киселев А.] [28.07.2021] 
// Задача: [№13393 ], [# ОбъединениеСтрок]


&НаКлиенте
Процедура СвернутьСтроки(Команда)
	
	МассивСворачиваемыхСтрок = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Элементы.ОбеспечениеМатериаламиИРаботами.ВыделенныеСтроки Цикл 
		МассивСворачиваемыхСтрок.Добавить(СтрокаТаблицы);
	КонецЦикла;
	
	СвернутьСтрокиСервер(МассивСворачиваемыхСтрок);
	ОбновитьИнтерфейс();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура  СвернутьСтрокиСервер(МассивСворачиваемыхСтрок)
	
	Если МассивСворачиваемыхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаБезСвертки = Объект.ОбеспечениеМатериаламиИРаботами.Выгрузить();
	ТаблицаДляСвертки = ТаблицаБезСвертки.СкопироватьКолонки();
	
	Для Каждого ЭлементМассива Из МассивСворачиваемыхСтрок Цикл 
		СтрокаДляСвертки = Объект.ОбеспечениеМатериаламиИРаботами.НайтиПоИдентификатору(ЭлементМассива);
		СтрокаДляСвертки.РИН_СвернутьСтроки = Истина;
		НоваяСтрокаДляСвертки = ТаблицаДляСвертки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДляСвертки,СтрокаДляСвертки);		
	КонецЦикла;
	
	ТаблицаБезСвертки = Объект.ОбеспечениеМатериаламиИРаботами.Выгрузить();
	Отбор = Новый Структура;
	Отбор.Вставить("РИН_СвернутьСтроки",Истина);
	СтрокиДляУдаления = ТаблицаБезСвертки.НайтиСтроки(Отбор);
	
	Для Каждого ЭлементСтрокиДляУдаления Из СтрокиДляУдаления Цикл 
		ТаблицаБезСвертки.Удалить(ЭлементСтрокиДляУдаления);
	КонецЦикла;

		
	ТаблицаДляМаксимальнойДаты  = ТаблицаДляСвертки.Скопировать();
	Альфа = Новый СравнениеЗначений;
	ТаблицаДляМаксимальнойДаты.Сортировать("ДатаОтгрузки Убыв", Альфа);
	МаксимальнаяДатаОтгрузки = ТаблицаДляМаксимальнойДаты[0].ДатаОтгрузки;
	
	ТаблицаДляСвертки.Свернуть("АналитикаУчетаНоменклатуры,Артикул,ВариантОбеспечения,ДатаОтгрузкиОбязательна,ЕстьАналогиМатериала,ИспользуетсяАвтовыбор,КлючСвязиСпецификация,КорАналитикаУчетаНоменклатуры,Назначение,НазначениеОбеспечения,Номенклатура,Норматив,НужноОкруглять,Период,ПрименениеМатериала,Производится,СведенияАвтовыбора,Серия,Склад,СкладОбязателен,СкрытьСтроку,Спецификация,СтатусУказанияСерий,СтатусУказанияСерийОтправитель,СтатусУказанияСерийПолучатель,СтатьяКалькуляции,ТипНоменклатуры,Упаковка,Характеристика,ХарактеристикиИспользуются,ЦеховаяКладовая","Количество,КоличествоУпаковок");
	ТаблицаДляСвертки.Колонки.Добавить("ДатаОтгрузки",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДляСвертки.ЗаполнитьЗначения(МаксимальнаяДатаОтгрузки,"ДатаОтгрузки");
	Объект.ОбеспечениеМатериаламиИРаботами.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДляСвертки,Объект.ОбеспечениеМатериаламиИРаботами);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаБезСвертки,Объект.ОбеспечениеМатериаламиИРаботами);
КонецПроцедуры
// - [Rineco], [Киселев А.] [28.07.2021]


&НаСервере
Процедура Рин1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	гиг_ПрограммноеДобавлениеРеквизитов();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТаблицаСводныхОтчетов = Объект.Трудозатраты.Выгрузить(, "ГИГ_СводныйОтчетПоЕжедневнымВыработкам");
		ТаблицаСводныхОтчетов.Свернуть("ГИГ_СводныйОтчетПоЕжедневнымВыработкам");
		Для Каждого ТекСтрока Из ТаблицаСводныхОтчетов Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ГИГ_СводныйОтчетПоЕжедневнымВыработкам) Тогда
				// если этап производства изменяется документом "Сводный отчет по ежедневным выработкам", 
				// то вручную менять ТЧ "Трудозатраты" нельзя
				Элементы.СтраницаТрудозатраты.ТолькоПросмотр = Истина;
				Элементы.Трудозатраты_СкопироватьСтроки.Доступность = Ложь;
				Элементы.Трудозатраты_ВставитьСтроки.Доступность = Ложь;
				Элементы.Трудозатраты_РазбитьСтроку.Доступность = Ложь;
				Элементы.ТрудозатратыГруппаЗаполнить.Доступность = Ложь;
				Элементы.КонтекстноеМенюТрудозатраты_СкопироватьСтроки.Доступность = Ложь;
				Элементы.КонтекстноеМенюТрудозатраты_ВставитьСтроки.Доступность = Ложь;
				Элементы.КонтекстноеМенюТрудозатраты_РазбитьСтроку.Доступность = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


#Область Задача17211
// + [Rineco], [Киселев А.Н.] [16.09.2021] 
// Задача: [№ 17211], [#Открываем форму для загрузки из EXCELL]
&НаКлиенте
Процедура Рин1_ЗагрузитьИзВнешнегоФайлаВместо(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяТЧ", "ОбеспечениеМатериаламиИРаботами");
	ОткрытьФорму(
		"Обработка.ГИГ_ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма",
	ПараметрыФормы,
	ЭтаФорма,
	УникальныйИдентификатор);
	
КонецПроцедуры

// + [Rineco], [Киселев А.Н.] [16.09.2021] 
// Задача: [№ 17211], [#Добавляем метод в обработку выбора]
&НаКлиенте
Процедура Рин1_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ГИГ_ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда
		
		ЗаполнитьТабличнуюЧастьТоварамиИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище,ВыбранноеЗначение.ИмяТЧ)	
		
	КонецЕсли;
	
КонецПроцедуры

// + [Rineco], [Киселев А.Н.] [16.09.2021] 
// Задача: [№ 17211], [#Процедура заполнения табличной части]
&НаСервере
Процедура ЗаполнитьТабличнуюЧастьТоварамиИзХранилища(АдресТоваровВХранилище,знач ИмяТЧ)
	
	Если ИмяТЧ = "ОбеспечениеМатериаламиИРа" Тогда
		ИмяТЧ = "ОбеспечениеМатериаламиИРаботами";
	КонецЕсли;
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		СтруктураДействий = Новый Структура;
		
		СтрокаТЧТовары = Объект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров,,"НомерСтроки");	
		
		ДобавитьВСтруктуруДействияПриИзмененииНоменклатуры(
				СтрокаТЧТовары, 
				ИмяТЧ, 
				ЭтаФорма,
				СтруктураДействий);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧТовары, СтруктураДействий, Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
