
&НаКлиенте
Процедура Рин1_ГруппаСтраницыПриСменеСтраницыВместо(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ТекущаяСтраница.Имя = "ГруппаДополнительныеРеквизиты"
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	Если ТекущаяСтраница.Имя = ПараметрыКонтактнойИнформации.ГруппаКонтактнаяИнформация.ГруппаДляРазмещения
		И Не ПараметрыКонтактнойИнформации.ГруппаКонтактнаяИнформация.ВыполненаОтложеннаяИнициализация Тогда
		
		КонтактнаяИнформацияПриСменеСтраницы();
		
		//bercut020720 Задача № 1521
		Для каждого ЭлементФормы Из Элементы Цикл
			
			Если не ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") Тогда
				Продолжить;
			КонецЕсли;
			
			Если не СтрНайти(ЭлементФормы.Имя,"ГруппаКонтактнаяИнформацияПоле") = 0 Тогда
				Если ЭлементФормы.Заголовок = "Адрес" Тогда
					Попытка
						ИмяЭлемента = СокрЛП(СтрЗаменить(ЭлементФормы.Имя,"Группа",""));
						ЭлементФормы.ПодчиненныеЭлементы[ИмяЭлемента].РедактированиеТекста = Ложь;
					Исключение					
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		//
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры
