
&Вместо("ЭтоФормаПодбораВДокументыПродажи")
Функция Рин1_ЭтоФормаПодбораВДокументыПродажи(Форма)
	
	Возврат (Форма.КодФормы = "Обработка_ПодборТоваровВДокументПродажи_Форма") или (Форма.КодФормы = "Обработка_ГИГ_ПодборТоваровВДокументПродажи_Форма");

КонецФункции

&Вместо("ЭтоФормаПодбора")
Функция Рин1_ЭтоФормаПодбора(Форма)
	
		КодФормы = Форма.КодФормы;
	
	Если КодФормы = "Обработка_ПодборТоваровВДокументПродажи_Форма"
		Или КодФормы = "Обработка_ПодборТоваровВДокументЗакупки_Форма" 
		Или КодФормы = "Обработка_ГИГ_ПодборТоваровВДокументПродажи_Форма" 
		Или КодФормы = "Обработка_ПодборПоТоварнымКатегориям_Форма" Тогда
	
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

//{{20201101 ГлазуновДВ Добавили для очистки "ОстаткиТоваровПроизводителя", при активации строки Номенклатура = Непределено
&После("ОчиститьТаблицуОстатков")
Процедура Рин1_ОчиститьТаблицуОстатков(Форма)
	// Вставить содержимое метода.
	Форма.ОстаткиТоваровПроизводителя.Очистить();
КонецПроцедуры
//}}20201101 ГлазуновДВ
