
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ТаблДок);
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТабДок)
	
	ТабДок.Очистить();
	
	ТаблицаДанных = ПолучитьВнешнийИсточникДанных();
	
	ОбъектОтчет = РеквизитФормыВЗначение("ОтчетПоОбеспечению"); 
	ОСКД = ОбъектОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = ОСКД.НастройкиПоУмолчанию;
			
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//настройки компоновщика
	КомпНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОСКД));
    КомпНастроек.ЗагрузитьНастройки(Настройки);
	
	//ЭлементНачалоПериода = КомпНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода")); 
	//Если НЕ ЭлементНачалоПериода = Неопределено Тогда
	//	ЭлементНачалоПериода.Значение = НачалоДня(Период.ДатаНачала);
	//	ЭлементНачалоПериода.Использование = Истина;
	//КонецЕсли;
	//
	//ЭлементКонецПериода = КомпНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	//Если НЕ ЭлементКонецПериода = Неопределено Тогда
	//	ЭлементКонецПериода.Значение = КонецДня(Период.ДатаОкончания);
	//	ЭлементКонецПериода.Использование = Истина;
	//КонецЕсли;
	//
	//ЭлементДистрибьютор = КомпНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Дистрибьютер")); 
	//Если НЕ ЭлементДистрибьютор = Неопределено Тогда
	//	ЭлементДистрибьютор.Значение = Дистрибьютор;
	//	ЭлементДистрибьютор.Использование = Истина;
	//КонецЕсли;
	
	Настройки = КомпНастроек.ПолучитьНастройки();
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОСКД, Настройки, ДанныеРасшифровки);
	//настройки компоновщика
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ТаблицаДанных, ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
КонецПроцедуры

&НаСервере
Функция ПолучитьВнешнийИсточникДанных()
	
	
	ТаблицаЭтапов = РеквизитФормыВЗначение("ТаблицаМатериалов");
	ТаблицаЭтапов.Свернуть("Этап");
	
	ТаблицаМатериалов.Очистить();
	
	СкладыДляОпределенияСхем = Новый Массив;
	
	Для Каждого СтрокаЭтапа Из ТаблицаЭтапов Цикл
		
		Для Каждого СтрокаОбеспечения Из СтрокаЭтапа.ОбеспечениеМатериаламиИРаботами Цикл
		КонецЦикла;
		
	КонецЦикла;
	
	//СкладыДляОпределенияСхем = Новый Массив;
	//СкладыДляОпределенияСхем.Добавить(Объект.Склад);	
	//ТаблицаСхемОбеспечения = ГИГ_МодульСервер.ГИГ_ПолучитьТаблицуДоступныхСхемОбеспечения(СкладыДляОпределенияСхем);
	//
	//МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	//Запрос.Текст = 
	//
	//"ВЫБРАТЬ
	//|	Т.Номенклатура КАК Номенклатура,
	//|	Т.Характеристика КАК Характеристика,
	//|	Т.ВариантОбеспечения КАК ВариантОбеспечения,
	//|	Т.ГИГ_СхемаОбеспечения КАК СхемаОбеспечения,
	//|	Т.ДатаОтгрузки КАК ДатаОтгрузки,
	//|	Т.Количество КАК Количество
	//|ПОМЕСТИТЬ ВтЗаказКлиентаТовары
	//|ИЗ
	//|	&Товары КАК Т
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Т.Номенклатура КАК Номенклатура,
	//|	Т.Характеристика КАК Характеристика
	//|ПОМЕСТИТЬ ВтТовары
	//|ИЗ
	//|	ВтЗаказКлиентаТовары КАК Т
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Т.Характеристика,
	//|	Т.Номенклатура
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Т.Склад КАК Склад,
	//|	Т.ВариантОбеспечения КАК ВариантОбеспечения,
	//|	Т.ДатаОтгрузки КАК ДатаОтгрузки,
	//|	Т.Количество КАК Количество,
	//|	Т.Отгружено КАК Отгружено,
	//|	Т.Номенклатура КАК Номенклатура,
	//|	Т.Характеристика КАК Характеристика
	//|ПОМЕСТИТЬ ВтТаблицаОбеспечения
	//|ИЗ
	//|	&ТаблицаОбеспечения КАК Т
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаСхем.Склад КАК Склад,
	//|	ТаблицаСхем.СкладИсточник КАК СкладИсточник,
	//|	ВЫРАЗИТЬ(ТаблицаСхем.СхемаОбеспечения КАК Справочник.СхемыОбеспечения) КАК СхемаОбеспечения,
	//|	ТаблицаСхем.СрокОбеспеченияМин КАК СрокОбеспеченияМин,
	//|	ТаблицаСхем.СрокОбеспеченияМакс КАК СрокОбеспеченияМакс
	//|ПОМЕСТИТЬ ВтДоступныеСхемы
	//|ИЗ
	//|	&ТаблицаСхем КАК ТаблицаСхем
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Склады.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВтСкладыДляПеремещения
	//|ИЗ
	//|	Справочник.Склады КАК Склады
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДоступныеСхемы КАК ВтДоступныеСхемы
	//|		ПО Склады.Ссылка = ВтДоступныеСхемы.СкладИсточник
	//|			И (ВтДоступныеСхемы.Склад = &Склад)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Т.Склад КАК Склад,
	//|	Т.Номенклатура КАК Номенклатура,
	//|	Т.Характеристика КАК Характеристика,
	//|	Т.ВНаличииОстаток КАК ВНаличии,
	//|	Т.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
	//|	Т.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ
	//|ПОМЕСТИТЬ ВтСвободныеОстатки
	//|ИЗ
	//|	РегистрНакопления.СвободныеОстатки.Остатки(
	//|			,
	//|			Склад В
	//|					(ВЫБРАТЬ
	//|						ВтСкладыДляПеремещения.Ссылка
	//|					ИЗ
	//|						ВтСкладыДляПеремещения)
	//|				И (Номенклатура, Характеристика) В
	//|					(ВЫБРАТЬ
	//|						ВтТовары.Номенклатура КАК Номенклатура,
	//|						ВтТовары.Характеристика КАК Характеристика
	//|					ИЗ
	//|						ВтТовары КАК ВтТовары)) КАК Т
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Т.Склад КАК Склад,
	//|	СУММА(Т.Свободно) КАК Свободно,
	//|	&НачалоТекущегоДня КАК ДатаДоступности,
	//|	Т.Номенклатура КАК Номенклатура,
	//|	Т.Характеристика КАК Характеристика
	//|ПОМЕСТИТЬ ВтДоступныеДляПеремещения
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Т.Склад КАК Склад,
	//|		Т.ВНаличии - Т.ВРезервеСоСклада - Т.ВРезервеПодЗаказ КАК Свободно,
	//|		Т.Номенклатура КАК Номенклатура,
	//|		Т.Характеристика КАК Характеристика
	//|	ИЗ
	//|		ВтСвободныеОстатки КАК Т
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Т.Склад,
	//|		Т.Количество,
	//|		Т.Номенклатура,
	//|		Т.Характеристика
	//|	ИЗ
	//|		ВтТовары КАК ВТТовары
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	//|			ПО ВТТовары.Номенклатура = Т.Номенклатура
	//|				И ВТТовары.Характеристика = Т.Характеристика
	//|				И (Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1))
	//|				И (Т.Количество < 0)) КАК Т
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Т.Склад,
	//|	Т.Номенклатура,
	//|	Т.Характеристика
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Т.Склад,
	//|	Т.Количество + ЕСТЬNULL(ОстаткиСклада.ВНаличии - ОстаткиСклада.ВРезервеСоСклада - ОстаткиСклада.ВРезервеПодЗаказ, 0),
	//|	Т.ДатаДоступности,
	//|	Т.Номенклатура,
	//|	Т.Характеристика
	//|ИЗ
	//|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСвободныеОстатки КАК ОстаткиСклада
	//|		ПО Т.Склад = ОстаткиСклада.Склад
	//|			И Т.Характеристика = ОстаткиСклада.Характеристика
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТовары КАК ВтТовары
	//|		ПО Т.Номенклатура = ВтТовары.Номенклатура
	//|			И Т.Характеристика = ВтТовары.Характеристика,
	//|	ВтСкладыДляПеремещения КАК ВТСкладыДляПеремещения
	//|ГДЕ
	//|	Т.ДатаДоступности > ДАТАВРЕМЯ(1, 1, 1)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Набор.Номенклатура КАК Номенклатура,
	//|	СУММА(Набор.ВНаличии) КАК Доступно,
	//|	Набор.Склад КАК Склад,
	//|	Набор.СхемаОбеспечения КАК СхемаОбеспечения,
	//|	СУММА(Набор.СпособОбеспеченияПотребностейСрокИсполненияЗаказа) КАК СрокОбеспеченияМин,
	//|	СУММА(Набор.СпособОбеспеченияПотребностейГарантированныйСрокОтгрузки) КАК СрокОбеспеченияМакс,
	//|	Набор.ГИГ_Приоритет КАК ПриоритетСхемыОбеспечения,
	//|	Набор.ГИГ_ЗакупкаСПроизводства КАК ЗакупкаСПроизводства,
	//|	Набор.Характеристика КАК Характеристика,
	//|	Набор.ДатаДоступности КАК ДатаДоступности
	//|ПОМЕСТИТЬ ВтСхемы
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ГИГ_НоменклатураНаСкладеПоставщика.Номенклатура КАК Номенклатура,
	//|		ГИГ_НоменклатураНаСкладеПоставщика.Характеристика КАК Характеристика,
	//|		ГИГ_НоменклатураНаСкладеПоставщика.Количество КАК ВНаличии,
	//|		ВтДоступныеСхемы.Склад КАК Склад,
	//|		ВтДоступныеСхемы.СхемаОбеспечения КАК СхемаОбеспечения,
	//|		ВтДоступныеСхемы.СрокОбеспеченияМин КАК СпособОбеспеченияПотребностейСрокИсполненияЗаказа,
	//|		ВтДоступныеСхемы.СрокОбеспеченияМакс КАК СпособОбеспеченияПотребностейГарантированныйСрокОтгрузки,
	//|		&НачалоТекущегоДня КАК ДатаДоступности,
	//|		СхемыОбеспечения.ГИГ_Приоритет КАК ГИГ_Приоритет,
	//|		СхемыОбеспечения.ГИГ_ЗакупкаСПроизводства КАК ГИГ_ЗакупкаСПроизводства
	//|	ИЗ
	//|		ВтТовары КАК ВтТовары
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГИГ_НоменклатураНаСкладеПоставщика КАК ГИГ_НоменклатураНаСкладеПоставщика
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДоступныеСхемы КАК ВтДоступныеСхемы
	//|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СхемыОбеспечения КАК СхемыОбеспечения
	//|					ПО ВтДоступныеСхемы.СхемаОбеспечения = СхемыОбеспечения.Ссылка
	//|						И (НЕ СхемыОбеспечения.ГИГ_ЗакупкаСПроизводства)
	//|				ПО ГИГ_НоменклатураНаСкладеПоставщика.Склад = ВтДоступныеСхемы.СкладИсточник
	//|					И (ВтДоступныеСхемы.Склад = &Склад)
	//|			ПО ВтТовары.Номенклатура = ГИГ_НоменклатураНаСкладеПоставщика.Номенклатура
	//|				И ВтТовары.Характеристика = ГИГ_НоменклатураНаСкладеПоставщика.Характеристика
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Номенклатура,
	//|		ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Характеристика,
	//|		0,
	//|		ВтДоступныеСхемы.Склад,
	//|		ВтДоступныеСхемы.СхемаОбеспечения,
	//|		ВтДоступныеСхемы.СрокОбеспеченияМин + ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СрокПоставки,
	//|		ВтДоступныеСхемы.СрокОбеспеченияМакс + ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СрокПоставки,
	//|		&НачалоТекущегоДня,
	//|		СхемыОбеспечения.ГИГ_Приоритет,
	//|		СхемыОбеспечения.ГИГ_ЗакупкаСПроизводства
	//|	ИЗ
	//|		ВтТовары КАК ВтТовары
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства КАК ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДоступныеСхемы КАК ВтДоступныеСхемы
	//|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СхемыОбеспечения КАК СхемыОбеспечения
	//|					ПО ВтДоступныеСхемы.СхемаОбеспечения = СхемыОбеспечения.Ссылка
	//|						И (СхемыОбеспечения.ГИГ_ЗакупкаСПроизводства)
	//|				ПО ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СкладПоставщика = ВтДоступныеСхемы.СкладИсточник
	//|					И (ВтДоступныеСхемы.Склад = &Склад)
	//|			ПО ВтТовары.Номенклатура = ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Номенклатура
	//|				И ВтТовары.Характеристика = ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Характеристика
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВтДоступныеДляПеремещения.Номенклатура,
	//|		ВтДоступныеДляПеремещения.Характеристика,
	//|		ВтДоступныеДляПеремещения.Свободно,
	//|		ВтДоступныеСхемы.Склад,
	//|		ВтДоступныеСхемы.СхемаОбеспечения,
	//|		ВтДоступныеСхемы.СрокОбеспеченияМин,
	//|		ВтДоступныеСхемы.СрокОбеспеченияМакс,
	//|		ВтДоступныеДляПеремещения.ДатаДоступности,
	//|		СхемыОбеспечения.ГИГ_Приоритет,
	//|		СхемыОбеспечения.ГИГ_ЗакупкаСПроизводства
	//|	ИЗ
	//|		ВтДоступныеДляПеремещения КАК ВтДоступныеДляПеремещения
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДоступныеСхемы КАК ВтДоступныеСхемы
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СхемыОбеспечения КАК СхемыОбеспечения
	//|				ПО ВтДоступныеСхемы.СхемаОбеспечения = СхемыОбеспечения.Ссылка
	//|			ПО ВтДоступныеДляПеремещения.Склад = ВтДоступныеСхемы.СкладИсточник
	//|				И (ВтДоступныеСхемы.Склад = &Склад)) КАК Набор
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Набор.Номенклатура,
	//|	Набор.Склад,
	//|	Набор.СхемаОбеспечения,
	//|	Набор.Характеристика,
	//|	Набор.ДатаДоступности,
	//|	Набор.ГИГ_Приоритет,
	//|	Набор.ГИГ_ЗакупкаСПроизводства
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВтТаблицаОбеспечения.Склад КАК Склад,
	//|	ВтТаблицаОбеспечения.ВариантОбеспечения КАК ВариантОбеспечения,
	//|	ВтТаблицаОбеспечения.ДатаОтгрузки КАК ДатаОтгрузки,
	//|	СУММА(ВтТаблицаОбеспечения.Количество) КАК Количество,
	//|	ВтТаблицаОбеспечения.Отгружено КАК Отгружено,
	//|	ВтТаблицаОбеспечения.Номенклатура КАК Номенклатура,
	//|	ВтТаблицаОбеспечения.Характеристика КАК Характеристика
	//|ПОМЕСТИТЬ ВтСтрокиКРаспределению
	//|ИЗ
	//|	ВтТаблицаОбеспечения КАК ВтТаблицаОбеспечения
	//|ГДЕ
	//|	(ВтТаблицаОбеспечения.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется)
	//|			ИЛИ ВтТаблицаОбеспечения.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВтТаблицаОбеспечения.Отгружено,
	//|	ВтТаблицаОбеспечения.Номенклатура,
	//|	ВтТаблицаОбеспечения.Склад,
	//|	ВтТаблицаОбеспечения.ВариантОбеспечения,
	//|	ВтТаблицаОбеспечения.ДатаОтгрузки,
	//|	ВтТаблицаОбеспечения.Характеристика
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВложенныйЗапрос.Склад КАК Склад,
	//|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	//|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	//|	ВложенныйЗапрос.ВариантОбеспечения КАК ВариантОбеспечения,
	//|	ВложенныйЗапрос.СхемаОбеспечения КАК СхемаОбеспечения,
	//|	ВложенныйЗапрос.СрокОбеспеченияМин КАК СрокОбеспеченияМин,
	//|	ВложенныйЗапрос.СрокОбеспеченияМакс КАК СрокОбеспеченияМакс,
	//|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	//|	МАКСИМУМ(ВложенныйЗапрос.Отгружено) КАК Отгружено,
	//|	МАКСИМУМ(ВложенныйЗапрос.Доступно) КАК Доступно,
	//|	ВложенныйЗапрос.ДатаОбеспечения КАК ДатаОбеспечения,
	//|	МИНИМУМ(ВложенныйЗапрос.ДатаОтгрузки) КАК ДатаОтгрузки,
	//|	ВложенныйЗапрос.ЗакупкаСПроизводства КАК ЗакупкаСПроизводства,
	//|	ВЫБОР
	//|		КОГДА ВложенныйЗапрос.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//|			ТОГДА 0
	//|		КОГДА ВложенныйЗапрос.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ИзЗаказов)
	//|			ТОГДА 50
	//|		КОГДА ВложенныйЗапрос.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется)
	//|			ТОГДА 100
	//|		КОГДА ВложенныйЗапрос.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно)
	//|			ТОГДА 100
	//|		ИНАЧЕ 9999
	//|	КОНЕЦ КАК ПриоритетВариантаОбеспечения,
	//|	ВложенныйЗапрос.ПриоритетСхемыОбеспечения КАК ПриоритетСхемыОбеспечения,
	//|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура) КАК НоменклатураПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ВариантОбеспечения) КАК ВариантОбеспеченияПредставление
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ВтСтрокиКРаспределению.Склад КАК Склад,
	//|		ВтСтрокиКРаспределению.Номенклатура КАК Номенклатура,
	//|		ВтСтрокиКРаспределению.Характеристика КАК Характеристика,
	//|		ВтСтрокиКРаспределению.ВариантОбеспечения КАК ВариантОбеспечения,
	//|		ЕСТЬNULL(ВтСхемы.СхемаОбеспечения, ЗНАЧЕНИЕ(Справочник.СхемыОбеспечения.ПустаяСсылка)) КАК СхемаОбеспечения,
	//|		ЕСТЬNULL(ВтСхемы.СрокОбеспеченияМин, 0) КАК СрокОбеспеченияМин,
	//|		ЕСТЬNULL(ВтСхемы.СрокОбеспеченияМакс, 0) КАК СрокОбеспеченияМакс,
	//|		ВЫБОР
	//|			КОГДА ВтСхемы.ДатаДоступности ЕСТЬ NULL
	//|				ТОГДА &НачалоТекущегоДня
	//|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ВтСхемы.ДатаДоступности, ДЕНЬ, ВтСхемы.СрокОбеспеченияМакс)
	//|		КОНЕЦ КАК ДатаОбеспечения,
	//|		ВЫБОР
	//|			КОГДА ВтСхемы.ДатаДоступности ЕСТЬ NULL
	//|				ТОГДА &НачалоТекущегоДня
	//|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ВтСхемы.ДатаДоступности, ДЕНЬ, ВтСхемы.СрокОбеспеченияМакс)
	//|		КОНЕЦ КАК ДатаОтгрузки,
	//|		0 КАК Количество,
	//|		ВтСтрокиКРаспределению.Отгружено КАК Отгружено,
	//|		ЕСТЬNULL(ВтСхемы.Доступно, 0) КАК Доступно,
	//|		ЕСТЬNULL(ВтСхемы.ЗакупкаСПроизводства, ЛОЖЬ) КАК ЗакупкаСПроизводства,
	//|		ЕСТЬNULL(ВтСхемы.ПриоритетСхемыОбеспечения, 9999) КАК ПриоритетСхемыОбеспечения
	//|	ИЗ
	//|		ВтСтрокиКРаспределению КАК ВтСтрокиКРаспределению
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ВтСхемы КАК ВтСхемы
	//|			ПО ВтСтрокиКРаспределению.Склад = ВтСхемы.Склад
	//|				И ВтСтрокиКРаспределению.Номенклатура = ВтСхемы.Номенклатура
	//|				И ВтСтрокиКРаспределению.Характеристика = ВтСхемы.Характеристика
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВтТаблицаОбеспечения.Склад,
	//|		ВтТаблицаОбеспечения.Номенклатура,
	//|		ВтТаблицаОбеспечения.Характеристика,
	//|		ВтТаблицаОбеспечения.ВариантОбеспечения,
	//|		ЗНАЧЕНИЕ(Справочник.СхемыОбеспечения.ПустаяСсылка),
	//|		0,
	//|		0,
	//|		ВЫБОР
	//|			КОГДА ВтТаблицаОбеспечения.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//|				ТОГДА &НачалоТекущегоДня
	//|			ИНАЧЕ ВтТаблицаОбеспечения.ДатаОтгрузки
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА ВтТаблицаОбеспечения.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//|				ТОГДА &НачалоТекущегоДня
	//|			ИНАЧЕ ВтТаблицаОбеспечения.ДатаОтгрузки
	//|		КОНЕЦ,
	//|		0,
	//|		ВтТаблицаОбеспечения.Отгружено,
	//|		ВтТаблицаОбеспечения.Количество,
	//|		ЛОЖЬ,
	//|		ВЫБОР
	//|			КОГДА ВтТаблицаОбеспечения.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//|				ТОГДА -100
	//|			КОГДА ВтТаблицаОбеспечения.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ИзЗаказов)
	//|				ТОГДА -50
	//|			ИНАЧЕ 9999
	//|		КОНЕЦ
	//|	ИЗ
	//|		ВтТаблицаОбеспечения КАК ВтТаблицаОбеспечения
	//|	ГДЕ
	//|		ВтТаблицаОбеспечения.ВариантОбеспечения <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется)
	//|		И ВтТаблицаОбеспечения.ВариантОбеспечения <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		&Склад,
	//|		ВтЗаказКлиентаТовары.Номенклатура,
	//|		ВтЗаказКлиентаТовары.Характеристика,
	//|		ВтЗаказКлиентаТовары.ВариантОбеспечения,
	//|		ВтЗаказКлиентаТовары.СхемаОбеспечения,
	//|		ЕСТЬNULL(СхемыОбеспечения.СрокОбеспеченияМин, 0),
	//|		ЕСТЬNULL(СхемыОбеспечения.СрокОбеспеченияМакс, 0),
	//|		ВЫБОР
	//|			КОГДА ВтЗаказКлиентаТовары.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))
	//|				ТОГДА ВЫБОР
	//|						КОГДА СхемыОбеспечения.СрокОбеспеченияМакс ЕСТЬ NULL
	//|							ТОГДА &НачалоТекущегоДня
	//|						ИНАЧЕ ДОБАВИТЬКДАТЕ(&НачалоТекущегоДня, ДЕНЬ, СхемыОбеспечения.СрокОбеспеченияМакс)
	//|					КОНЕЦ
	//|			КОГДА ВтЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//|				ТОГДА &НачалоТекущегоДня
	//|			ИНАЧЕ ВтЗаказКлиентаТовары.ДатаОтгрузки
	//|		КОНЕЦ,
	//|		ВтЗаказКлиентаТовары.ДатаОтгрузки,
	//|		ВтЗаказКлиентаТовары.Количество,
	//|		0,
	//|		0,
	//|		ЕСТЬNULL(СхемыОбеспечения.СхемаОбеспечения.ГИГ_ЗакупкаСПроизводства, ЛОЖЬ),
	//|		ВЫБОР
	//|			КОГДА ВтЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//|				ТОГДА -100
	//|			КОГДА ВтЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ИзЗаказов)
	//|				ТОГДА -50
	//|			КОГДА ВтЗаказКлиентаТовары.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))
	//|				ТОГДА ЕСТЬNULL(СхемыОбеспечения.СхемаОбеспечения.ГИГ_Приоритет, 9999)
	//|			ИНАЧЕ 9999
	//|		КОНЕЦ
	//|	ИЗ
	//|		ВтЗаказКлиентаТовары КАК ВтЗаказКлиентаТовары
	//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|				ВтДоступныеСхемы.СхемаОбеспечения КАК СхемаОбеспечения,
	//|				ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Номенклатура КАК Номенклатура,
	//|				ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Характеристика КАК Характеристика,
	//|				МАКСИМУМ(ВтДоступныеСхемы.СрокОбеспеченияМин + ЕСТЬNULL(ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СрокПоставки, 0)) КАК СрокОбеспеченияМин,
	//|				МАКСИМУМ(ВтДоступныеСхемы.СрокОбеспеченияМакс + ЕСТЬNULL(ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СрокПоставки, 0)) КАК СрокОбеспеченияМакс
	//|			ИЗ
	//|				ВтДоступныеСхемы КАК ВтДоступныеСхемы
	//|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства КАК ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства
	//|					ПО ВтДоступныеСхемы.СкладИсточник = ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СкладПоставщика
	//|			ГДЕ
	//|				ВтДоступныеСхемы.СхемаОбеспечения.ГИГ_ЗакупкаСПроизводства
	//|			
	//|			СГРУППИРОВАТЬ ПО
	//|				ВтДоступныеСхемы.СхемаОбеспечения,
	//|				ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Номенклатура,
	//|				ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Характеристика
	//|			
	//|			ОБЪЕДИНИТЬ ВСЕ
	//|			
	//|			ВЫБРАТЬ
	//|				ВтДоступныеСхемы.СхемаОбеспечения,
	//|				ВтЗаказКлиентаТовары.Номенклатура,
	//|				ВтЗаказКлиентаТовары.Характеристика,
	//|				МАКСИМУМ(ВтДоступныеСхемы.СрокОбеспеченияМин),
	//|				МАКСИМУМ(ВтДоступныеСхемы.СрокОбеспеченияМакс)
	//|			ИЗ
	//|				ВтДоступныеСхемы КАК ВтДоступныеСхемы
	//|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЗаказКлиентаТовары КАК ВтЗаказКлиентаТовары
	//|					ПО ВтДоступныеСхемы.СхемаОбеспечения = ВтЗаказКлиентаТовары.СхемаОбеспечения
	//|			ГДЕ
	//|				НЕ ВтДоступныеСхемы.СхемаОбеспечения.ГИГ_ЗакупкаСПроизводства
	//|			
	//|			СГРУППИРОВАТЬ ПО
	//|				ВтДоступныеСхемы.СхемаОбеспечения,
	//|				ВтЗаказКлиентаТовары.Номенклатура,
	//|				ВтЗаказКлиентаТовары.Характеристика) КАК СхемыОбеспечения
	//|			ПО ВтЗаказКлиентаТовары.СхемаОбеспечения = СхемыОбеспечения.СхемаОбеспечения
	//|				И ВтЗаказКлиентаТовары.Номенклатура = СхемыОбеспечения.Номенклатура
	//|				И ВтЗаказКлиентаТовары.Характеристика = СхемыОбеспечения.Характеристика) КАК ВложенныйЗапрос
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВложенныйЗапрос.СхемаОбеспечения,
	//|	ВложенныйЗапрос.ЗакупкаСПроизводства,
	//|	ВложенныйЗапрос.Склад,
	//|	ВложенныйЗапрос.ВариантОбеспечения,
	//|	ВложенныйЗапрос.Характеристика,
	//|	ВложенныйЗапрос.Номенклатура,
	//|	ВложенныйЗапрос.СрокОбеспеченияМин,
	//|	ВложенныйЗапрос.СрокОбеспеченияМакс,
	//|	ВложенныйЗапрос.ПриоритетСхемыОбеспечения,
	//|	ВложенныйЗапрос.ДатаОбеспечения
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура,
	//|	ПриоритетСхемыОбеспечения,
	//|	ДатаОбеспечения,
	//|	СхемаОбеспечения
	//|ИТОГИ
	//|	СУММА(Количество),
	//|	МАКСИМУМ(Отгружено),
	//|	МАКСИМУМ(Доступно)
	//|ПО
	//|	Номенклатура";
	
	
	//Запрос.УстановитьПараметр("ТаблицаОбеспечения", Таблица);
	//Запрос.УстановитьПараметр("Склад", Объект.Склад);
	//Запрос.УстановитьПараметр("Товары", СтрокиТовары);

	//Запрос.УстановитьПараметр("ТаблицаСхем", ТаблицаСхемОбеспечения);
	//Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЗначениеВРеквизитФормы(Параметры.ТаблицаМатериалов, "ТаблицаМатериалов");
	Для Каждого Строка Из Параметры.ТаблицаМатериалов Цикл
		НоваяСтрока = ТаблицаМатериалов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	СформироватьПриОткрытии = Параметры.СформироватьПриОткрытии;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СформироватьПриОткрытии Тогда
		СформироватьНаСервере(ТаблДок);
	КонецЕсли;
	
КонецПроцедуры



