Функция ПроверитьИндУпаковкуЕдиницыХранения(пНоменклатура) Экспорт
	//++Шерстюк Ю.Ю. 15.04.2021
	Запрос = Новый Запрос("ВЫБРАТЬ
		                        |	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
		                        |ИЗ
		                        |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		                        |ГДЕ
		                        |	УпаковкиЕдиницыИзмерения.Владелец = &Номенклатура
		                        |	И УпаковкиЕдиницыИзмерения.Числитель = 1
		                        |	И УпаковкиЕдиницыИзмерения.Знаменатель = 1
		                        |	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения");
		  
	Запрос.УстановитьПараметр("Номенклатура",пНоменклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",пНоменклатура.ЕдиницаИзмерения);
	
 	тз =  Запрос.Выполнить().Выгрузить();
	Возврат тз;  
	//--Шерстюк Ю.Ю.
КонецФункции


//&После("ДобавитьКомандыОтчетов")
//Процедура Рин1_ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры)
//	//++Шерстюк Ю.Ю. 15.06.2021 Задача 9459
//	Отчеты.Рин1_ОборотыНоменклатуры.ДобавитьКомандуОтчета(КомандыОтчетов);
//	//--Шерстюк Ю.Ю.

//КонецПроцедуры

&Перед("ДобавитьКомандыОтчетов")
Процедура Рин1_ДобавитьКомандыОтчетов1(КомандыОтчетов, Параметры)
	//++Шерстюк Ю.Ю. 06.07.2021 Задача 11681
	Отчеты.Рин1_ОборотыНоменклатурыПродажиЗакупкиПроизводство.ДобавитьКомандуОтчета(КомандыОтчетов);
	//--Шерстюк Ю.Ю.
КонецПроцедуры
