//++Шерстюк Ю.Ю. 14.04.2021 7565 создаем индивидуальную упаковку с коэф. = 1, используется для адресного хранения
&После("ПриЗаписи")
Процедура Рин1_ПриЗаписи(Отказ)
	Если Не ЭтоГруппа Тогда 
		Если Не Отказ и ВидНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда 
			пРезультат = Справочники.Номенклатура.ПроверитьИндУпаковкуЕдиницыХранения(ЭтотОбъект.Ссылка);
			
			Попытка
				Если пРезультат.Количество() = 0 Тогда
					//++Шерстюк Ю.Ю. 12.05.2021
					Если ЭтотОбъект.ДлинаИспользовать или ЭтотОбъект.ОбъемИспользовать или ЭтотОбъект.ВесИспользовать Тогда 
						 пСтруктураВГХ = Новый Структура;
						 Если ЭтотОбъект.ВесИспользовать Тогда 
							 пСтруктураВГХ.Вставить("ЕдИзВес",ЭтотОбъект.ВесЕдиницаИзмерения);
							 пСтруктураВГХ.Вставить("Вес",ЭтотОбъект.ВесЧислитель/ЭтотОбъект.ВесЗнаменатель);					 
						 Иначе
							 пСтруктураВГХ.Вставить("ЕдИзВес",Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("163"));//грамм
							 пСтруктураВГХ.Вставить("Вес",1);
						 КонецЕсли;
						 Если ЭтотОбъект.ОбъемИспользовать Тогда 
							пСтруктураВГХ.Вставить("ЕдИзОбъем",ЭтотОбъект.ОбъемЕдиницаИзмерения);
							пСтруктураВГХ.Вставить("Объем",ЭтотОбъект.ОбъемЧислитель/ЭтотОбъект.ОбъемЗнаменатель);
						 Иначе
							 пСтруктураВГХ.Вставить("ЕдИзОбъем",Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("131"));//мм3 (дюйм3)
							 пСтруктураВГХ.Вставить("Объем",1);
						 КонецЕсли;
						 пСтруктураВГХ.Вставить("ЕдИзШирина",Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("003"));//мм
						 пСтруктураВГХ.Вставить("Ширина",1);
						 пСтруктураВГХ.Вставить("ЕдИзВысота",Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("003"));
						 пСтруктураВГХ.Вставить("Высота",1);
						 Если ЭтотОбъект.ДлинаИспользовать Тогда 
							 пСтруктураВГХ.Вставить("ЕдИзГлубина",ЭтотОбъект.ДлинаЕдиницаИзмерения);
							 пСтруктураВГХ.Вставить("Глубина",ЭтотОбъект.ДлинаЧислитель/ЭтотОбъект.ДлинаЗнаменатель);
						 Иначе
							 пСтруктураВГХ.Вставить("ЕдИзГлубина",Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("003"));
							 пСтруктураВГХ.Вставить("Глубина",1);
						 КонецЕсли;
						 ГИГ_МодульВызовСервера.СоздатьУпаковкуПоЕдХранения(ЭтотОбъект.Ссылка,,пСтруктураВГХ);
					 Иначе
						ГИГ_МодульВызовСервера.СоздатьУпаковкуПоЕдХранения(ЭтотОбъект.Ссылка);
					 КонецЕсли;

					
					//--Шерстюк Ю.Ю.
				КонецЕсли;
			Исключение
				
					ТекстСообщения = "Не удалось создать индивидуальную упаковку. Обратитесь к админитратору БД...";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Владелец");
					Отказ = Истина;

			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&Перед("ПередЗаписью")
Процедура Рин1_ПередЗаписью(Отказ)
	Если Не ЭтоГруппа Тогда 
		Если Не Отказ и ВидНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") и Не ИспользоватьУпаковки Тогда 
			ЭтотОбъект.ИспользоватьУпаковки = Истина;
			ЭтотОбъект.НаборУпаковок = ПредопределенноеЗначение("Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры");
			ЭтотОбъект.ПоставляетсяВМногооборотнойТаре   = Ложь;
			ЭтотОбъект.НоменклатураМногооборотнаяТара    = Неопределено;
			ЭтотОбъект.ХарактеристикаМногооборотнаяТара  = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//--Шерстюк Ю.Ю.