// + [Rineco], [Киселев А.Н.] [23.08.2021] 
// Задача: [№ 15145], [# Отчет средняя себестоимость ТМЦ]
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.РИНЭКО_СредняяСебестоимостьТМЦ) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.РИНЭКО_СредняяСебестоимостьТМЦ.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Средняя себестоимость товаров';");
		
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.Важность = "Важное";
		
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;
КонецФункции
// - [Rineco], [Киселев А.Н.] [23.08.2021]
