
&Перед("ПередЗаписью")
Процедура Рин1_ПередЗаписью(Отказ) //++Шерстюк Ю.Ю. 19.03.2021 Задача 6093. Запрещаем запись нового объекта со страной Россия, чтобы исключить дубли
	ЭтотОбъект.РегистрационныйНомер = ЭтотОбъект.Код;
	Если ЭтотОбъект.СтранаПроисхождения.Код = "643" и ЭтотОбъект.ЭтоНовый() Тогда 
		пНомераГТДРоссия = Справочники.НомераГТД.НайтиПоРеквизиту("СтранаПроисхождения",Справочники.СтраныМира.НайтиПоКоду("643"));
		Если пНомераГТДРоссия <> Справочники.НомераГТД.ПустаяСсылка() Тогда 
			Сообщить("Номер ГТД не может быть записан, т.к. справочник уже содержит значение по указанной Стране происхождения");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //--Шерстюк Ю.Ю.
