Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
    //++Шерстюк Ю.Ю. 24.05.2021
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.Рин1_СредняяСебестоимостьТоваров) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.Рин1_СредняяСебестоимостьТоваров.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Средняя себестоимость товаров';");
		
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.Важность = "Важное";
		
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;
     //--Шерстюк Ю.Ю. 24.05.2021
КонецФункции


Процедура ПриОпределенииНастроек(Настройки) Экспорт
     Настройки.НастроитьВариантыОтчета = Истина;
	 Настройки.ОпределитьНастройкиФормы = Истина; 
 КонецПроцедуры
 
 Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	 
	 ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.Рин1_СредняяСебестоимостьТоваров);
	 
 КонецПроцедуры
 
 
 