
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	Настройки =  КомпоновщикНастроек.ПолучитьНастройки(); 
	пДокумент = Настройки.ПараметрыДанных.Элементы.Найти("Документ");
	пДокумент.Использование = Истина;
	пДокумент.Значение = Документ;
	//пДатаДокумента = Настройки.ПараметрыДанных.Элементы.Найти("ДатаДокумента");
	//пДатаДокумента.Использование = Истина;
	//пДатаДокумента.Значение = ДатаДокумента;
 
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ); 
    
    ДокументРезультат.Очистить();
    
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры
