#Область ПрограмныйИнтерфейс
Процедура УстановитьПодразделениеСервер(ПодотчетноеЛицо,Подразделение) Экспорт
	
	ТаблицаСотрудников = КадровыйУчет.СотрудникиФизическихЛиц(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПодотчетноеЛицо));
	
	Если ТаблицаСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивДанныхДляПоискаПодразделения = Новый Массив;
	
	Для Каждого ЭлементСотрудник Из ТаблицаСотрудников Цикл 
		
		ТаблицаКадровыхДанных = КадровыйУчет.КадровыеДанныеСотрудников(Истина,ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлементСотрудник),"Подразделение");
		
		Если ТаблицаКадровыхДанных.Количество() > 0 И ЗначениеЗаполнено(ТаблицаКадровыхДанных[0].Подразделение) Тогда
			МассивДанныхДляПоискаПодразделения.Добавить(ТаблицаКадровыхДанных[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(МассивДанныхДляПоискаПодразделения) Тогда
		Возврат;
	КонецЕсли;
	
	ПодразделениеУПР = ПолучитьПодразделениеУПР(МассивДанныхДляПоискаПодразделения);
	
	Если ПодразделениеУПР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодразделениеУПР) Тогда
		Подразделение = ПодразделениеУПР;	
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПодразделениеУПР(МассивДанныхДляПоискаПодразделения)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Подразделение",МассивДанныхДляПоискаПодразделения[0].Подразделение);
	ПараметрыЗапроса.Вставить("Должность",МассивДанныхДляПоискаПодразделения[0].Должность);
	ТаблицаЗапросаПозиция = ОбщегоНазначенияУТ.ЗапросВыполнитьВыгрузить(ТекстЗапросаШтатноеРасписание(),ПараметрыЗапроса);
	
	Если Не ЗначениеЗаполнено(ТаблицаЗапросаПозиция) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Позиция",ТаблицаЗапросаПозиция[0].Ссылка);
	ТаблицаЗапросаМестоВСтруктуре = ОбщегоНазначенияУТ.ЗапросВыполнитьВыгрузить(ТекстЗапросаМестоВСтруктуре(),ПараметрыЗапроса);
	
	Если Не ЗначениеЗаполнено(ТаблицаЗапросаМестоВСтруктуре) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ТаблицаЗапросаМестоВСтруктуре[0].Подразделение;
	
КонецФункции

Функция ТекстЗапросаШтатноеРасписание()
	
	Возврат "ВЫБРАТЬ
	|ШтатноеРасписание.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	ШтатноеРасписание.Подразделение = &Подразделение
	|	И ШтатноеРасписание.Должность = &Должность";
	
КонецФункции

Функция ТекстЗапросаМестоВСтруктуре()
	
	Возврат "ВЫБРАТЬ
	|МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|ГДЕ
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция = &Позиция";
	
КонецФункции
#КонецОбласти