// + [Rineco], [Киселев А.] [22.12.2021] [Log_Diff][№ 24459], [#Функция в диспетчировании этапов] 
&НаКлиенте
Процедура УстановитьСнятьОтметки(ЗначениеОтметки)
	
	Для Каждого ЭлементСписка Из СписокСтатей Цикл 
		ЭлементСписка.Пометка = ЗначениеОтметки;
	КонецЦикла;
	
КонецПроцедуры

// + [Rineco], [Киселев А.] [22.12.2021] [Log_Diff][№ 24459], [#Функция в диспетчировании этапов] 
&НаКлиенте
Процедура ОтметитьВсе(Команда)
	УстановитьСнятьОтметки(Истина);
КонецПроцедуры

// + [Rineco], [Киселев А.] [22.12.2021] [Log_Diff][№ 24459], [#Функция в диспетчировании этапов] 
&НаКлиенте
Процедура УбратьОтметки(Команда)
	УстановитьСнятьОтметки(Ложь);
КонецПроцедуры

// + [Rineco], [Киселев А.] [23.12.2021] [Log_Diff][№ 24459], [#СводноеЗадание]
&НаКлиенте
Процедура Ок(Команда)
	
	ПараметрыФормы = Новый Структура;
	МассивЭтаповПараметр = Новый Массив;
	Для Каждого ЭлементТаблицы Из ТаблицаЭтапов Цикл 
		МассивЭтаповПараметр.Добавить(ЭлементТаблицы.Этап);
	КонецЦикла;
	
	ПараметрыФормы.Вставить("МассивЭтапов",МассивЭтаповПараметр);
	ПараметрыФормы.Вставить("МассивМассивСтатейКалькуляции",ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(СписокСтатей));
	
	
	Если ДляАнализа Тогда
		ОткрытьФорму("Документ.ЭтапПроизводства2_2.Форма.Рин1_ФормаАнализа",ПараметрыФормы,ЭтаФорма);
	Иначе 
		ОткрытьФорму("Документ.ЭтапПроизводства2_2.Форма.Рин1_ФормаСводногоЗадания",ПараметрыФормы,ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// + [Rineco], [Киселев А.] [23.12.2021] [Log_Diff][№ 24459], [#СводноеЗадание]
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Элемент Из Параметры.МассивЭтапов Цикл 
		
		НоваяСтрока = ТаблицаЭтапов.Добавить();
		НоваяСтрока.Этап = Элемент;
		
	КонецЦикла;
	
	Если Параметры.Свойство("ДляАнализа") Тогда
		ДляАнализа = Истина;
	Иначе 
		ДляАнализа = Ложь;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиКалькуляции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатьиКалькуляции КАК СтатьиКалькуляции
		|ГДЕ
		|	НЕ СтатьиКалькуляции.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокСтатей.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,Истина);
	КонецЦикла;
	
КонецПроцедуры
