// Получает настройку по имени справочника и номерам реквизитов
//
// Параметры:
//  НаименованиеСправочника  - Строка - Имя элемента справочника
// 
//  Номера  - Строка - имена реквизитов, перечисленные через запятую
// 
// Возвращаемое значение:
//   Структура - содержит имена (ключи) и значения затребованных реквизитов.
Функция  ПолучитьНастройкуПоНаименованию(НаименованиеСправочника,Номера) Экспорт
	
	Если Не ЗначениеЗаполнено(НаименованиеСправочника) И НЕ ЗначениеЗаполнено(Номера) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Номера) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрДлина(Номера) > 1 Тогда
		МассивСтрокРазложенный = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Номера,",");
	Иначе 
		МассивСтрокРазложенный = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Номера);
	КонецЕсли;
	
	МассивРеквизитов = "";
	
	Для Каждого ЭлементСтроки Из МассивСтрокРазложенный Цикл 
		Если ПустаяСтрока(МассивРеквизитов) Тогда
			МассивРеквизитов = МассивРеквизитов + "Реквизит"+СокрЛП(ЭлементСтроки);
		Иначе
			МассивРеквизитов = МассивРеквизитов + ", Реквизит"+СокрЛП(ЭлементСтроки);
		КонецЕсли;
			
	КонецЦикла;
	
	СсылкаСправочника = Справочники.Ринэко_Настройки.НайтиПоНаименованию(НаименованиеСправочника);
	
	Если СсылкаСправочника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(СсылкаСправочника,МассивРеквизитов);
	
КонецФункции

// Получает настройку по коду справочника и номерам реквизитов
//
// Параметры:
//  КодСправочника  - Строка - Имя элемента справочника
// 
//  Номера  - Строка - имена реквизитов, перечисленные через запятую
// 
// Возвращаемое значение:
//   Структура - содержит имена (ключи) и значения затребованных реквизитов.
Функция  ПолучитьНастройкуКоду(НаименованиеСправочника,Номера) Экспорт
	
	Если Не ЗначениеЗаполнено(НаименованиеСправочника) И НЕ ЗначениеЗаполнено(Номера) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Номера) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрДлина(Номера) > 1 Тогда
		МассивСтрокРазложенный = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Номера,",");
	Иначе 
		МассивСтрокРазложенный = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Номера);
	КонецЕсли;
	
	МассивРеквизитов = "";
	
	Для Каждого ЭлементСтроки Из МассивСтрокРазложенный Цикл 
		Если ПустаяСтрока(МассивРеквизитов) Тогда
			МассивРеквизитов = МассивРеквизитов + "Реквизит"+СокрЛП(ЭлементСтроки);
		Иначе
			МассивРеквизитов = МассивРеквизитов + ", Реквизит"+СокрЛП(ЭлементСтроки);
		КонецЕсли;
			
	КонецЦикла;

	
	СсылкаСправочника = Справочники.Ринэко_Настройки.НайтиПоКоду(НаименованиеСправочника);
	
	Если СсылкаСправочника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(СсылкаСправочника,МассивРеквизитов);
	
КонецФункции

// Получает настройку в табличной части по имени справочника и номерам реквизитов
//
// Параметры:
//  НаименованиеСправочника  - Строка - Имя элемента справочника
//
//  НомерСтроки  - Число - номер строки в табличной части
// 
//  Номера  - Строка - имена реквизитов, перечисленные через запятую
// 
// Возвращаемое значение:
//   Структура - содержит имена (ключи) и значения затребованных реквизитов.
Функция  ПолучитьНастройкуТабличнойЧастиПоНаименованию(НаименованиеСправочника,НомерСтроки,Номера) Экспорт
	
	Если Не ЗначениеЗаполнено(НаименованиеСправочника) И НЕ ЗначениеЗаполнено(Номера) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Номера) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрДлина(Номера) > 1 Тогда
		МассивСтрокРазложенный = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Номера,",");
	Иначе 
		МассивСтрокРазложенный = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Номера);
	КонецЕсли;
	
	МассивРеквизитов = Новый Массив;
	
	
	Для Каждого ЭлементСтроки Из МассивСтрокРазложенный Цикл 		
			МассивРеквизитов.Добавить("Реквизит"+СокрЛП(ЭлементСтроки));		
	КонецЦикла;
	
	СсылкаСправочника = Справочники.Ринэко_Настройки.НайтиПоНаименованию(НаименованиеСправочника);
	
	Если СсылкаСправочника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	
	Если СсылкаСправочника.ДополнительныеНастройки.Количество() < НомерСтроки  Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	Для Каждого Элемент Из МассивРеквизитов Цикл 
		
		СтруктураВозврата.Вставить(Элемент,СсылкаСправочника.ДополнительныеНастройки[НомерСтроки - 1][Элемент]);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
	
КонецФункции

// Получает настройку в табличной части по коду справочника и номерам реквизитов
//
// Параметры:
//  НаименованиеСправочника  - Строка - Имя элемента справочника
// 
//  НомерСтроки  - Число - номер строки в табличной части
//
//  Номера  - Строка - имена реквизитов, перечисленные через запятую
// 
// Возвращаемое значение:
//   Структура - содержит имена (ключи) и значения затребованных реквизитов.
Функция  ПолучитьНастройкуТабличнойЧастиПоКоду(НаименованиеСправочника,НомерСтроки,Номера) Экспорт
	
	Если Не ЗначениеЗаполнено(НаименованиеСправочника) И НЕ ЗначениеЗаполнено(Номера) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Номера) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрДлина(Номера) > 1 Тогда
		МассивСтрокРазложенный = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Номера,",");
	Иначе 
		МассивСтрокРазложенный = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Номера);
	КонецЕсли;
	
	МассивРеквизитов = Новый Массив;
	
	
	Для Каждого ЭлементСтроки Из МассивСтрокРазложенный Цикл 		
			МассивРеквизитов.Добавить("Реквизит"+СокрЛП(ЭлементСтроки));		
	КонецЦикла;
	
	СсылкаСправочника = Справочники.Ринэко_Настройки.НайтиПоКоду(НаименованиеСправочника);
	
	Если СсылкаСправочника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	
	Если СсылкаСправочника.ДополнительныеНастройки.Количество() < НомерСтроки  Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	Для Каждого Элемент Из МассивРеквизитов Цикл 
		
		СтруктураВозврата.Вставить(Элемент,СсылкаСправочника.ДополнительныеНастройки[НомерСтроки - 1][Элемент]);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
	
КонецФункции

