
Функция гиг_ПараметрыРасшифровкиОбеспечениеМатериаловДляАРМ(Расшифровка, АдресДанныхРасшифровки, КомпоновщикНастроек, КлючТекущегоВарианта) Экспорт
	
	Если КлючТекущегоВарианта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыРасшифровки = Новый Структура;
	
	ИмяВариантаРасшифровки = КлючТекущегоВарианта + "Расшифровка"; 
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	
	ПоляГруппировки = Новый Структура;
	ОтчетыУТВызовСервераПереопределяемый.ПолучитьЗначенияПолей(ПоляГруппировки, ДанныеРасшифровки.Элементы, Расшифровка);
	
	Если ПоляГруппировки.Свойство("Этап") Тогда
		ДатаМин = Неопределено;
		ДатаМакс = Дата('00010101');
		Для Каждого СтрокаЭлемента Из ДанныеРасшифровки.Элементы Цикл
			Если ТипЗнч(СтрокаЭлемента) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыРасшифровки.Вставить("Этап", ПоляГруппировки.Этап);
			
			ПоляЭлементаРасшифровки = СтрокаЭлемента.ПолучитьПоля();
			ПоляРодителей = СтрокаЭлемента.ПолучитьРодителей();
						
			ЗначениеДатаМин = ПоляЭлементаРасшифровки.Найти("СпособОбеспеченияПотребностейСрокИсполненияЗаказа");
			ЗначениеДатаМакс = ПоляЭлементаРасшифровки.Найти("СпособОбеспеченияПотребностейГарантированныйСрокОтгрузки");
			
			Если ЗначениеДатаМин = Неопределено И ЗначениеДатаМакс = Неопределено Тогда
				Продолжить;
			Иначе
				Если ТипЗнч(ПоляРодителей) = Тип("Массив") И ПоляРодителей.Количество() > 0 Тогда
					ИдентификаторПоля = ПоляРодителей[0].Идентификатор;
					ПоляГруппировкиЭтап = Новый Структура;
					ОтчетыУТВызовСервераПереопределяемый.ПолучитьЗначенияПолей(ПоляГруппировкиЭтап, ДанныеРасшифровки.Элементы, ИдентификаторПоля);
						
					Если ПоляГруппировкиЭтап.Свойство("Этап") И ПоляГруппировкиЭтап.Этап <> ПоляГруппировки.Этап Тогда
						Продолжить;
					КонецЕсли;
						
				КонецЕсли;
			КонецЕсли;
			
				
			Если НЕ ЗначениеДатаМин= Неопределено Тогда
								
				Если ДатаМин = Неопределено ИЛИ ДатаМин = Дата('00010101') Тогда
					ДатаМин = ЗначениеДатаМин.Значение;
				КонецЕсли;
				
				Если НЕ ТипЗнч(ДатаМин) = Тип("Дата") ИЛИ НЕ ТипЗнч(ЗначениеДатаМин.Значение) = Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДатаМин > ЗначениеДатаМин.Значение Тогда
					ДатаМин = ЗначениеДатаМин.Значение;
				КонецЕсли;
			КонецЕсли;
						
			Если НЕ ЗначениеДатаМакс = Неопределено И Не ЗначениеДатаМакс.Значение = NULL Тогда
				
				Если НЕ ТипЗнч(ДатаМакс) = Тип("Дата") ИЛИ НЕ ТипЗнч(ЗначениеДатаМакс.Значение) = Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДатаМакс < ЗначениеДатаМакс.Значение Тогда
					ДатаМакс = ЗначениеДатаМакс.Значение;
				КонецЕсли;
					
			КонецЕсли;
		КонецЦикла;
		ПараметрыРасшифровки.Вставить("ДатаМин", ДатаМин);
		ПараметрыРасшифровки.Вставить("ДатаМакс", ДатаМакс);
	ИначеЕсли ПоляГруппировки.Свойство("Заказ") Тогда
		ДатаМин = Неопределено;
		ДатаМакс = Дата('00010101');
		Для Каждого СтрокаЭлемента Из ДанныеРасшифровки.Элементы Цикл
			Если ТипЗнч(СтрокаЭлемента) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляЭлементаРасшифровки = СтрокаЭлемента.ПолучитьПоля();
			ЗначениеДатаМин = ПоляЭлементаРасшифровки.Найти("СпособОбеспеченияПотребностейСрокИсполненияЗаказа");
							
			Если НЕ ЗначениеДатаМин= Неопределено  Тогда
				Если ДатаМин = Неопределено ИЛИ ДатаМин = Дата('00010101') Тогда
					ДатаМин = ЗначениеДатаМин.Значение;
				КонецЕсли;
				
				Если НЕ ТипЗнч(ДатаМин) = Тип("Дата") ИЛИ НЕ ТипЗнч(ЗначениеДатаМин.Значение) = Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДатаМин > ЗначениеДатаМин.Значение Тогда
					ДатаМин = ЗначениеДатаМин.Значение;
				КонецЕсли;
			КонецЕсли;
				
			ЗначениеДатаМакс = ПоляЭлементаРасшифровки.Найти("СпособОбеспеченияПотребностейГарантированныйСрокОтгрузки");
			Если НЕ ЗначениеДатаМакс = Неопределено И Не ЗначениеДатаМакс.Значение = NULL Тогда
				
				Если НЕ ТипЗнч(ДатаМакс) = Тип("Дата") ИЛИ НЕ ТипЗнч(ЗначениеДатаМакс.Значение) = Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДатаМакс < ЗначениеДатаМакс.Значение Тогда
					ДатаМакс = ЗначениеДатаМакс.Значение;
				КонецЕсли;
					
			КонецЕсли;
		КонецЦикла;
		ПараметрыРасшифровки.Вставить("Заказ", ПоляГруппировки.Заказ);
		ПараметрыРасшифровки.Вставить("ДатаМин", ДатаМин);
		ПараметрыРасшифровки.Вставить("ДатаМакс", ДатаМакс);
	КонецЕсли;
	
	Возврат ПараметрыРасшифровки;
КонецФункции