
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Рин1_НазначенияСотрудниковВРЦ.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьНазначений Из ТабличнаяЧастьНазначений Цикл
		Движение = Движения.Рин1_НазначенияСотрудниковВРЦ.Добавить();
		Движение.Период = ТекСтрокаТабличнаяЧастьНазначений.ДатаНазначения;
		Движение.Сотрудник = ТекСтрокаТабличнаяЧастьНазначений.Сотрудник;
		Движение.ВРЦ = ТекСтрокаТабличнаяЧастьНазначений.ВРЦ;
		Движение.ОсвободитьОтНазначений = ТекСтрокаТабличнаяЧастьНазначений.ОсвободитьОтНазначений;
	КонецЦикла;

КонецПроцедуры
