//новые элементы созданы программно в общ мод НастройкиПрограммыПереопределяемый, через расширение почему то не добавлялись - баг

&НаКлиенте
Процедура Рин1_ДобавленныйПриИзменении(Элемент)
	
	ОбработатьКонстантуПутьДляХраненияКартинок(Элемент.ТекстРедактирования);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьКонстантуПутьДляХраненияКартинок(ПолеПутьХранения)
	
	ПутьДляХраненияКартинок = Константы.Рин1_ПутьДляХраненияКартиноктинок.СоздатьМенеджерЗначения();
	ПутьДляХраненияКартинок.Прочитать();
	ПутьДляХраненияКартинок.Значение = СокрЛП(ПолеПутьХранения);
	ПутьДляХраненияКартинок.Записать();
	
КонецПроцедуры