
&Перед("ПередЗаписью")
Процедура Рин1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//++Шерстюк Ю.Ю. 28.05.2021 Задача 8881 
	пТипПоручениеЭкспедитору = Тип("ДокументСсылка.ПоручениеЭкспедитору");
	Для Каждого СтрТовары из Распоряжения Цикл 
		Если ТипЗнч(СтрТовары.Распоряжение) = пТипПоручениеЭкспедитору Тогда 
			СтрТовары.Объем = СтрТовары.Распоряжение.Рин1_Объем;
			СтрТовары.Вес = СтрТовары.Распоряжение.Рин1_Масса;
			//СтрТовары.ДополнительнаяИнформация = СтрТовары.ДополнительнаяИнформация + "Менеждер: " + Строка(СтрТовары.Распоряжение.Ответственный) + "; " +  Строка(СтрТовары.Распоряжение.КонтактноеЛицо) + " тел. " + Строка(СтрТовары.Распоряжение.Рин1_ТелефонКонтактногоЛица);
					
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрМаршрут из Маршрут Цикл
		пМассивСтрок = Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи",СтрМаршрут.КлючСвязи));
		пИтогВес = 0;
		пИтогОбъем = 0;
		пДопИнформация = "";
		Для Каждого ЭлементМассива из пМассивСтрок Цикл
			Если ТипЗнч(ЭлементМассива.Распоряжение) = пТипПоручениеЭкспедитору Тогда 
				пИтогВес = пИтогВес + ЭлементМассива.Вес;
				пИтогОбъем = пИтогОбъем + ЭлементМассива.Объем;
				//пДопИнформация = пДопИнформация + " " + ЭлементМассива.ДополнительнаяИнформация;
			КонецЕсли;
		КонецЦикла;
		СтрМаршрут.Вес = ?(СтрМаршрут.Вес = 0,пИтогВес,СтрМаршрут.Вес);
		СтрМаршрут.Объем = ?(СтрМаршрут.Объем = 0,пИтогОбъем,СтрМаршрут.Объем);
		//СтрМаршрут.ДополнительнаяИнформация = ?(СтрМаршрут.ДополнительнаяИнформация = "",пДопИнформация,СтрМаршрут.ДополнительнаяИнформация);

	КонецЦикла;


	
	//--Шерстюк Ю.Ю.
КонецПроцедуры

// + [Rineco], [Киселев А.Н.] [08.10.2021] 
// Задача: [№ 19055], [#Статусы поручения экспедитору]
&После("ОбработкаПроведения")
Процедура Рин1_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	СоответствиеСтатусов = Документы.ЗаданиеНаПеревозку.СформироватьСоответствиеСтатусов();
	
	Для Каждого ЭлементРаспоряжения Из Распоряжения Цикл 
		УстановитьПривилегированныйРежим(Истина);
		Если ТипЗнч(ЭлементРаспоряжения.Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда  
			ОбъектРаспоряжения = ЭлементРаспоряжения.Распоряжение.ПолучитьОбъект();
			ОбъектРаспоряжения.РИНЭКО_Статус = СоответствиеСтатусов.Получить(Статус); 
			
			Попытка
				ОбъектРаспоряжения.Записать();
			Исключение
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("19055",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;		
		
	КонецЦикла;
	
	
КонецПроцедуры


