//++Шерстюк Ю.Ю. 29.01.21
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	пОбъектТчЭтапы = РеквизитФормыВЗначение("ЭтапыПроизводства");
	пОбъектТчТрудозатраты = РеквизитФормыВЗначение("Трудозатраты");

	Если Параметры.ПроверкаПоЭтапыПроизводства Тогда
		Элементы.Трудозатраты.Видимость = Ложь;
		Элементы.ЭтапыПроизводства.Видимость  = Истина;
		пОбъектТчЭтапы = СравнитьЭтапы(Параметры.Ссылка,Параметры.Таблица.Выгрузить());
		ЗначениеВРеквизитФормы(пОбъектТчЭтапы,"ЭтапыПроизводства");
	Иначе
		Элементы.ЭтапыПроизводства.Видимость  = Ложь;
		Элементы.Трудозатраты.Видимость = Истина;
		пОбъектТчТрудозатраты = СравнитьТрудозатраты(Параметры.Ссылка,Параметры.Таблица.Выгрузить());
		ЗначениеВРеквизитФормы(пОбъектТчТрудозатраты,"Трудозатраты");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СравнитьЭтапы(пСсылка,пТаблица)
	пЗапрос = Новый Запрос("ВЫБРАТЬ
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.НомерСтроки КАК НомерСтрокиПредметРасчета,
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.НомерЭтапа КАК НомерЭтапаПредметРасчета,
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.НомерСледующегоЭтапа КАК НомерСледующегоЭтапаПредметРасчета,
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.Наименование КАК НаименованиеПредметРасчета,
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.Подразделение КАК ПодразделениеПредметРасчета,
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.ДлительностьЭтапа КАК ДлительностьЭтапаПредметРасчета,
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.ЕдиницаИзмеренияДлительностиЭтапа КАК ЕдиницаИзмеренияДлительностиЭтапаПредметРасчета,
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.МаршрутнаяКарта КАК МаршрутнаяКартаПредметРасчета
	                       |ПОМЕСТИТЬ ЭтапыПредметаРасчета
	                       |ИЗ
	                       |	Справочник.гиг_ПредметыРасчета.ЭтапыПроизводства КАК гиг_ПредметыРасчетаЭтапыПроизводства
	                       |ГДЕ
	                       |	гиг_ПредметыРасчетаЭтапыПроизводства.Ссылка = &ПредметРасчета
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Таблица.НомерСтроки КАК НомерСтроки,
	                       |	Таблица.НомерЭтапа КАК НомерЭтапа,
	                       |	Таблица.НомерСледующегоЭтапа КАК НомерСледующегоЭтапа,
	                       |	Таблица.Наименование КАК Наименование,
	                       |	Таблица.Подразделение КАК Подразделение,
	                       |	Таблица.ДлительностьЭтапа КАК ДлительностьЭтапа,
	                       |	Таблица.ЕдиницаИзмеренияДлительностиЭтапа КАК ЕдиницаИзмеренияДлительностиЭтапа,
	                       |	Таблица.МаршрутнаяКарта КАК МаршрутнаяКарта
	                       |ПОМЕСТИТЬ ЭтапыВариантовРасчета
	                       |ИЗ
	                       |	&Таблица КАК Таблица
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ЭтапыВариантовРасчета.НомерСтроки КАК НомерСтроки,
	                       |	ЭтапыВариантовРасчета.НомерЭтапа КАК НомерЭтапа,
	                       |	ЭтапыВариантовРасчета.НомерСледующегоЭтапа КАК НомерСледующегоЭтапа,
	                       |	ЭтапыВариантовРасчета.Наименование КАК Наименование,
	                       |	ЭтапыВариантовРасчета.Подразделение КАК Подразделение,
	                       |	ЭтапыВариантовРасчета.ДлительностьЭтапа КАК ДлительностьЭтапа,
	                       |	ЭтапыВариантовРасчета.ЕдиницаИзмеренияДлительностиЭтапа КАК ЕдиницаИзмеренияДлительностиЭтапа,
	                       |	ЭтапыВариантовРасчета.МаршрутнаяКарта КАК МаршрутнаяКарта,
	                       |	ЭтапыПредметаРасчета.НомерСтрокиПредметРасчета КАК НомерСтрокиПредметРасчета,
	                       |	ЭтапыПредметаРасчета.НомерЭтапаПредметРасчета КАК НомерЭтапаПредметРасчета,
	                       |	ЭтапыПредметаРасчета.НомерСледующегоЭтапаПредметРасчета КАК НомерСледующегоЭтапаПредметРасчета,
	                       |	ЭтапыПредметаРасчета.НаименованиеПредметРасчета КАК НаименованиеПредметРасчета,
	                       |	ЭтапыПредметаРасчета.ПодразделениеПредметРасчета КАК ПодразделениеПредметРасчета,
	                       |	ЭтапыПредметаРасчета.ДлительностьЭтапаПредметРасчета КАК ДлительностьЭтапаПредметРасчета,
	                       |	ЭтапыПредметаРасчета.ЕдиницаИзмеренияДлительностиЭтапаПредметРасчета КАК ЕдиницаИзмеренияДлительностиЭтапаПредметРасчета,
	                       |	ЭтапыПредметаРасчета.МаршрутнаяКартаПредметРасчета КАК МаршрутнаяКартаПредметРасчета
	                       |ИЗ
	                       |	ЭтапыПредметаРасчета КАК ЭтапыПредметаРасчета
	                       |		ПОЛНОЕ СОЕДИНЕНИЕ ЭтапыВариантовРасчета КАК ЭтапыВариантовРасчета
	                       |		ПО (ЭтапыВариантовРасчета.НомерСтроки = ЭтапыПредметаРасчета.НомерСтрокиПредметРасчета)");
	пЗапрос.УстановитьПараметр("ПредметРасчета",пСсылка.НоменклатураПроекта.ЗадачаПроекта.ГИГ_ПредметРасчета);
	пЗапрос.УстановитьПараметр("Таблица",пТаблица);

	Возврат пЗапрос.Выполнить().Выгрузить();
КонецФункции
&НаСервере
Функция СравнитьТрудозатраты(пСсылка,пТаблица)
	пЗапрос = Новый Запрос("ВЫБРАТЬ
	                       |	гиг_ПредметыРасчетаТрудозатраты.НомерСтроки КАК НомерСтрокиПредметРасчета,
	                       |	гиг_ПредметыРасчетаТрудозатраты.ВидРабот КАК ВидРаботПредметРасчета,
	                       |	гиг_ПредметыРасчетаТрудозатраты.Количество КАК КоличествоПредметРасчета,
	                       |	гиг_ПредметыРасчетаТрудозатраты.Цена КАК ЦенаПредметРасчета,
	                       |	гиг_ПредметыРасчетаТрудозатраты.Сумма КАК СуммаПредметРасчета,
	                       |	гиг_ПредметыРасчетаТрудозатраты.ЭтапПроизводства КАК ЭтапПроизводстваПредметРасчета
	                       |ПОМЕСТИТЬ ТрудозатратыПредметаРасчета
	                       |ИЗ
	                       |	Справочник.гиг_ПредметыРасчета.Трудозатраты КАК гиг_ПредметыРасчетаТрудозатраты
	                       |ГДЕ
	                       |	гиг_ПредметыРасчетаТрудозатраты.Ссылка = &ПредметРасчета
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Таблица.НомерСтроки КАК НомерСтроки,
	                       |	Таблица.ВидРабот КАК ВидРабот,
	                       |	Таблица.Количество КАК Количество,
	                       |	Таблица.Цена КАК Цена,
	                       |	Таблица.Сумма КАК Сумма,
	                       |	Таблица.ЭтапПроизводства КАК ЭтапПроизводства
	                       |ПОМЕСТИТЬ ТрудозатратыВариантРасчета
	                       |ИЗ
	                       |	&Таблица КАК Таблица
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ТрудозатратыВариантРасчета.НомерСтроки КАК НомерСтроки,
	                       |	ТрудозатратыВариантРасчета.ВидРабот КАК ВидРабот,
	                       |	ТрудозатратыВариантРасчета.Количество КАК Количество,
	                       |	ТрудозатратыВариантРасчета.Цена КАК Цена,
	                       |	ТрудозатратыВариантРасчета.Сумма КАК Сумма,
	                       |	ТрудозатратыВариантРасчета.ЭтапПроизводства КАК ЭтапПроизводства,
	                       |	ТрудозатратыПредметаРасчета.НомерСтрокиПредметРасчета КАК НомерСтрокиПредметРасчета,
	                       |	ТрудозатратыПредметаРасчета.ВидРаботПредметРасчета КАК ВидРаботПредметРасчета,
	                       |	ТрудозатратыПредметаРасчета.КоличествоПредметРасчета КАК КоличествоПредметРасчета,
	                       |	ТрудозатратыПредметаРасчета.ЦенаПредметРасчета КАК ЦенаПредметРасчета,
	                       |	ТрудозатратыПредметаРасчета.СуммаПредметРасчета КАК СуммаПредметРасчета,
	                       |	ТрудозатратыПредметаРасчета.ЭтапПроизводстваПредметРасчета КАК ЭтапПроизводстваПредметРасчета
	                       |ИЗ
	                       |	ТрудозатратыПредметаРасчета КАК ТрудозатратыПредметаРасчета
	                       |		ПОЛНОЕ СОЕДИНЕНИЕ ТрудозатратыВариантРасчета КАК ТрудозатратыВариантРасчета
	                       |		ПО (ТрудозатратыВариантРасчета.ВидРабот = ТрудозатратыПредметаРасчета.ВидРаботПредметРасчета)
	                       |			И (ТрудозатратыВариантРасчета.ЭтапПроизводства = ТрудозатратыПредметаРасчета.ЭтапПроизводстваПредметРасчета)");
	пЗапрос.УстановитьПараметр("ПредметРасчета",пСсылка.НоменклатураПроекта.ЗадачаПроекта.ГИГ_ПредметРасчета);
	пЗапрос.УстановитьПараметр("Таблица",пТаблица);
	Возврат пЗапрос.Выполнить().Выгрузить();
КонецФункции

//--Шерстюк Ю.Ю.