
&Вместо("ЗаполнитьВариантОбеспечения")
Процедура Рин1_ЗаполнитьВариантОбеспечения(Объект, Форма, ДанныеЗаполнения, ДатаОтгрузки)
	СоСклада = Перечисления.ВариантыОбеспечения.СоСклада;

	ТекСтрокаТовары = Неопределено;
	Идентификатор   = Неопределено;
	Для Каждого СтрокаОбеспечения Из ДанныеЗаполнения Цикл

		// Выбор существующей, либо добавление новой строки.
		Если Идентификатор <> СтрокаОбеспечения.Идентификатор Тогда
			Идентификатор = СтрокаОбеспечения.Идентификатор;
			СтрокаТовары = Объект.ТаблицаЗаказа.НайтиПоИдентификатору(Идентификатор);
			ТекСтрокаТовары = СтрокаТовары;
		Иначе
			ТекСтрокаТовары = Объект.ТаблицаЗаказа.Вставить(Объект.ТаблицаЗаказа.Индекс(ТекСтрокаТовары) + 1);
			ЗаполнитьЗначенияСвойств(ТекСтрокаТовары, СтрокаТовары);
			ТекСтрокаТовары.КодСтроки = 0;
		КонецЕсли;

		// Заполнение полей обеспечения.
		ЗаполнитьЗначенияСвойств(ТекСтрокаТовары, СтрокаОбеспечения, "Количество, ВариантОбеспечения, Склад");
		ТекСтрокаТовары.Модифицирована = Истина;

		ДатаПоУмолчанию = Макс(НачалоДня(ТекущаяДатаСеанса()), ТекСтрокаТовары.ЖелаемаяДатаОтгрузки);
		Если ДатаОтгрузки <> Неопределено Тогда
			ДатаПоУмолчанию = Макс(ДатаПоУмолчанию, ДатаОтгрузки);
		КонецЕсли;

		
		// + [Rineco], [Киселев А.Н.] [10.08.2021] 
		// Задача: [№ 13539], [#Подменяем дату документа если обеспечивать обособлено]
		
		// Было:
		//Если СтрокаОбеспечения.Отгружено = 0 Тогда
		//	ТекСтрокаТовары.ДатаОтгрузки = Макс(СтрокаОбеспечения.ДатаОтгрузки, ДатаПоУмолчанию);
		//КонецЕсли;
		// Стало:	
		Если ТекСтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно И ТекСтрокаТовары.ДатаОтгрузки > СтрокаОбеспечения.ДатаОтгрузки Тогда
			Если СтрокаОбеспечения.Отгружено = 0 Тогда
				ТекСтрокаТовары.ДатаОтгрузки = Макс(Дата(1,1,1), ДатаПоУмолчанию);
			КонецЕсли;	
		Иначе 
			Если СтрокаОбеспечения.Отгружено = 0 Тогда
				ТекСтрокаТовары.ДатаОтгрузки = Макс(СтрокаОбеспечения.ДатаОтгрузки, ДатаПоУмолчанию);
			КонецЕсли;	
		КонецЕсли;
		// - [Rineco], [Киселев А.Н.] [10.08.2021]
		
		
	КонецЦикла;

КонецПроцедуры
