
&НаСервере
Процедура Рин1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++Шерстюк Ю.Ю. Задача 7625 договор и ответственный по менеджеру договора
	Если РольДоступна("Рин1_РедактированиеРеализации") или РольДоступна("ПолныеПрава") Тогда	
		Элементы.Ответственный.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;

	Иначе
		Элементы.Ответственный.ТолькоПросмотр = Истина;
        Элементы.Подразделение.ТолькоПросмотр = Истина;
	КонецЕсли;

	//--Шерстюк Ю.Ю.

КонецПроцедуры
