
&После("ДобавитьКомандыОтчетов")
Процедура Рин1_ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры)
	Отчеты.РИНЭКО_СредняяСебестоимостьТМЦ.ДобавитьКомандуОтчета(КомандыОтчетов);
	// + [Rineco], [Киселев А.Н.] [11.10.2021] 
	// Задача: [№ 19719], [#Дерево себестоимости ОУП]
	Отчеты.ДеревоСебестоимостиПродукцииРИНЭКО.ДобавитьКомандуОтчета(КомандыОтчетов);
	// - [Rineco], [Киселев А.Н.] [11.10.2021]
	
КонецПроцедуры

// + [Rineco], [Киселев А.] [07.12.2021] [Log_Diff][№ 23417], [#Создание резервов] 
&После("ДобавитьКомандыСозданияНаОсновании")
Процедура Рин1_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)
	Документы.Рин1_КорректировкаРезервовТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
КонецПроцедуры
