
&После("ОбработкаПроверкиЗаполнения")
Процедура Рин1_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Желаемая дата обеспечения в подвале должна быть заполнена
	Если не ЗначениеЗаполнено(ЖелаемаяДатаОбеспечения) Тогда
		
		ТекстОшибки = НСтр("ru='Желаемая дата обеспечения должна быть заполнена!'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ЖелаемаяДатаОбеспечения",
		,
		Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
