Функция СведенияОВнешнейОбработке() Экспорт
	
		ПараметрыРегистрации = Новый Структура; 
		МассивНазначений = Новый Массив; 
		ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка"); 
		ПараметрыРегистрации.Вставить("Назначение", МассивНазначений); 
		ПараметрыРегистрации.Вставить("Наименование", "Регистрация оригиналов документов"); 
		ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь); 
		ПараметрыРегистрации.Вставить("Версия", "1.0"); 
		ПараметрыРегистрации.Вставить("Информация", "Регистрация оригиналов документов"); 
		ТаблицаКоманд = ПолучитьТаблицуКоманд(); 
		ДобавитьКоманду(ТаблицаКоманд, 
		"Регистрация оригиналов документов", 
		"РегистрацияОригиналовДокументов", 
		"ОткрытиеФормы", Ложь,"");//Модификатор 
		ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд); 
	Возврат ПараметрыРегистрации; 
	
КонецФункции 

Функция ПолучитьТаблицуКоманд() 

	Команды = Новый ТаблицаЗначений; 
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево")); 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка")); 

Возврат Команды; 


КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "") 


	НоваяКоманда = ТаблицаКоманд.Добавить(); 
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор; 
	НоваяКоманда.Использование = Использование; 
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение; 
	НоваяКоманда.Модификатор = Модификатор; 


КонецПроцедуры   




