Функция СрокПоставкиНоменклатуры(СкладПоставщика,Номенклатура,Характеристика = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СрокПоставки КАК СрокПоставки
	               |ИЗ
	               |	РегистрСведений.ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства КАК ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства
	               |ГДЕ
	               |	ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Номенклатура = &Номенклатура
	               |	И ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Характеристика = &Характеристика
	               |	И ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СкладПоставщика = &СкладПоставщика";
	Запрос.УстановитьПараметр("СкладПоставщика",СкладПоставщика);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",?(ЗначениеЗаполнено(Характеристика),Характеристика,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Сроки = Результат.Выгрузить()[0];
		
		СтруктураВозврат = Новый Структура("СрокПоставкиМин,СрокПоставкиМакс",Сроки.СрокПоставки,Сроки.СрокПоставки);
		
		Возврат СтруктураВозврат;
	КонецЕсли;	
	
	
КонецФункции


