// + [Rineco], [Киселев А.] [22.12.2021] [Log_Diff][№ 24459], [#Функция в диспетчировании этапов] 
&НаКлиенте
Процедура Рин1_СводноеЗаданиеПосле(Команда)
	
	МассивВыделенныхСсылок = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	
	Если Не ЗначениеЗаполнено(МассивВыделенныхСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивЭтапов",МассивВыделенныхСсылок);
	
	ОткрытьФорму("Документ.ЭтапПроизводства2_2.Форма.Рин1_ФормаВыбораСтатейКалькуляции",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// + [Rineco], [Киселев А.] [22.12.2021] [Log_Diff][№ 24459], [#Функция в диспетчировании этапов] 
&НаКлиенте
Процедура Рин1_АнализМатериаловПосле(Команда)
	
	МассивВыделенныхСсылок = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	
	Если Не ЗначениеЗаполнено(МассивВыделенныхСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивЭтапов",МассивВыделенныхСсылок);
	ПараметрыФормы.Вставить("ДляАнализа","");
	ОткрытьФорму("Документ.ЭтапПроизводства2_2.Форма.Рин1_ФормаВыбораСтатейКалькуляции",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

