
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ОтборСклад;
	Перем ОтборНоменклатура;
	Перем ОтборХарактеристика;
	Перем ЕдИзмНаименование;
	
	Если ЭтаФорма.Параметры.Свойство("Склад",ОтборСклад) 
		И ЭтаФорма.Параметры.Свойство("Номенклатура",ОтборНоменклатура)  Тогда
		
		ЭтаФорма.Заголовок = "Выбор схемы обеспечения для склада "+Строка(ОтборСклад);

		
		Склады = Новый Массив();
		Склады.Добавить(ОтборСклад);
	
		Если ЭтаФорма.Параметры.Свойство("Характеристика",ОтборХарактеристика) Тогда
			
			ДоступноеОбеспечение = ГИГ_МодульВызовСервера.ЦенаПродажиИОстаткиТовара_Обеспечение(ОтборНоменклатура, 
			ОтборХарактеристика, Неопределено, Неопределено, Склады, Неопределено);
			
		Иначе
			ДоступноеОбеспечение = ГИГ_МодульВызовСервера.ЦенаПродажиИОстаткиТовара_Обеспечение(ОтборНоменклатура, 
			Неопределено, Неопределено, Неопределено, Склады, Неопределено);
			
		КонецЕсли;
		
		Если НЕ ДоступноеОбеспечение.ТекущиеОстатки.Количество() Тогда				
			Элементы.ФормаВыбрать.Доступность = Ложь;
		Иначе
			Для Каждого СтрокаТбл Из ДоступноеОбеспечение.ТекущиеОстатки Цикл
				СтрокаОстаткиПоСкладам = ДоступныеСхемы.Добавить();
				СтрокаОстаткиПоСкладам.Период = СтрокаТбл.Период;
				СтрокаОстаткиПоСкладам.СхемаОбеспечения = СтрокаТбл.СхемаОбеспечения;
				СтрокаОстаткиПоСкладам.СхемаОбеспеченияОписание = Строка(СтрокаТбл.СхемаОбеспечения);
				ОписаниеКоличества = Формат(СтрокаТбл.Доступно,"ЧДЦ=3");
				СтрокаОстаткиПоСкладам.ДоступноОписание = ?(СтрокаТбл.Доступно=0,Символ(8734),ОписаниеКоличества);	
				СтрокаОстаткиПоСкладам.СрокОбеспеченияОписание = ?(СтрокаТбл.СрокОбеспеченияМин = СтрокаТбл.СрокОбеспеченияМакс,"",Строка(СтрокаТбл.СрокОбеспеченияМин)+" - ")+Строка(СтрокаТбл.СрокОбеспеченияМакс) + " дн."; 
				СтрокаОстаткиПоСкладам.Приоритет = СтрокаТбл.СхемаОбеспечения.ГИГ_Приоритет;
				ДоступныеСхемы.Сортировать("Период Возр"); 
			КонецЦикла; 
		КонецЕсли;
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная форма предназначена только для выбора схемы в документах продаж.",,,,Отказ);	

	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьТекущееЗначение();
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеСхемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьТекущееЗначение();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТекущееЗначение()
	ОповеститьОВыборе(Элементы.ДоступныеСхемы.ТекущиеДанные.СхемаОбеспечения);
КонецПроцедуры

&НаКлиенте
Процедура Сортировка(Команда)
	
	ИмяКолонки = СтрЗаменить(Элементы.ДоступныеСхемы.ТекущийЭлемент.Имя, "ДоступныеСхемы", "");
	Если ИмяКолонки = "Приоритет" Тогда
		ДоступныеСхемы.Сортировать(ИмяКолонки + " " + Команда.Имя);
	ИначеЕсли ИмяКолонки = "СрокОбеспеченияОписание" Тогда  
		ДоступныеСхемы.Сортировать("Период" + " " + Команда.Имя);
	КонецЕсли;
	
КонецПроцедуры
