
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ТИП = ПредопределенноеЗначение("Перечисление.Рин1_ТипСвойства.A") Тогда      //список
		Элементы.Группа3.Видимость  = Истина;
		Элементы.Группа2.Видимость  = Ложь;
	ИначеЕсли Объект.ТИП = ПредопределенноеЗначение("Перечисление.Рин1_ТипСвойства.L") Тогда //булево
		Элементы.Группа3.Видимость  = Ложь;
		Элементы.Value_N.Видимость  = Ложь;
        Элементы.Группа5.Видимость  = Ложь;
		Элементы.Value_L.Видимость  = Истина;
		Элементы.ЕдиницаИзмерения.Видимость = Ложь;
	ИначеЕсли Объект.ТИП = ПредопределенноеЗначение("Перечисление.Рин1_ТипСвойства.N") Тогда //число
		Элементы.Группа3.Видимость  = Ложь;
		Элементы.Value_N.Видимость  = Истина;
        Элементы.Группа5.Видимость  = Ложь;
		Элементы.Value_L.Видимость  = Ложь;
		Элементы.ЕдиницаИзмерения.Видимость = Истина;
	ИначеЕсли Объект.ТИП = ПредопределенноеЗначение("Перечисление.Рин1_ТипСвойства.R") Тогда //число-диапазон
		Элементы.Группа3.Видимость  = Ложь;
		Элементы.Value_N.Видимость  = Ложь;
        Элементы.Группа5.Видимость  = Истина;
		Элементы.Value_L.Видимость  = Ложь;
		Элементы.ЕдиницаИзмерения.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
