
&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьКомментарий();
	ЭтаФорма.Закрыть();
	Оповестить("ПриЗакрытииВводаКомметария");
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарий()
	пЗаписьРегистра = Новый Структура;
	пЗаписьУдалена = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	ДатыЗапретаИзмененияСлужебный.ПропуститьПроверкуЗапретаИзменения(Истина);
	НаборЗаписей = РегистрыСведений.СтатусыПроверкиДокументов.СоздатьМенеджерЗаписи();
	НаборЗаписей.Организация =  Объект.Ссылка.Организация;
	НаборЗаписей.Документ = Объект.Ссылка;
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.СтатусПроверки = Перечисления.ЭтапыПроверкиДокументаВРеглУчете.Проверен Тогда 
		 пЗаписьРегистра.Вставить("Организация",НаборЗаписей.Организация);
		 пЗаписьРегистра.Вставить("Документ",НаборЗаписей.Документ);
		 пЗаписьРегистра.Вставить("СтатусПроверки",НаборЗаписей.СтатусПроверки);
		 пЗаписьРегистра.Вставить("Проверил",НаборЗаписей.Проверил);
		 пЗаписьРегистра.Вставить("ДатаПроверки",НаборЗаписей.ДатаПроверки);
		 пЗаписьРегистра.Вставить("Изменил",НаборЗаписей.Изменил);
		 пЗаписьРегистра.Вставить("ДатаИзменения",НаборЗаписей.ДатаИзменения);
		 НаборЗаписей.Удалить();
		 пЗаписьУдалена = Истина;
	КонецЕсли;
	
	пОбъект = Объект.Ссылка.ПолучитьОбъект();
	пОбъект.Комментарий = Объект.Комментарий;
	
	пОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если пЗаписьУдалена Тогда 
		НаборЗаписей = РегистрыСведений.СтатусыПроверкиДокументов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НаборЗаписей,пЗаписьРегистра);
		НаборЗаписей.Записать();
	КонецЕсли; 	
	
	ДатыЗапретаИзмененияСлужебный.ПропуститьПроверкуЗапретаИзменения(Ложь);
    УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(Объект,Параметры);
КонецПроцедуры
