
&Вместо("ПриСозданииНаСервере")
Процедура Рин1_ПриСозданииНаСервере(Форма, МестоРазмещенияКоманд, ПараметрыОповещения)
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСервис1СДоставка")
		И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСервис1СКурьер") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоРаботыССервисомДоставки() Тогда
		Возврат;
	КонецЕсли;
	
	// Делаем видимой отдельную группу с доставкой
	ЭлементУправления = Форма.Элементы.Найти("ГруппаСервисДоставки");
	Если ЭлементУправления <> Неопределено Тогда
		ЭлементУправления.Видимость = Истина;
		// + [Rineco], [Киселев А.Н.] [15.10.2021] 
		// Задача: [№ 20209], [# Работа с API перевозчиков]
		МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы,".");
		Если МассивСлов[1] = "ЗаказПоставщику" Тогда
		ИначеЕсли МассивСлов[1] = "ЗаказКлиента" Тогда
		КонецЕсли;
		// - [Rineco], [Киселев А.Н.] [15.10.2021]	
	КонецЕсли;
КонецПроцедуры
