
&НаКлиенте
Процедура ВыборПериодаВариантПриИзменении(Элемент)
	ИзменитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаПриИзменении(Элемент)
	ИзменитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериод()
	ДатаНачало=НачалоДня(ВыборПериода.ДатаНачала);
	ДатаОкончание=КонецДня(ВыборПериода.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	//Если ДатаНачало = Дата(1,1,1) и ДатаОкончание = Дата(1,1,1) Тогда
	//    Сообщить("Введите интервал дат!");
	//КонецЕсли;
	//
	//Если ДатаОкончание = Дата(1,1,1)  Тогда
	//    ДатаОкончание = ТекущаяДата();
	//КонецЕсли;
	//
	//Если ДатаНачало > ДатаОкончание Тогда
	//	Сообщить("Дата начала не может быть больше даты окончания!");
	//КонецЕсли;
	//
	//Если ДатаНачало < ТекущаяДата()  Тогда
	//	ДатаНачало = ТекущаяДата();
	//КонецЕсли;
	//
	//Если ДатаОкончание < ТекущаяДата()  Тогда
	//	ДатаОкончание = ТекущаяДата();
	//КонецЕсли;
	
	Если Мин > Макс Тогда
		Состояние("Значение `МИН` не может быть больше `МАКС`!");
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(Новый Структура("Мин,Макс",Мин,Макс));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Мин = Параметры.Мин;
	Макс = Параметры.Макс;
	
КонецПроцедуры
