
&НаКлиенте
Процедура Выбрать(Команда)
	ЗакрытьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Если Элементы.СписокПользователейДС.ВыделенныеСтроки.Количество() = 0 Тогда
		Сообщить("Не выбран пользователь");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Элементы.СписокПользователейДС.ТекущиеДанные.Пользователь);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейДСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьФорму();
КонецПроцедуры
