
&НаСервере
Процедура Рин1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	МестоВСтруктуреПредприятия = Неопределено;
	Если Параметры.Свойство("МестоВСтруктуреПредприятия", МестоВСтруктуреПредприятия) Тогда
		
		Если МестоВСтруктуреПредприятия = Истина Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"МестоВСтруктуреПредприятия",
			,
			ВидСравненияКомпоновкиДанных.Заполнено,
			,
			Истина);
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры
