
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПредметРасчета") И ЗначениеЗаполнено(Параметры.ПредметРасчета) Тогда
		ПредметРасчета = Параметры.ПредметРасчета;
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрРасчета") И ЗначениеЗаполнено(Параметры.ПараметрРасчета) Тогда
		ПараметрРасчета = Параметры.ПараметрРасчета;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Параметры.ПараметрРасчета, ВидСравненияКомпоновкиДанных.Равно, "Владелец", Истина);
	КонецЕсли;
	
КонецПроцедуры
