// Формирует строку сообщения по кратности партии
Функция ПолучитьТекстОстаткиКратностьПартии(СтрокаСводно) Экспорт
	
	Шаблон = НСтр("ru = 'Отгрузка товара ""%1"" должна производиться кратно: %2 / Доступный остаток: %3 / Не кратный остаток от деления: %4 (в заказе) > %5 (доступно)'");
	
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Шаблон,
		СтрокаСводно.Номенклатура,
		Формат(СтрокаСводно.КратностьПартии,   "ЧЦ=15; ЧДЦ=3; ЧН=0,000"),
		Формат(СтрокаСводно.СвободныйОстаток,  "ЧЦ=15; ЧДЦ=3; ЧН=0,000"),
		Формат(СтрокаСводно.КратностьЗаказу,   "ЧЦ=15; ЧДЦ=3; ЧН=0,000"),
		Формат(СтрокаСводно.КратностьОстаткам, "ЧЦ=15; ЧДЦ=3; ЧН=0,000"));
		
	Возврат Результат;
	
КонецФункции
