

&После("ПередЗаписью")
Процедура Рин1_ПередЗаписью(Отказ)
	//++Шерстюк Ю.Ю. 01.07.2021	Задача 9765 при заполнении из помощника создания нового не заполняется регион и страна, исправляем в модуле, чтобы при любой записи работало
	тчКонтактнаяИнформация = ЭтотОбъект.КонтактнаяИнформация; 
	пТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Для Каждого СтрКонтакты из тчКонтактнаяИнформация Цикл 
		Если СтрКонтакты.Тип = пТипКонтактнойИнформации и (СтрКонтакты.Регион = "" или  СтрКонтакты.Страна = "") Тогда 
			ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(СтрКонтакты.Значение,пТипКонтактнойИнформации);
			СтрКонтакты.Страна = ОбъектКИ.Country;
			СтрКонтакты.Город = ОбъектКИ.City;
		КонецЕсли;
	КонецЦикла;	
	//--Шерстюк Ю.Ю.
КонецПроцедуры

