
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗ_Товары = ПолучитьИзВременногоХранилища(параметры.АдресТЗ_Товары);
	
	Для каждого Строка Из ТЗ_Товары Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоНовоеПриИзменении(Элемент)
	
	ТекущаяСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	Если ТекущаяСтрока.КоличествоНовое > ТекущаяСтрока.Количество Тогда
		ТекущаяСтрока.КоличествоНовое = 0;
		Сообщить("Новое количество не может быть больше количества в текущем заказе!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйЗаказ(Команда)
	
	Если Товары.Итог("КоличествоНовое") = 0 Тогда
		
		ОчиститьСообщения();
		Состояние("Новое количество в табличной части не установлено. Заказ создан не будет!");
		Задержка();
		Закрыть();	
		
	Иначе
		
		Закрыть(ТоварыВХранилище());
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТоварыВХранилище()

	ТЗ = ДанныеФормыВЗначение(Товары,тип("ТаблицаЗначений"));
	Возврат(ПоместитьВоВременноеХранилище(ТЗ));

КонецФункции // ТоварыВХранилище()

&НаСервере
Процедура Задержка()
	
	ОбщегоНазначенияБТС.Пауза(2);	
	
КонецПроцедуры // Задержка()

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыКоличествоПодобрать" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено или ТекущиеДанные.Отменено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.КоличествоНовое = ТекущиеДанные.Количество;
			
	КонецЕсли;
	
КонецПроцедуры

	
