
&Вместо("ПередЗаписью")
Процедура Рин1_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
//--Шерстюк Ю.Ю. 13.01.21 обходим проблему с доступом к документу, если включены группы доступа по партнерам, пользователь с ограниченными правами не может записать, пока на закладке основное не будет заполнен партнер	
	Если ВидПлана.ЗаполнятьПартнераВТЧ и Товары.Количество() = 0 Тогда
		Сообщить("Документ не может быть сохранен, т.к. не заполнено значение реквизита Партнер");
		Отказ = Истина;
	КонецЕсли;
//--Шерстюк Ю.Ю. 13.01.21
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если Замещающий Тогда
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗамещениеПланов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ВидПлана", ВидПлана);
		Блокировка.Заблокировать();
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Планирование.ПроверитьСтатусУтвержден(ЭтотОбъект, Отказ, РежимЗаписи, Перечисления.ТипыПланов.ПланПродаж);

	СуммаДокумента = 0;

	Для каждого СтрокаТЧ Из Товары Цикл
		Если ПланироватьПоСумме Тогда

			Если Не СтрокаТЧ.Отменено Тогда

				СуммаДокумента = СуммаДокумента + СтрокаТЧ.Сумма;

			КонецЕсли; 

		Иначе

			СтрокаТЧ.Цена = 0;
			СтрокаТЧ.Сумма = 0;

		КонецЕсли; 
        //++Шерстюк Ю.Ю. 13.01.21
		//Если ЗначениеЗаполнено(Партнер) Тогда
		//	СтрокаТЧ.Партнер = Партнер;
		//КонецЕсли; 

		//Если ЗначениеЗаполнено(Соглашение) Тогда
		//	СтрокаТЧ.Соглашение = Соглашение;
		//КонецЕсли; 
		Если ЗначениеЗаполнено(Партнер) и Не ВидПлана.ЗаполнятьПартнераВТЧ Тогда
			СтрокаТЧ.Партнер = Партнер;
		ИначеЕсли ВидПлана.ЗаполнятьПартнераВТЧ и Не ЗначениеЗаполнено(Партнер) Тогда 
			Если ЗначениеЗаполнено(СтрокаТЧ.Партнер) Тогда 
				Партнер = СтрокаТЧ.Партнер;
			Иначе
				Сообщить("Документ не может быть сохранен, т.к. не заполнено значение реквизита Партнер");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли; 

		Если ЗначениеЗаполнено(Соглашение) и Не ВидПлана.ЗаполнятьПартнераВТЧ Тогда
			СтрокаТЧ.Соглашение = Соглашение;
		КонецЕсли; 
		//--Шерстюк Ю.Ю.
		
		Если ЗначениеЗаполнено(Склад) Тогда
			СтрокаТЧ.Склад = Склад;
		КонецЕсли;


	КонецЦикла;

	Если НЕ ПланироватьПоСумме Тогда
		ЗаполнятьПланОплат = Ложь;
	КонецЕсли;
	Если НЕ ЗаполнятьПланОплат Тогда

		ПланОплаты.Очистить();

	КонецЕсли; 

	//++ НЕ УТ
	Если НЕ ОтражаетсяВБюджетировании Тогда
		СтатьяБюджетов = Неопределено;
	КонецЕсли;

	Если НЕ ОтражаетсяВБюджетированииОплаты Тогда
		СтатьяБюджетовОплат = Неопределено;
	КонецЕсли;

	Если НЕ ОтражаетсяВБюджетированииОплатыКредит Тогда
		СтатьяБюджетовОплатКредит = Неопределено;
	КонецЕсли;

	Если НЕ ОтражаетсяВБюджетировании И НЕ ОтражаетсяВБюджетированииОплаты Тогда
		СценарийБюджетирования = Неопределено;
	КонецЕсли;
	//-- НЕ УТ

	Если Замещающий 
		И Не ЭтоНовый()
		И Не Отказ Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбновитьЗамещениеПлана(РежимЗаписи);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Если Не Замещающий
		И Не ЭтоНовый()
		И Не Отказ
		И Планирование.ЕстьЗамещениеПлана(Ссылка) Тогда
		НаборЗаписей = РегистрыСведений.ЗамещениеПланов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗамещенныйПлан.Установить(Ссылка);

		НаборЗаписей.Записать();
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры
