
&НаКлиенте
Процедура Рин1_ЗагрузитьИзФайлаВместо(Команда)
	// Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяТЧ", "Зарплата");
	ДокументОбъект = ЭтотОбъект.Объект;
	
	ПараметрыФормы.Вставить("Ведомость1", ДокументОбъект);
	ПараметрыФормы.Вставить("ВедомостьМодифицирована", Модифицированность);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	
	ОткрытьФорму(
		"Обработка.Рин1_ЗагрузкаДанныхИзВнешнихФайловСотрудники.Форма.Форма",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор,,,Новый ОписаниеОповещения("ВыполнитьПослеОкончания2", ЭтотОбъект, ДополнительныеПараметры));
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания2(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 

	//ПоказатьЗначение(,РазделитьЗаказ_СоздатьНовый(РезультатЗакрытия));
	Если Не ЭтаФорма.Модифицированность Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;
	//Форма = ДополнительныеПараметры.Форма;
	//Форма.ОбновитьОтображениеДанных();
КонецПроцедуры
