
&НаКлиенте
Процедура ВвестиЗначения(Команда)
	
	Если ЗаказНач > ЗаказКон или ОжидаетсяНач > ОжидаетсяКон или СкладПоставщика1Нач > СкладПоставщика1Кон или СкладПоставщика2Нач > СкладПоставщика2Кон или ЗаказНач > ЗаказКон  Тогда
		Сообщить("Начальная дата интервала не может быть больше конечной!");
		Возврат;
	КонецЕсли;
	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЗаказКон",ЗаказКон);
	СтруктураВозврата.Вставить("ЗаказНач",ЗаказНач);
	СтруктураВозврата.Вставить("ОжидаетсяКон",ОжидаетсяКон);
	СтруктураВозврата.Вставить("ОжидаетсяНач",ОжидаетсяНач);
	СтруктураВозврата.Вставить("СкладПоставщика1Кон",СкладПоставщика1Кон);
	СтруктураВозврата.Вставить("СкладПоставщика1Нач",СкладПоставщика1Нач);
	СтруктураВозврата.Вставить("СкладПоставщика2Кон",СкладПоставщика2Кон);
	СтруктураВозврата.Вставить("СкладПоставщика2Нач",СкладПоставщика2Нач);
	
	СтруктураВозврата.Вставить("Действие",Элементы.ВвестиЗначения.Заголовок);
	
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВвестиЗначения.Заголовок = Параметры.ЗаголовокКнопки;
	Заголовок = Параметры.ЗаголовокФормы;
	
КонецПроцедуры
