
Процедура ПередЗаписью(Отказ)
	Для Каждого ТекСтрока Из ЭтапыПроизводства Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ДлительностьЭтапа) И Не ЗначениеЗаполнено(ТекСтрока.ЕдиницаИзмеренияДлительностиЭтапа) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнена единица измерения длительности этапа в строке №"+ТекСтрока.НомерСтроки;
			Сообщение.Поле = "ЭтапыПроизводства["+(ТекСтрока.НомерСтроки-1)+"].ЕдиницаИзмеренияДлительностиЭтапа";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
