
&НаКлиенте
Процедура Рин1_ЗагрузитьИзВнешнегоФайлаМатериалыРаботыВместо(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяТЧ", "МатериалыИУслуги");
	ОткрытьФорму(
		"Обработка.ГИГ_ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма",
	ПараметрыФормы,
	ЭтаФорма,
	УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Рин1_ЗагрузитьИзВнешнегоФайлаВозвратныеОтходыВместо(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяТЧ", "ВозвратныеОтходы");
	ОткрытьФорму(
		"Обработка.ГИГ_ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма",
	ПараметрыФормы,
	ЭтаФорма,
	УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище,ИмяТЧ)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		СтрокаТЧТовары = Объект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров,,"НомерСтроки");		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рин1_ОбработкаВыбораВместо(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора <> Неопределено 
		И ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") 
		И ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ВводДолиСтоимости" Тогда
		
		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		ОбработкаВводаДолиСтоимости(ТекущийЭлемент, ТекущиеДанные, ВыбранноеЗначение);
		
		//++ НЕ УТКА
	ИначеЕсли ИсточникВыбора <> Неопределено 
		И ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") 
		И ИсточникВыбора.ИмяФормы = "ОбщаяФорма.НастройкаАвтовыбораНоменклатуры" Тогда
		
		ОбработкаВыбораНастройкаАвтовыбораНоменклатуры(ИсточникВыбора.ИмяТЧ, ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора <> Неопределено 
		И ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") 
		И ИсточникВыбора.ИмяФормы = "ОбщаяФорма.НастройкаОтбораПоСвойствамИРасчетаПоФормулам" Тогда
		
		ОбработкаВыбораНастройкаОтбораПоСвойствамИРасчетаПоФормулам(ИсточникВыбора.ИмяТЧ, ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора <> Неопределено
		И ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И (ИсточникВыбора.ИмяФормы = "Справочник.РесурсныеСпецификации.Форма.ФормаВыбораСпособаПолученияМатериала") Тогда
		
		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		ОбработкаВыбораСпособаПолученияМатериала(ТекущиеДанные, ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора <> Неопределено
		И ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И (ИсточникВыбора.ИмяФормы = "Справочник.РесурсныеСпецификации.Форма.ФормаНастройкиПримененияМатериала") Тогда
		
		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		ОбработкаВыбораНастройкиПримененияМатериала(ТекущиеДанные, ВыбранноеЗначение);
		//-- НЕ УТКА
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ГИГ_ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда
		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище,ВыбранноеЗначение.ИмяТЧ);
		
	Иначе
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Рин1_ПриОткрытииПосле(Отказ)
	
	// + [Rineco], [Киселев А.Н.] [27.10.2021] 
	// Задача: [№ 21165], [#Заполнение номенклатуры по владельцу]
	ЗаполнитьНоменклатуруПоВладельцу_ЗнП()
	// - [Rineco], [Киселев А.Н.] [27.10.2021]	
КонецПроцедуры

// + [Rineco], [Киселев А.Н.] [27.10.2021] 
// Задача: [№ 21165], [#Заполнение номенклатуры по владельцу]
&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоВладельцу_ЗнП()
	
	ПерваяГруппаФормы = ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(ЭтаФорма,"ВладелецФормы.Родитель");
	Если ПерваяГруппаФормы <> Неопределено Тогда
		
		Если ТипЗнч(ПерваяГруппаФормы) = Тип("ГруппаФормы") И ПерваяГруппаФормы.Имя = "ПродукцияГруппаСпецификация" Тогда
			
			ВтораяГруппаТаблица = ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(ПерваяГруппаФормы,"Родитель");
			
			Если ТипЗнч(ВтораяГруппаТаблица) = Тип("ТаблицаФормы") И ВтораяГруппаТаблица.Имя = "Продукция" Тогда
				
				ТекущиеДанные = ВтораяГруппаТаблица.ТекущиеДанные;
				
				Если ТекущиеДанные <> Неопределено И ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(ТекущиеДанные,"Номенклатура") <> Неопределено Тогда
					
					Если ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(ТекущиеДанные,"Характеристика") <> Неопределено Тогда
						ХарактеристикаДляЗаполнения = ТекущиеДанные.Характеристика 
					КонецЕсли;
					
					НоменклатураДляЗаполнения = ТекущиеДанные.Номенклатура; 
					
					ФормаВладелец = ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(ВтораяГруппаТаблица,"Родитель.Родитель.Родитель");
					
					Если ФормаВладелец <> Неопределено И ТипЗнч(ФормаВладелец) = Тип("ФормаКлиентскогоПриложения") Тогда
						
						МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФормаВладелец.ИмяФормы,".");
						
						Если МассивСлов.Количество() > 2 Тогда
							
							Если МассивСлов[1] = "ЗаказНаПроизводство2_2" Тогда
								ОсновноеИзделиеНоменклатура = НоменклатураДляЗаполнения; 
								
								Если ЗначениеЗаполнено(ХарактеристикаДляЗаполнения) Тогда
									ОсновноеИзделиеХарактеристика = ХарактеристикаДляЗаполнения;
								КонецЕсли;
								ОсновноеИзделиеНоменклатураПриИзмененииНаСервере(КэшированныеЗначения);
							КонецЕсли;
							
						КонецЕсли;
							
					КонецЕсли;
						
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры