//20200730 ГлазуновДВ отключили выбор ответственного по складу По последнему найденному в документе, оставили только по заполненному "МОЛ"
&Вместо("ПолучитьОтветственногоПоСкладу")
Функция Рин1_ПолучитьОтветственногоПоСкладу(Склад, Менеджер)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(Склад, Менеджер);
	//Возврат Результат;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ Справочники.Склады.ЭтоГруппа(Склад) Тогда
		СтруктураОтветственного = ЗначениеНастроекПовтИсп.ПолучитьОтветственногоПоСкладу(Склад);
		Если СтруктураОтветственного <> Неопределено Тогда
			Возврат СтруктураОтветственного;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
