Функция СформироватьТаблицуРасхождений(ПараметрыРасхождений) Экспорт
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ТаблицаТекущиеДанные",ОбщегоНазначенияУТ.МассивВТаблицуЗначений(ПараметрыРасхождений.ТекущиеДанные));
	ПараметрыЗапроса.Вставить("Ссылка",ПараметрыРасхождений.Ссылка);
	ТаблицаРасхождения = ОбщегоНазначенияУТ.ЗапросВыполнитьВыгрузить(ТекстЗапросаПрототип(ОбщегоНазначения.ИмяТаблицыПоСсылке(ПараметрыРасхождений.Ссылка) + "." + ПараметрыРасхождений.ИмяТабличнойЧасти),ПараметрыЗапроса);
	
	Если ТаблицаРасхождения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Адрес = ПоместитьВоВременноеХранилище(ТаблицаРасхождения);
	
	Возврат Адрес 
	
КонецФункции


Функция СформироватьТаблицуДляЗаполнения(ДанныеДляЗаполнения,Ссылка,ИмяТабличнойЧасти) Экспорт 
	
	ТаблицаРезультат = Ссылка[ИмяТабличнойЧасти].ВыгрузитьКолонки();
	
	Для Каждого ЭлементДанныхЗаполнения Из ДанныеДляЗаполнения Цикл 
		
		Отбор = Новый Структура("Номенклатура",ЭлементДанныхЗаполнения.Номенклатура);
		
		НайденныеСтроки = Ссылка.Товары.НайтиСтроки(Отбор); 
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденныеСтроки[0]);
			ОбщегоНазначенияБЗККлиентСервер.УстановитьЗначениеСвойства(НоваяСтрока,"Количество",ЭлементДанныхЗаполнения.Разность);
			ОбщегоНазначенияБЗККлиентСервер.УстановитьЗначениеСвойства(НоваяСтрока,"КоличествоУпаковок",ЭлементДанныхЗаполнения.Разность);
			ОбщегоНазначенияБЗККлиентСервер.УстановитьЗначениеСвойства(НоваяСтрока,"КодСтроки","");
			ОбщегоНазначенияБЗККлиентСервер.УстановитьЗначениеСвойства(НоваяСтрока,"ПричинаОтмены",ЭлементДанныхЗаполнения.ПричинаОтмены);
			ОбщегоНазначенияБЗККлиентСервер.УстановитьЗначениеСвойства(НоваяСтрока,"Отменено",Истина);
			
		КонецЕсли;	
		
		
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультат);
	
КонецФункции


Функция ТекстЗапросаПрототип(СтрокаИсточника)			
	Возврат "ВЫБРАТЬ
	|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура КАК Номенклатура,
	|	ЗаказНаВнутреннееПотреблениеТовары.Характеристика КАК Характеристика,
	|	СУММА(ЕСТЬNULL(ЗаказНаВнутреннееПотреблениеТовары.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ ВТ_ПредыдущиеДанные
	|ИЗ
	|	" + СтрокаИсточника + " КАК ЗаказНаВнутреннееПотреблениеТовары
	|ГДЕ
	|	ЗаказНаВнутреннееПотреблениеТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура,
	|	ЗаказНаВнутреннееПотреблениеТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТекущиеДанные.Номенклатура КАК Номенклатура,
	|	ТаблицаТекущиеДанные.Характеристика КАК Характеристика,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаТекущиеДанные.Количество, 0) КАК ЧИСЛО(15, 3)) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТекущиеДанные
	|ИЗ
	|	&ТаблицаТекущиеДанные КАК ТаблицаТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущиеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ТекущиеДанные.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ТекущиеДанные.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТекущиеДанныеГруппировка
	|ИЗ
	|	ВТ_ТекущиеДанные КАК ВТ_ТекущиеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТекущиеДанные.Номенклатура,
	|	ВТ_ТекущиеДанные.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредыдущиеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ПредыдущиеДанные.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТ_ТекущиеДанныеГруппировка.Количество ЕСТЬ NULL
	|			ТОГДА ВТ_ПредыдущиеДанные.Количество
	|		ИНАЧЕ ВТ_ПредыдущиеДанные.Количество - ВТ_ТекущиеДанныеГруппировка.Количество
	|	КОНЕЦ КАК Разность,
	|	ВТ_ПредыдущиеДанные.Количество КАК КоличествоЗаписанное,
	|	ВТ_ТекущиеДанныеГруппировка.Количество КАК КоличествоИзмененное,
	|	ИСТИНА КАК Отметка,
	|	ВТ_ПредыдущиеДанные.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияЗаписанное,
	|	ВТ_ПредыдущиеДанные.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияИзмененное
	|ИЗ
	|	ВТ_ПредыдущиеДанные КАК ВТ_ПредыдущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеДанныеГруппировка КАК ВТ_ТекущиеДанныеГруппировка
	|		ПО ВТ_ПредыдущиеДанные.Номенклатура = ВТ_ТекущиеДанныеГруппировка.Номенклатура
	|			И ВТ_ПредыдущиеДанные.Характеристика = ВТ_ТекущиеДанныеГруппировка.Характеристика
	|ГДЕ
	|	(ВТ_ПредыдущиеДанные.Количество - ВТ_ТекущиеДанныеГруппировка.Количество > 0
	|			ИЛИ ВТ_ТекущиеДанныеГруппировка.Количество ЕСТЬ NULL)";
КонецФункции

Функция ТекстЗапросаТаблицы(СтрокаИсточника)
	Возврат "ВЫБРАТЬ
	        |	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура КАК Номенклатура,
	        |	ЗаказНаВнутреннееПотреблениеТовары.Характеристика КАК Характеристика,
	        |	СУММА(ЕСТЬNULL(ЗаказНаВнутреннееПотреблениеТовары.Количество, 0)) КАК Количество
	        |ПОМЕСТИТЬ ВТ_ПредыдущиеДанные
	        |ИЗ
	        |	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ЗаказНаВнутреннееПотреблениеТовары
	        |ГДЕ
	        |	ЗаказНаВнутреннееПотреблениеТовары.Ссылка = &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура,
	        |	ЗаказНаВнутреннееПотреблениеТовары.Характеристика
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаТекущиеДанные.Номенклатура КАК Номенклатура,
	        |	ТаблицаТекущиеДанные.Характеристика КАК Характеристика,
	        |	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаТекущиеДанные.Количество, 0) КАК ЧИСЛО(15, 3)) КАК Количество
	        |ПОМЕСТИТЬ ВТ_ТекущиеДанные
	        |ИЗ
	        |	&ТаблицаТекущиеДанные КАК ТаблицаТекущиеДанные
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТекущиеДанные.Номенклатура КАК Номенклатура,
	        |	ВТ_ТекущиеДанные.Характеристика КАК Характеристика,
	        |	СУММА(ВТ_ТекущиеДанные.Количество) КАК Количество
	        |ПОМЕСТИТЬ ВТ_ТекущиеДанныеГруппировка
	        |ИЗ
	        |	ВТ_ТекущиеДанные КАК ВТ_ТекущиеДанные
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ТекущиеДанные.Номенклатура,
	        |	ВТ_ТекущиеДанные.Характеристика
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПредыдущиеДанные.Номенклатура КАК Номенклатура,
	        |	ВТ_ПредыдущиеДанные.Характеристика КАК Характеристика,
	        |	ВЫБОР
	        |		КОГДА ВТ_ТекущиеДанныеГруппировка.Количество ЕСТЬ NULL
	        |			ТОГДА ВТ_ПредыдущиеДанные.Количество
	        |		ИНАЧЕ ВТ_ПредыдущиеДанные.Количество - ВТ_ТекущиеДанныеГруппировка.Количество
	        |	КОНЕЦ КАК Разность,
	        |	ВТ_ПредыдущиеДанные.Количество КАК КоличествоЗаписанное,
	        |	ВТ_ТекущиеДанныеГруппировка.Количество КАК КоличествоИзмененное,
	        |	ИСТИНА КАК Отметка,
	        |	ВТ_ПредыдущиеДанные.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияЗаписанное,
	        |	ВТ_ПредыдущиеДанные.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияИзмененное
	        |ИЗ
	        |	ВТ_ПредыдущиеДанные КАК ВТ_ПредыдущиеДанные
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеДанныеГруппировка КАК ВТ_ТекущиеДанныеГруппировка
	        |		ПО ВТ_ПредыдущиеДанные.Номенклатура = ВТ_ТекущиеДанныеГруппировка.Номенклатура
	        |			И ВТ_ПредыдущиеДанные.Характеристика = ВТ_ТекущиеДанныеГруппировка.Характеристика
	        |ГДЕ
	        |	(ВТ_ПредыдущиеДанные.Количество - ВТ_ТекущиеДанныеГруппировка.Количество > 0
	        |			ИЛИ ВТ_ТекущиеДанныеГруппировка.Количество ЕСТЬ NULL)";
КонецФункции