
&Вместо("ПолучитьПодсказкуПоКонтексту")
Функция Рин1_ПолучитьПодсказкуПоКонтексту(ДанныеКонтекста, Знач АдресРезультата, Знач АдресДополнительногоРезультата)
	Если Не БизнесСеть.ПравоЧтенияНастроекОбменаДокументами() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Организации = ДанныеКонтекста.Организации;
	
	Организация = Неопределено;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		Организация = Организации[0];
	КонецЕсли;
	
	ПоказыватьСсылкуДеактивации = Организация <> Неопределено ИЛИ ДанныеКонтекста.Основание <> Неопределено;
	
	Рекомендации = ТорговыеПредложенияСлужебный.РекомендацииСервиса(Организация, ПоказыватьСсылкуДеактивации);
	
	Рекомендация = СлучайнаяРекомендация(Рекомендации);
	// + [Rineco], [Шерстюк Ю.Ю.] [13.09.2021] 
	// Задача: [№ ], [#]
	//ПоместитьВоВременноеХранилище(Рекомендация.ДополнительныеПараметры.Номенклатура, АдресДополнительногоРезультата);
	//Рекомендация.ДополнительныеПараметры = "";
	ПоместитьВоВременноеХранилище(Справочники.Номенклатура.ПустаяСсылка(), АдресДополнительногоРезультата);
	// - [Rineco], [Шерстюк Ю.Ю.] [13.09.2021]
	
	
	
	ПоместитьВоВременноеХранилище(Рекомендация, АдресРезультата);

КонецФункции
