
&НаКлиенте
Процедура Рин1_ОбработкаВыбораВместо(ВыбранноеЗначение, ИсточникВыбора)
	
	//++Гольм А.А. (Гигабайт)
	//Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" или ИсточникВыбора.ИмяФормы = "Обработка.ГИГ_ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
	//--Гольм А.А. (Гигабайт)
		
		МассивТовары = ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
		Если МассивТовары.Количество() > 0 Тогда
			ОткрытьФормуИзмененияСтатуса(
				МассивТовары,
				ИсточникДействия,
				ПредопределенноеЗначение("Перечисление.СтатусыДействияСкидок.Действует"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
