
&НаСервере
Процедура Рин1_ПрограммноеДобавлениеЭлементовНаСервере()

	ИмяГруппы = "УсловияПересчетаТоваров";
	ГруппаФормы = Элементы.Найти(ИмяГруппы);
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Если ГруппаФормы <> Неопределено Тогда
		ИмяЭлемента = "Рин1_БлокироватьОтобранное";
		Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);
			ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
			ЭлементФормы.ПутьКДанным = "Объект.Рин1_БлокироватьОтобранное";
			ЭлементФормы.Заголовок = "Блокировать товар";
			ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			//ЭлементФормы.УстановитьДействие("ПриИзменении", "Рин1_БлокироватьОтобранноеПриИзменении");
		КонецЕсли;   
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Рин1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
//	Рин1_ПрограммноеДобавлениеЭлементовНаСервере();
	БлокировкаТовара = Объект.Рин1_БлокироватьОтобранное;
КонецПроцедуры

&НаКлиенте
Процедура Рин1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	ЗаписатьБлокировку();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьБлокировку()
	
	Объект.Рин1_БлокироватьОтобранное = БлокировкаТовара;

КонецПроцедуры
