
&После("ИнициализироватьДокумент")
Процедура Рин1_ИнициализироватьДокумент(ДанныеЗаполнения)
	//++Шерстюк Ю.Ю. Задача 7625
	Если ДокументыОснования.Количество() > 0 Тогда 
		пДоговорОснования = ДокументыОснования[0].ДокументОснование.Договор;
		Если ЗначениеЗаполнено(пДоговорОснования) Тогда 
			Ответственный = пДоговорОснования.Менеджер;
			Если ЗначениеЗаполнено(пДоговорОснования.Подразделение) Тогда 
				Подразделение = пДоговорОснования.Подразделение;
			Иначе 
				Подразделение = Ответственный.Подразделение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
    //--Шерстюк Ю.Ю.
КонецПроцедуры
