//{{20201028 ГлазуновДВ
&НаКлиентеНаСервереБезКонтекста
&Вместо("ПолучитьПараметры")
Функция Рин1_ПолучитьПараметры(Источник)
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ПечататьАктВыполненныхРабот",                   Источник.ПечататьАктВыполненныхРабот);
	СтруктураПараметров.Вставить("ПечататьЗаказКлиента",                          Источник.ПечататьЗаказКлиента);
	СтруктураПараметров.Вставить("ПечататьКоммерческоеПредложение",               Источник.ПечататьКоммерческоеПредложение);
	СтруктураПараметров.Вставить("ПечататьПриходныйКассовыйОрдер",                Источник.ПечататьПриходныйКассовыйОрдер);
	СтруктураПараметров.Вставить("ПечататьРеализациюТоваровУслуг",                Источник.ПечататьРеализациюТоваровУслуг);
	//++ НЕ УТ
	СтруктураПараметров.Вставить("ПечататьПередачуТоваровХранителю",              Источник.ПечататьПередачуТоваровХранителю);
	//-- НЕ УТ
	СтруктураПараметров.Вставить("ПечататьСчетНаОплату",                          Источник.ПечататьСчетНаОплату);
	СтруктураПараметров.Вставить("ПечататьСчетФактуру",                           Источник.ПечататьСчетФактуру);
	СтруктураПараметров.Вставить("СоздаватьДокументПродажи",                      Источник.СоздаватьДокументПродажи);
	СтруктураПараметров.Вставить("СоздаватьЗаказКлиента",                         Источник.СоздаватьЗаказКлиента);
	СтруктураПараметров.Вставить("СоздаватьКоммерческоеПредложение",              Источник.СоздаватьКоммерческоеПредложение);
	СтруктураПараметров.Вставить("СоздаватьПриходныйКассовыйОрдер",               Источник.СоздаватьПриходныйКассовыйОрдер);
	СтруктураПараметров.Вставить("СоздаватьСчетНаОплату",                         Источник.СоздаватьСчетНаОплату);
	СтруктураПараметров.Вставить("СтатусЗаказаКлиента",                           Источник.СтатусЗаказаКлиента);
	СтруктураПараметров.Вставить("СтатусКоммерческогоПредложения",                Источник.СтатусКоммерческогоПредложения);
	СтруктураПараметров.Вставить("СтатусРеализацииТоваровУслуг",                  Источник.СтатусРеализацииТоваровУслуг);
	//++ НЕ УТ
	СтруктураПараметров.Вставить("СоздаватьПередачуТоваровХранителю",             Источник.СоздаватьПередачуТоваровХранителю);
	//-- НЕ УТ
	СтруктураПараметров.Вставить("СоздаватьТранспортнуюНакладнуюПоУмолчанию",     Источник.СоздаватьТранспортнуюНакладнуюПоУмолчанию);
	СтруктураПараметров.Вставить("СоздаватьДоверенностьНаПолучениеДСПоУмолчанию", Источник.СоздаватьДоверенностьНаПолучениеДСПоУмолчанию);
	СтруктураПараметров.Вставить("ВариантОформленияДокументов",                   Источник.ВариантОформленияДокументов);
	
	СтруктураПараметров.Вставить("СоздаватьЗаявкуНаВозвратТоваровОтКлиентов",     Источник.СоздаватьЗаявкуНаВозвратТоваровОтКлиентов);
	СтруктураПараметров.Вставить("ПечататьЗаявкуНаВозвратТоваровОтКлиентов",      Источник.ПечататьЗаявкуНаВозвратТоваровОтКлиентов);
	СтруктураПараметров.Вставить("СтатусЗаявкиНаВозвратТоваровОтКлиентов",        Источник.СтатусЗаявкиНаВозвратТоваровОтКлиентов);
	СтруктураПараметров.Вставить("ЗаполнятьТоварыПоСоглашению",                   Источник.ЗаполнятьТоварыПоСоглашению);
	СтруктураПараметров.Вставить("ОтображатьРекомендацииКПокупке",                Источник.ОтображатьРекомендацииКПокупке);
	СтруктураПараметров.Вставить("СпособПрогнозированияПродаж",                   Источник.СпособПрогнозированияПродаж);
	СтруктураПараметров.Вставить("ПериодСбораСтатистики",                         Источник.ПериодСбораСтатистики);
	СтруктураПараметров.Вставить("УпрощенноеОбеспечение",                         Источник.УпрощенноеОбеспечение);
	СтруктураПараметров.Вставить("ВариантОбеспечения",                            Источник.ВариантОбеспечения);
	СтруктураПараметров.Вставить("НеЗадаватьВопросОбеспечение",                   Источник.НеЗадаватьВопросОбеспечение);
//{{20201028 ГлазуновДВ
	Если Источник.Рин1_ИспользоватьПредустановки Тогда
		СтруктураПараметров.Вставить("Организация",                                   Источник.Рин1_Организация);
		СтруктураПараметров.Вставить("Склад",                                         Источник.Рин1_Склад);
		СтруктураПараметров.Вставить("Партнер",                                       Источник.Рин1_Партнер);
		СтруктураПараметров.Вставить("Соглашение",                                    Источник.Рин1_Соглашение);
		СтруктураПараметров.Вставить("Контрагент",                                    Источник.Рин1_Контрагент);
		СтруктураПараметров.Вставить("Договор",                                       Источник.Рин1_Договор);
	КонецЕсли;
//}}20201028 ГлазуновДВ
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура Рин1_Рин1_ЗаполнитьПоДаннымФормыВместоНаСервере()
	// Вставить содержимое обработчика.
	Рин1_Организация	= Рин1_яОрганизацияФорма;
	Рин1_Склад			= Рин1_яСкладФорма;
	Рин1_Партнер		= Рин1_яПартнерФорма;
	Рин1_Соглашение		= Рин1_яСоглашениеФорма;
	Рин1_Контрагент		= Рин1_яКонтрагентФорма;
	Рин1_Договор		= Рин1_яДоговорФорма;
КонецПроцедуры

&НаКлиенте
Процедура Рин1_Рин1_ЗаполнитьПоДаннымФормыВместо(Команда)
	Рин1_Рин1_ЗаполнитьПоДаннымФормыВместоНаСервере();
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Рин1_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое метода.
	Рин1_яОрганизацияФорма		= Параметры.Рин1_яОрганизацияФорма;
	Рин1_яСкладФорма			= Параметры.Рин1_яСкладФорма;
	Рин1_яПартнерФорма			= Параметры.Рин1_яПартнерФорма;
	Рин1_яСоглашениеФорма		= Параметры.Рин1_яСоглашениеФорма;
	Рин1_яКонтрагентФорма		= Параметры.Рин1_яКонтрагентФорма;
	Рин1_яДоговорФорма			= Параметры.Рин1_яДоговорФорма;
КонецПроцедуры
//}}20201028 ГлазуновДВ
