// + [Rineco], [Киселев А.Н.] [22.09.2021] 
// Задача: [№ 17275], [#Заполнение ДДС]
&НаКлиенте
Процедура Рин1_ЗаполнитьСтатьюДДСПосле(Команда)
	
	Если Элементы.РасшифровкаПлатежа.ВыделенныеСтроки.Количество() = 0 Тогда
		Сообщить("Нет выделенных строк");
		Возврат;
	КонецЕсли;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборСтатьиДДСЗавершение",ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.РИНЭКО_ФормаВыбораСтатьиДДС",,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// + [Rineco], [Киселев А.Н.] [22.09.2021] 
// Задача: [№ 17275], [#Заполнение ДДС]
&НаКлиенте
Процедура ВыборСтатьиДДСЗавершение(Результат,Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ЭлементСтроки Из Элементы.РасшифровкаПлатежа.ВыделенныеСтроки Цикл 
		
		ТекущиеДанныеСтроки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ЭлементСтроки);
		ТекущиеДанныеСтроки.СтатьяДвиженияДенежныхСредств = Результат[0]; 
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры