
&НаСервере
&Перед("ПриСозданииНаСервере")
Процедура Рин1_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое метода.
	Если Параметры.Свойство("Документ") И ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Параметры.Отбор.Удалить("ВалютаВзаиморасчетов");
	
	//Валюта равна валюте документа	
		УсловноеОформлениеСписка = Список.УсловноеОформление;
		УсловноеОформлениеСписка.ИдентификаторПользовательскойНастройки = "ОсновноеОформление";
		
		ЭлементУсловногоОформления = УсловноеОформлениеСписка.Элементы.Добавить();
		ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВалютаВзаиморасчетов");
		ЭлементОтбораДанных.ПравоеЗначение = Параметры.ТекущаяВалюта;
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораДанных.Использование = Истина;
		
		//ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
		//ЭлементЦветаОформления.Значение =  Метаданные.ЭлементыСтиля.ВыполненнаяЗадача.Значение;
		//ЭлементЦветаОформления.Использование = Истина;
		//ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветФона");
		//ЭлементЦветаОформления.Значение =  ЦветаСтиля.ЦветАктивности;
		//ЭлементЦветаОформления.Использование = Истина;
		
	//Валюта другая, ПорядокРасчета только Накладные и Договора	
		ЭлементУсловногоОформления = УсловноеОформлениеСписка.Элементы.Добавить();
		ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВалютаВзаиморасчетов");
		//ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		//ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
		ЭлементОтбораДанных.ПравоеЗначение = Параметры.ТекущаяВалюта;
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбораДанных.Использование = Истина;
		
		ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПорядокРасчетов");
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораДанных.ПравоеЗначение = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
		ЭлементОтбораДанных.Использование = Истина;
		
		ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
		ЭлементЦветаОформления.Значение = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
		ЭлементЦветаОформления.Использование = Истина;
		//ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветФона");
		//ЭлементЦветаОформления.Значение =  ЦветаСтиля.СобытиеОтказ;
		//ЭлементЦветаОформления.Использование = Истина;
		//
	    ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	КонецЕсли;
КонецПроцедуры
