
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаЭлементовФормы();
	Настройки = РИНЭКО_НастройкиВызовСервера.ПолучитьНастройкуПоНаименованию("Настройка_АББ","1, 3,5");
	Настройки = РИНЭКО_НастройкиВызовСервера.ПолучитьНастройкуКоду("000000001","1, 3,5");
	Настройки = РИНЭКО_НастройкиВызовСервера.ПолучитьНастройкуТабличнойЧастиПоНаименованию("Настройка_АББ",1,"1, 3,5")

КонецПроцедуры


&НаСервере
Процедура НастройкаЭлементовФормы()
	
	Для Индекс = 1 По 10 Цикл
		Элементы["Реквизит"+Индекс].КнопкаОчистки = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Настройки = РИНЭКО_НастройкиВызовСервера.ПолучитьНастройкуПоНаименованию("Настройка_АББ","1");
	Настройки = РИНЭКО_НастройкиВызовСервера.ПолучитьНастройкуКоду("000000001","1, 3,5");
	Настройки = РИНЭКО_НастройкиВызовСервера.ПолучитьНастройкуТабличнойЧастиПоНаименованию("Настройка_АББ",1,"1, 3,5")


КонецПроцедуры


