
&Перед("ПередЗаписью")
Процедура Рин1_ПередЗаписью(Отказ)
	КоллекцияКонтактнойИнформации = КонтактнаяИнформация;
	
	ФактАдресЗаполнен = Ложь;
	ЮрАдресЗаполнен = Ложь;
	//++Шерстюк Ю.Ю. 23.03.2021 задача 6699 переносим из модуля формы в объект
	Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда 
		ФактАдресЗаполнен = Истина;
		ЮрАдресЗаполнен = Истина;
	КонецЕсли;
//{{20200826 ГлазуновДВ	
	//Если ВидКонтрагента = "ФизЛицо" тогда
	//	ФактАдресЗаполнен = Истина;
	//	ЮрАдресЗаполнен = Истина;
	//КонецЕсли;
//}}20200826 ГлазуновДВ	
   //--Шерстюк Ю.Ю.
	Для каждого ВидКонтактнойИнформации Из КоллекцияКонтактнойИнформации Цикл
		Если не ЗначениеЗаполнено(ВидКонтактнойИнформации.Представление) Тогда
			Продолжить;
		КонецЕсли;
		Если Строка(ВидКонтактнойИнформации.Вид) = "Фактический адрес" Тогда
			ФактАдресЗаполнен = Истина;
		КонецЕсли;
		Если Строка(ВидКонтактнойИнформации.Вид) = "Юридический адрес" Тогда
			ЮрАдресЗаполнен = Истина;
		КонецЕсли;
		
		//++Шерстюк Ю.Ю. 01.07.2021	Задача 9765 при заполнении из помощника создания нового не заполняется регион и страна, исправляем в модуле, чтобы при любой записи работало
		пТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Если ВидКонтактнойИнформации.Тип = пТипКонтактнойИнформации и (ВидКонтактнойИнформации.Регион = "" или  ВидКонтактнойИнформации.Страна = "") Тогда 
			ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(ВидКонтактнойИнформации.Значение,пТипКонтактнойИнформации);
			ВидКонтактнойИнформации.Страна = ОбъектКИ.Country;
			ВидКонтактнойИнформации.Регион = ОбъектКИ.Area;
			ВидКонтактнойИнформации.Город = ОбъектКИ.City;
		КонецЕсли;	
		//--Шерстюк Ю.Ю.
		
	КонецЦикла;
	
	Если не ФактАдресЗаполнен или не ЮрАдресЗаполнен Тогда
		
		ТекстСообщения1 = ?(ФактАдресЗаполнен,"","Фактический адрес контрагента обязателен для заполнения!");
		ТекстСообщения2 = ?(ЮрАдресЗаполнен,"","Юридический адрес контрагента обязателен для заполнения!");
		ТекстСообщения = ТекстСообщения1 + ?(ТекстСообщения1 = "" или ТекстСообщения2 = "","",Символы.ПС) + ТекстСообщения2;  
		
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
