
&Вместо("Сформировать")
Процедура Рин1_Сформировать(СегментСсылка)
	ПР = ПривилегированныйРежим();
	Если НЕ ПР Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	СписокЭлементов = СегментыСервер.СписокЭлементовСКД(СегментСсылка);
	ВключатьХарактеристики =
	СписокЭлементов.Колонки.Найти("ХарактеристикаЭлемента") <> Неопределено;
	
	Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сегмент.Установить(СегментСсылка);
		
		// + [Rineco], [Киселев А.Н.] [03.09.2021] 
		// Задача: [№ 14441], [#Объявление набора записей - не нужный функционал]
		//НаборЗаписейСегментыДата = РегистрыСведений.Рин1_СегментыНоменклатурыДата.СоздатьНаборЗаписей();
		//НаборЗаписейСегментыДата.Отбор.Сегмент.Установить(СегментСсылка);
		// - [Rineco], [Киселев А.Н.] [03.09.2021]
		
				
		Для Каждого Элемент Из СписокЭлементов Цикл
			Если НЕ ЗначениеЗаполнено(Элемент.ЭлементСписка) Тогда
				Продолжить;
			КонецЕсли;
			Запись = НаборЗаписей.Добавить();
			Запись.Сегмент = СегментСсылка;
			Запись.Номенклатура = Элемент.ЭлементСписка;
			Если ВключатьХарактеристики Тогда
				Запись.Характеристика = Элемент.ХарактеристикаЭлемента;
			КонецЕсли;
			
			// + [Rineco], [Киселев А.Н.] [03.09.2021] 
			// Задача: [№ 14441], [#Заполнение регистра сведений аналогично НоменклатураСегмента + Датане нужный функционал]
			
			//Если СегментСсылка = Справочники.СегментыНоменклатуры.НайтиПоКоду("00-00000015") Тогда
			//	
			//	Если НЕ ЗначениеЗаполнено(Элемент.ЭлементСписка) Тогда
			//		Продолжить;
			//	КонецЕсли;
			//	Запись = НаборЗаписейСегментыДата.Добавить();
			//	Запись.Сегмент = СегментСсылка;
			//	Запись.ДатаСегмента = ТекущаяДата();
			//	Запись.Номенклатура = Элемент.ЭлементСписка;
			//	Если ВключатьХарактеристики Тогда
			//		Запись.Характеристика = Элемент.ХарактеристикаЭлемента;
			//	КонецЕсли;
			//КонецЕсли;
			// - [Rineco], [Киселев А.Н.] [03.09.2021]
				
			КонецЦикла;			
		
	Иначе
		НаборЗаписей = РегистрыСведений.ПартнерыСегмента.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сегмент.Установить(СегментСсылка);
		Для Каждого Элемент Из СписокЭлементов Цикл
			Если НЕ ЗначениеЗаполнено(Элемент.ЭлементСписка) Тогда
				Продолжить;
			КонецЕсли;
			Запись = НаборЗаписей.Добавить();
			Запись.Сегмент = СегментСсылка;
			Запись.Партнер = Элемент.ЭлементСписка;
		КонецЦикла;
	КонецЕсли;
	
	// + [Rineco], [Киселев А.Н.] [03.09.2021] 
	// Задача: [№ 14441], [# Запись РС не нужный функционал]
	//НаборЗаписейСегментыДата.Записать();
	// - [Rineco], [Киселев А.Н.] [03.09.2021]
	
	
	НаборЗаписей.Записать();
	
	Если НЕ ПР Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

