
&НаКлиенте
Процедура ДобавитьВидРабот(Команда)
	Форма = ОткрытьФорму("Справочник.ВидыРаботСотрудников.ФормаВыбора",,ЭтаФорма,,,,Новый ОписаниеОповещения("ОбработатьВыборВидовРабот",ЭтотОбъект,Параметры),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Форма.Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборВидовРабот(Результат,Параметры) Экспорт 
	
	Если не Результат = Неопределено Тогда
		
		НоваяСтрока = ВидыРабот.Добавить();
		НоваяСтрока.НомерСтроки = ВидыРабот.Количество();
        НоваяСтрока.ВидРабот = Результат;
		
		//ТабличнаяЧастьТрудозатратыПустая = Объект.Трудозатраты.Количество() = 0;
		//НоваяСтрока = Объект.Трудозатраты.Добавить();
		//НоваяСтрока.ВидРабот = Результат;
		//НоваяСтрока.Количество = ПолучитьТрудоемкостьРаботПоВиду(Результат);
		//
		//Если ТабличнаяЧастьТрудозатратыПустая Тогда
		//	Рин1_ЗаполнитьТрудозатратыПоИсполнителюПосле(Неопределено);
		//КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры // ОбработатьВыборВидовРабот()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗ = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если не ТЗ = Неопределено Тогда
		ВидыРабот.Загрузить(ПолучитьИзВременногоХранилища(Параметры.Адрес));
	КонецЕсли;
	ОбщееКоличествоЧасов = Параметры.ВремяВыполнения/60;
	СверхурочнаяРабота = Параметры.Тсверхурочно/60;
	Тсверхурочно = Параметры.Тсверхурочно/60;
	
КонецПроцедуры

&НаКлиенте
Процедура СверхурочнаяРаботаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если Число(Текст) > СверхурочнаяРабота Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Тсверхурочно);
		СверхурочнаяРабота = Тсверхурочно;
		Сообщить("Менять можно только в меньшую сторону!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если ВидыРабот.Итог("Количество") + СверхурочнаяРабота > ОбщееКоличествоЧасов Тогда
	    Сообщить("Распределенное время на виды работ в табличной части, плюс сверхурочное время, не должны быть больше общего времени!");
	Иначе 
		ЭтаФорма.Закрыть(ПолучитьАдресВХранилице());
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресВХранилице()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ОбщееКоличествоЧасов",ОбщееКоличествоЧасов);
	СтруктураВозврата.Вставить("СверхурочнаяРабота",СверхурочнаяРабота);
	СтруктураВозврата.Вставить("ВидыРабот",ДанныеФормыВЗначение(ВидыРабот,Тип("ТаблицаЗначений")));
	Возврат ПоместитьВоВременноеХранилище(СтруктураВозврата);
	
КонецФункции 

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
