
&НаКлиенте
Процедура СписокПараметровПриАктивизацииСтрокиНаКлиенте()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Элементы.СписокПараметров.ТекущаяСтрока, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокПараметровПриАктивизацииСтрокиНаКлиенте", 0.1, Истина);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПредметРасчета") И ЗначениеЗаполнено(Параметры.ПредметРасчета) Тогда
		
		ПредметРасчета = Параметры.ПредметРасчета;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	гиг_ПредметыРасчетаНаборПараметров.Параметр КАК Параметр
		|ИЗ
		|	Справочник.гиг_ПредметыРасчета.НаборПараметров КАК гиг_ПредметыРасчетаНаборПараметров
		|ГДЕ
		|	гиг_ПредметыРасчетаНаборПараметров.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ПредметРасчета);
		МассивПараметров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Параметр");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПараметров, "Ссылка", МассивПараметров, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
	КонецЕсли; 
	
КонецПроцедуры
