
&Вместо("РазбитьСтрокуТЧДобавлениеСтроки")
Процедура Рин1_РазбитьСтрокуТЧДобавлениеСтроки(ТЧ, ЭлементФормы, Количество, ОповещениеПослеРазбиения, ПараметрыОбработки)
	
	ТекущаяСтрока	= ЭлементФормы.ТекущиеДанные;
	
	ИндексТекущейСтроки 	 = ТЧ.Индекс(ТекущаяСтрока);
	НоваяСтрока 			 = ТЧ.Вставить(ИндексТекущейСтроки + 1);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	
	НоваяСтрока[ПараметрыОбработки.ИмяПоляКоличество]   = Количество;
	ТекущаяСтрока[ПараметрыОбработки.ИмяПоляКоличество] = ТекущаяСтрока[ПараметрыОбработки.ИмяПоляКоличество]
	- НоваяСтрока[ПараметрыОбработки.ИмяПоляКоличество];
	
	// bercut 190320
	Попытка
		СтруктураДействий = Новый Структура;
		
		Если ТекущаяСтрока.Свойство("СуммаАвтоматическойСкидки") Тогда
			
			СтруктураДействий.Вставить("ПересчитатьСуммуАвтоматическойСкидки");
			СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
			
			НоваяСтрока.СуммаПроцентОбщий = НоваяСтрока.СуммаАвтоматическойСкидки + НоваяСтрока.СуммаРучнойСкидки;
			
		Иначе
			
			СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
			
		КонецЕсли;
	Исключение	
	КонецПопытки;
	
	Если ОповещениеПослеРазбиения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПослеРазбиения, НоваяСтрока);
	КонецЕсли; 
	
	//bercut 190320
	// + [Rineco], [Киселев А.Н.] [28.09.2021] 
	// Задача: [№ 17825], [#Проверяем наличие свойства убираем попытку]
	
	// Было:
	//Попытка
	//	Если НоваяСтрока.СуммаРучнойСкидки = 0 Тогда
	//		НоваяСтрока.ПроцентРучнойСкидки = 0;
	//	КонецЕсли;
	//Исключение	
	//КонецПопытки;	
	// Стало:
	Если ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(НоваяСтрока,"СуммаРучнойСкидки") <> Неопределено И ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(НоваяСтрока,"СуммаРучнойСкидки") = 0  Тогда
		НоваяСтрока.ПроцентРучнойСкидки = 0;
	КонецЕсли;
	// - [Rineco], [Киселев А.Н.] [28.09.2021]
	
	
	ЭлементФормы.ТекущаяСтрока  = НоваяСтрока.ПолучитьИдентификатор();
	
	//bercut 190320
	Попытка
		ОбновитьТекущуюСтроку(ТекущаяСтрока);
	Исключение	
		// + [Rineco], [Киселев А.Н.] [28.09.2021] 
		// Задача: [№ 17825], [#Пишем событие в журнал]
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Задача17825",,,,ОписаниеОшибки());
		// - [Rineco], [Киселев А.Н.] [28.09.2021]
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьТекущуюСтроку(ТекущаяСтрока)
	
	// + [Rineco], [Киселев А.Н.] [28.09.2021] 
	// Задача: [№ 17825], [#Проверяем наличие свойства]
	Если ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(ТекущаяСтрока,"ВидЦены") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// - [Rineco], [Киселев А.Н.] [28.09.2021]
	
	Если не ТекущаяСтрока.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
		
		Если не ТекущаяСтрока.ПроцентОбщий = 0 Тогда
			ТекущаяСтрока.СуммаПроцентОбщий = (ТекущаяСтрока.Цена/(100/ТекущаяСтрока.ПроцентОбщий))*ТекущаяСтрока.КоличествоУпаковок;
		Иначе
			ТекущаяСтрока.СуммаПроцентОбщий = 0;
		КонецЕсли;
		Если не ТекущаяСтрока.ПроцентАвтоматическойСкидки = 0 Тогда
			ТекущаяСтрока.СуммаАвтоматическойСкидки = Окр((ТекущаяСтрока.КоличествоУпаковок * ТекущаяСтрока.Цена)/(100/ТекущаяСтрока.ПроцентАвтоматическойСкидки),2);
		Иначе 
			ТекущаяСтрока.СуммаАвтоматическойСкидки = 0;
		КонецЕсли;
		ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаПроцентОбщий - ТекущаяСтрока.СуммаАвтоматическойСкидки; 
		
	Иначе
		
		Если не ТекущаяСтрока.ПроцентРучнойСкидки = 0 Тогда
			ТекущаяСтрока.СуммаПроцентОбщий = (ТекущаяСтрока.Цена/(100/ТекущаяСтрока.ПроцентРучнойСкидки))*ТекущаяСтрока.КоличествоУпаковок;
		Иначе
			ТекущаяСтрока.СуммаПроцентОбщий = 0;
		КонецЕсли;
		ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаПроцентОбщий; 		
		
	КонецЕсли;

КонецПроцедуры


