
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НоменклатураПроекта", Параметры.НоменклатураПроекта, Истина);

КонецПроцедуры

//старый динсписок
//ВЫБРАТЬ
//	гиг_ПредметыРасчета.Ссылка КАК Ссылка,
//	гиг_ПредметыРасчета.Наименование КАК Наименование
//ИЗ
//	Справочник.гиг_ПредметыРасчета КАК гиг_ПредметыРасчета
//		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроектов.гиг_ЗначенияПараметров КАК ЗадачиПроектовгиг_ЗначенияПараметров
//			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гиг_НоменклатураПроекта КАК гиг_НоменклатураПроекта
//			ПО (гиг_НоменклатураПроекта.ЗадачаПроекта = ЗадачиПроектовгиг_ЗначенияПараметров.Ссылка)
//		ПО гиг_ПредметыРасчета.Ссылка = ЗадачиПроектовгиг_ЗначенияПараметров.Ссылка.ГИГ_ПредметРасчета
//ГДЕ
//	гиг_НоменклатураПроекта.Ссылка = &НоменклатураПроекта

//СГРУППИРОВАТЬ ПО
//	гиг_ПредметыРасчета.Ссылка,
//	гиг_ПредметыРасчета.Наименование