
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Описание = ТекущийОбъект.НаполнениеОписания.Получить();
	Рекламация = ТекущийОбъект.НаполнениеРекламации.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НаполнениеОписания = Новый ХранилищеЗначения(Описание);
	ТекущийОбъект.НаполнениеРекламации = Новый ХранилищеЗначения(Рекламация);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Рекламация.ПолучитьЭлементы(,).Количество() > 0 Тогда
		
		Элементы.ГруппаРекламация.Картинка = БиблиотекаКартинок.ВниманиеКрасный;
		
	КонецЕсли;
	
КонецПроцедуры

