
&Вместо("ВыполнитьПодстановкуПараметровВЗапросСпецификаций")
Процедура Рин1_ВыполнитьПодстановкуПараметровВЗапросСпецификаций(Запрос, ПараметрыВыбора, ДляСпискаНоменклатуры)
	
	ТекстЗапроса = Запрос.Текст;
	
	// bercut151119 ПараметрыВыбора это структура нет метода найти! и ДоступныеТипы = неопределено решил заремить
	//Если ПараметрыВыбора.Свойство("ДоступныеТипы") Тогда
	//	
	//	Если ПараметрыВыбора.ДоступныеТипы.Найти(Перечисления.ТипыПроизводственныхПроцессов.Сборка) <> Неопределено Тогда
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ОтборТипСборка", "И ИСТИНА");
	//	Иначе
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ОтборТипСборка", "И ЛОЖЬ");
	//	КонецЕсли;
	//	
	//	Если ПараметрыВыбора.ДоступныеТипы.Найти(Перечисления.ТипыПроизводственныхПроцессов.Ремонт) <> Неопределено Тогда
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ОтборТипРемонт", "И ИСТИНА");
	//	Иначе
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ОтборТипРемонт", "И ЛОЖЬ");
	//	КонецЕсли;
	//	
	//	Если ПараметрыВыбора.ДоступныеТипы.Найти(Перечисления.ТипыПроизводственныхПроцессов.Разборка) <> Неопределено Тогда
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ОтборТипРазборка", "И ИСТИНА");
	//	Иначе
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ОтборТипРазборка", "И ЛОЖЬ");
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	//ПараметрыВыбора.ДоступныеСтатусы тоже неопределено!
	//Если ПараметрыВыбора.Свойство("ДоступныеСтатусы") Тогда
	//	
	//	Если ДляСпискаНоменклатуры Тогда
	//		Подстановка = "
	//		|И (ТабличнаяЧасть.Ссылка.Статус В (&ДоступныеСтатусы)
	//		
	//		|		ИЛИ &ВсеСпецификации)";
	//	Иначе
	//		Подстановка = "
	//		|И ((ТабличнаяЧасть.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
	//		|		И (&НачалоПроизводства = ДАТАВРЕМЯ(1, 1, 1) 
	//		|				ИЛИ ТабличнаяЧасть.Ссылка.НачалоДействия <= &НачалоПроизводства)
	//		|		И (ТабличнаяЧасть.Ссылка.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
	//		|				ИЛИ ТабличнаяЧасть.Ссылка.КонецДействия >= НачалоПериода(&НачалоПроизводства, День))
	//		|		) ИЛИ ТабличнаяЧасть.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
	//		|И (ТабличнаяЧасть.Ссылка.Статус В (&ДоступныеСтатусы)
	//		|		ИЛИ &ВсеСпецификации)";
	//	КонецЕсли;
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ОтборСтатус", Подстановка);
	//	
	//	Запрос.УстановитьПараметр("ДоступныеСтатусы", ПараметрыВыбора.ДоступныеСтатусы);
	//	Запрос.УстановитьПараметр("ВсеСпецификации", ПараметрыВыбора.ДоступныеСтатусы.ВГраница() = -1);
	//	
	//КонецЕсли;
	
	Если ПараметрыВыбора.Свойство("ИсключитьСпецификацию") Тогда
		
		Подстановка = " И (ТабличнаяЧасть.Ссылка <> &ИсключитьСпецификацию)";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ИсключитьСпецификацию", Подстановка);
		
		Запрос.УстановитьПараметр("ИсключитьСпецификацию", ПараметрыВыбора.ИсключитьСпецификацию);
		
	КонецЕсли;
	
	// ПараметрыВыбора.ИсключитьПроизводствоНаСтороне = неопределено!
	//Если ПараметрыВыбора.Свойство("ИсключитьПроизводствоНаСтороне") И ПараметрыВыбора.ИсключитьПроизводствоНаСтороне Тогда
	//	
	//	Подстановка = "
	//	|	И НЕ ИСТИНА В (
	//	|		ВЫБРАТЬ ПЕРВЫЕ 1
	//	|			ИСТИНА
	//	|		ИЗ
	//	|			Справочник.ЭтапыПроизводства КАК Т
	//	|		ГДЕ
	//	|			Т.Владелец = ТабличнаяЧасть.Ссылка
	//	|			И Т.ПроизводствоНаСтороне
	//	|			И НЕ Т.ПометкаУдаления
	//	|		)";
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ИсключитьПроизводствоНаСтороне", Подстановка);
	//	
	//КонецЕсли;
	
	Если ПараметрыВыбора.Свойство("СтрокаПоиска") Тогда
		
		Подстановка = " И (ТабличнаяЧасть.Ссылка.Наименование ПОДОБНО &СтрокаПоиска)";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ОтборПоискПоСтроке", Подстановка);
		
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СокрЛП(ПараметрыВыбора.СтрокаПоиска) + "%");
		
	КонецЕсли;
	
	Если ПараметрыВыбора.Свойство("СпецификацииПоФиксированнойСтоимости") Тогда
		Если ПараметрыВыбора.СпецификацииПоФиксированнойСтоимости = "Показывать" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%СпецификацииПоФиксированнойСтоимости", "И ИСТИНА");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%СпецификацииПоФиксированнойСтоимости", "И ЛОЖЬ");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
КонецПроцедуры
