
&Вместо("ТекстЗапросаТаблицаТоварыКОтгрузке")
Функция Рин1_ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКОтгрузке";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТовары(Запрос, ТекстыЗапроса)
	КонецЕсли;
	
	ТекстЗапроса =
	/////////////////////////////////////////
	// Излишек при приемке (Расхождения > 0).
	//
	// Формируем задание на отгрузку
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	
	|	&Ссылка						           КАК ДокументОтгрузки,
	|	
	|	&Партнер                               КАК Получатель,
	|	
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	
	//bercut040620
	//|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ТаблицаТовары.Назначение                    КАК Назначение,
	//
	
	|	ТаблицаТовары.Серия                    КАК Серия,
	|	
	|	ТаблицаТовары.Расхождения              КАК КОтгрузке
	|ИЗ
	|	ВтТовары КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
//Исходное	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)
//{{20210115 ГлазуновДВ Добавили  Задача 3905
	|	И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)
	|		ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ВернутьБракПоАкту))
//}}20210115 ГлазуновДВ	
	|		
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// Закрываем к отгрузке если не ведутся ордера на отгрузку
	| ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	
	|	&Ссылка						           КАК ДокументОтгрузки,
	|	
	|	&Партнер                               КАК Получатель,
	|	
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	
	//bercut040620
	//|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ТаблицаТовары.Назначение                    КАК Назначение,
	//
	
	|	ТаблицаТовары.Серия                    КАК Серия,
	|	
	|	ТаблицаТовары.Расхождения              КАК КОтгрузке
	|ИЗ
	|	ВтТовары КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|
	|	И НЕ ТаблицаТовары.ОрдернаяСхемаПриОтгрузке
	|
//Исходное	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)
//{{20210115 ГлазуновДВ Добавили  Задача 3905
	|	И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)
	|		ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ВернутьБракПоАкту))
//}}20210115 ГлазуновДВ	
	|		
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&Вместо("ТекстЗапросаТаблицаТоварыКПоступлению")
Функция Рин1_ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКПоступлению";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТовары(Запрос, ТекстыЗапроса)
	КонецЕсли;
	
	ТекстЗапроса =  "";
	
	ТекстЗапроса = 	ТекстЗапроса +

	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Распоряжение             КАК ДокументПоступления,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Партнер	                           КАК Отправитель,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	//|			ТОГДА ТаблицаТовары.Назначение
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	//|	КОНЕЦ                                  КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)     КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ТаблицаТовары.Расхождения             КАК КОформлениюНакладныхПоРаспоряжению,
	|	0                                      КАК КОформлениюПоступленийПоРаспоряжению,
	|	0                                      КАК КОформлениюПоступленийПоОрдерам,
	|	0                                      КАК КОформлениюОрдеров,
	|	&ХозяйственнаяОперация                 КАК ХозяйственнаяОперация
	|ИЗ
	|	ВтТовары КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	|	И  ТаблицаТовары.ОрдернаяСхемаПриПриемке
	|
	//8O
	|	И  
	|		(ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы)
	//6K
	|        ИЛИ
//Исходное	|		 ((ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное)
//Исходное	|		 	ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть))
//{{20201021 ГлазуновДВ Добавили
	|			((ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы))
//}}20201021 ГлазуновДВ	
	|		  И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Распоряжение             КАК ДокументПоступления,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Партнер	                           КАК Отправитель,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	//|			ТОГДА ТаблицаТовары.Назначение
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	//|	КОНЕЦ                                  КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)      КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	0                                      КАК КОформлениюНакладныхПоРаспоряжению,
	|	ТаблицаТовары.Расхождения             КАК КОформлениюПоступленийПоРаспоряжению,
	|	0                                      КАК КОформлениюПоступленийПоОрдерам,
	|	0                                      КАК КОформлениюОрдеров,
	|	&ХозяйственнаяОперация                 КАК ХозяйственнаяОперация
	|ИЗ
	|	ВтТовары КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	|	И  ТаблицаТовары.ОрдернаяСхемаПриПриемке
	|
	//8O
	|	И  
	|		(ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы)
	//6K
	|        ИЛИ
//Исходное	|		 ((ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное)
//Исходное	|		 	ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть))
//{{20201021 ГлазуновДВ Добавили
	|			(ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы)
//}}20201021 ГлазуновДВ	
	|		  И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";

	ТекстЗапроса = 	ТекстЗапроса +
	
	/////////////////////////////////////////
		// Недостача при приемке (Расхождения < 0).
		// 
		// Для ордерной схемы при приемке
		// Компенсация Приходного ордера (оптимистично считая, что товар недоприняли)
		// при корректировке.
		"ВЫБРАТЬ
//Исходное		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	//}}20210113 ГлазуновДВ	
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	
//Исходное		|	ТаблицаТовары.Распоряжение             КАК ДокументПоступления,
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Действие В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))
		|			ТОГДА &Ссылка
		|		ИНАЧЕ ТаблицаТовары.Распоряжение
		|	КОНЕЦ                                  КАК ДокументПоступления,
	//}}20210113 ГлазуновДВ	
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	&Партнер                               КАК Отправитель,
		|	
		|	ТаблицаТовары.НазначениеСкладское      КАК Назначение,
		|
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
		|	
		|	0                                      КАК КОформлениюНакладныхПоРаспоряжению,
		|	0						               КАК КОформлениюПоступленийПоРаспоряжению,
//Исходное		|	ТаблицаТовары.Расхождения              КАК КОформлениюОрдеров,
	//	|	-ТаблицаТовары.Расхождения              КАК КОформлениюОрдеров,
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Действие В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))
		|			ТОГДА -ТаблицаТовары.Расхождения
		|		ИНАЧЕ ТаблицаТовары.Расхождения
		|	КОНЕЦ                                  КАК КОформлениюОрдеров,
	//}}20210113 ГлазуновДВ	
		|	0                                      КАК КОформлениюПоступленийПоОрдерам,
		|	&ХозяйственнаяОперация                 КАК ХозяйственнаяОперация
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	  		
		//7C
		|	И ((ТаблицаТовары.Действие =  ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы)
		|			И ТаблицаТовары.ОрдернаяСхемаПриПриемке)
		|		ИЛИ
		//3К 
		|	    (ТаблицаТовары.ОрдернаяСхемаПриПриемке 
		|   		И  &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|			И  ТаблицаТовары.Действие В(
//Исходное		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку),
//Исходное		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу))))
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 Задача 3923
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))))
	//}}20210113 ГлазуновДВ	
		|		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		/////////////////////////////////////////
		// Излишек при приемке (Расхождения > 0).
		//
		// Компенсация заказа/накладной на ордерном складе (оптимистично считая, что приняли лишнее).
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	////{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
	//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	////}}20210113 ГлазуновДВ	
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Распоряжение             КАК ДокументПоступления,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	&Партнер                               КАК Отправитель,
//Исходное		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	//{{20210115 ГлазуновДВ Добавили Задача 3905 и Задача 3923
		|	ТаблицаТовары.НазначениеСкладское КАК Назначение,
	//}}20210115 ГлазуновДВ	
		|
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
		|
		|	0                                      КАК КОформлениюНакладныхПоРаспоряжению,
		|	0						               КАК КОформлениюПоступленийПоРаспоряжению,
//Исходное		|	ТаблицаТовары.Расхождения              КАК КОформлениюОрдеров,
	//{{20210113 ГлазуновДВ Добавили Задача 3905 и Задача 3923
		|	-ТаблицаТовары.Расхождения              КАК КОформлениюОрдеров,
	//}}20210113 ГлазуновДВ	
		|	0                                      КАК КОформлениюПоступленийПоОрдерам,
		|	&ХозяйственнаяОперация                 КАК ХозяйственнаяОперация
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		|	И 
		//4T
		| 		(ТаблицаТовары.ОрдернаяСхемаПриПриемке
//Исходное		|			И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления))
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|			И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)
		|			ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_НеОприходоватьПоФинУчету)))
	//}}20210113 ГлазуновДВ	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Компенсация заказа/накладной (оптимистично считая, что приняли лишнее).
		|ВЫБРАТЬ
//Исходное		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	//}}20210113 ГлазуновДВ	
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Распоряжение             КАК ДокументПоступления,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	&Партнер                               КАК Отправитель,
//Исходное		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	//{{20201021 ГлазуновДВ Добавили
		|	ТаблицаТовары.НазначениеСкладское      КАК Назначение,
	//}}20201021 ГлазуновДВ	
		|	
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
		|	
		|	0                                      КАК КОформлениюНакладныхПоРаспоряжению,
		|	0						               КАК КОформлениюПоступленийПоРаспоряжению,
		|	ТаблицаТовары.Расхождения              КАК КОформлениюОрдеров,
		|	0                                      КАК КОформлениюПоступленийПоОрдерам,
		|	&ХозяйственнаяОперация                 КАК ХозяйственнаяОперация
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		|	И  ТаблицаТовары.ОрдернаяСхемаПриПриемке
		|
		//8O
		|	И  
//Исходное		|		(ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы)
		//6K
//Исходное		|        ИЛИ
//Исходное		|		 ((ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное)
//Исходное		|		 	ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть))
//Исходное		|		  И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)))
	//{{20210115 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|		(ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы))
	//}}20210115 ГлазуновДВ	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		/////////////////////////////////////////
		// Недостача при приемке (Расхождения < 0).
		//
		// Компенсация Приходного ордера (оптимистично считая, что товар недоприняли) при корректировке.
		|ВЫБРАТЬ
//Исходное		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//}}20210113 ГлазуновДВ	
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
//Исходное		|	ТаблицаТовары.Распоряжение             КАК ДокументПоступления,
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Действие В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))
		|			ТОГДА &Ссылка
		|		ИНАЧЕ ТаблицаТовары.Распоряжение
		|	КОНЕЦ                                  КАК ДокументПоступления,
	//}}20210113 ГлазуновДВ	
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	&Партнер                               КАК Отправитель,
//Исходное		|	ТаблицаТовары.НазначениеСкладское      КАК Назначение,
		|	ТаблицаТовары.НазначениеСкладское      КАК Назначение,
 //20210120 ГлазуновДВ ВЕРНУЛИ ИСХОДНОЕ, ОТКЛЮЧИЛИ ниже		
	////{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
	//	|	ВЫБОР
	//	|		КОГДА ТаблицаТовары.Действие В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))
	//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ЗаменаБрака)
	//	|		ИНАЧЕ ТаблицаТовары.НазначениеСкладское
	//	|	КОНЕЦ                                  КАК Назначение,
	////}}20210113 ГлазуновДВ	
		|
		|	ТаблицаТовары.Серия					   КАК Серия,
		|	
		|	0                                      КАК КОформлениюНакладныхПоРаспоряжению,
		|	0						               КАК КОформлениюПоступленийПоРаспоряжению,
		|	0                                      КАК КОформлениюОрдеров,
//Исходное		|	ТаблицаТовары.Расхождения              КАК КОформлениюПоступленийПоОрдерам,
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
	//	|	-ТаблицаТовары.Расхождения              КАК КОформлениюПоступленийПоОрдерам,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Действие В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))
		|			ТОГДА -ТаблицаТовары.Расхождения
		|		ИНАЧЕ ТаблицаТовары.Расхождения
		|	КОНЕЦ                                  КАК КОформлениюПоступленийПоОрдерам,
	//}}20210113 ГлазуновДВ	
		|	&ХозяйственнаяОперация                 КАК ХозяйственнаяОперация
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		|	И ТаблицаТовары.ОрдернаяСхемаПриПриемке
		|	
		//2Д
		|	И (&СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|
		|			И ТаблицаТовары.Действие В(
//Исходное		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу),
//Исходное		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))
	//}}20210113 ГлазуновДВ	
		|		
		//7С
		|		ИЛИ 
		|			ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы))
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		/////////////////////////////////////////
		// Излишек при приемке (Расхождения > 0).
		//
		// Закрытие свободных остатков при возврате перепоставленного товара
		|ВЫБРАТЬ
//Исходное		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	//}}20210113 ГлазуновДВ	
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	ТаблицаТовары.Распоряжение             КАК ДокументПоступления,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	&Партнер                               КАК Отправитель,
		|	ТаблицаТовары.НазначениеСкладское      КАК Назначение,
		|
		|	ТаблицаТовары.Серия                    КАК Серия,
		|	
		|	0                                      КАК КОформлениюНакладныхПоРаспоряжению,
		|	0						               КАК КОформлениюПоступленийПоРаспоряжению,
		|	0                                      КАК КОформлениюОрдеров,
		|	-ТаблицаТовары.Расхождения             КАК КОформлениюПоступленийПоОрдерам,
	////{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
	//	|	ВЫБОР
	//	|		КОГДА ТаблицаТовары.НазначениеСкладское В (ЗНАЧЕНИЕ(Справочник.Назначения.ЗаменаБрака))
	//	|			ТОГДА -ТаблицаТовары.Расхождения
	//	|		ИНАЧЕ ТаблицаТовары.Расхождения
	//	|	КОНЕЦ                                  КАК КОформлениюПоступленийПоОрдерам,
	////}}20210113 ГлазуновДВ	
		|	&ХозяйственнаяОперация                 КАК ХозяйственнаяОперация
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		//6K
		|	И ((ТаблицаТовары.ОрдернаяСхемаПриПриемке
		|	
		|			И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|		
		|			И ТаблицаТовары.Действие В(
//Исходное		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть),
//Исходное		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное)))
	//{{20201021 ГлазуновДВ Добавили
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_НеОприходоватьПоФинУчету)))
	//}}20201021 ГлазуновДВ	
		|		ИЛИ
		|
		|       ( ТаблицаТовары.ОрдернаяСхемаПриПриемке 
		//4T
		|		  	И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)
		//8О
//Исходное		|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы))))";
	//{{20210113 ГлазуновДВ Добавили  Задача 3905 и Задача 3923
		|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы)
		|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_НеОприходоватьПоФинУчету))))";
	//}}20210113 ГлазуновДВ	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

//{{20210113 ГлазуновДВ Добавили  Задача 3905
&Вместо("ТекстЗапросаТаблицаТоварыНаСкладах")
Функция Рин1_ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры);
	//Возврат Результат;
	ИмяРегистра = "ТоварыНаСкладах";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТаблицаТоварыИСерии", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТоварыИСерии(Запрос, ТекстыЗапроса)
	КонецЕсли;

	ТекстЗапроса =
//{{20210114 ГлазуновДВ Добавили  Задача 3905
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Помещение         				       КАК Помещение,
	|	ТаблицаТовары.Назначение               КАК Назначение,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|
	|	-ТаблицаТовары.Расхождения              КАК ВНаличии,
	|	ЛОЖЬ                                   КАК КонтролироватьОстатки
	|ИЗ
	|	ВтТаблицаТоварыИСерии КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	//7С
	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Помещение         				       КАК Помещение,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Действие В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ЗаменаБрака)
	|		ИНАЧЕ ТаблицаТовары.Назначение
	|	КОНЕЦ                                  КАК Назначение,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|
	|	-ТаблицаТовары.Расхождения              КАК ВНаличии,
	|	ЛОЖЬ                                   КАК КонтролироватьОстатки
	|ИЗ
	|	ВтТаблицаТоварыИСерии КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	//3К
	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";

	ТекстЗапроса = 	ТекстЗапроса +
//}}20210114 ГлазуновДВ
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Помещение         				       КАК Помещение,
	|	ТаблицаТовары.Назначение               КАК Назначение,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|
	|	ТаблицаТовары.Расхождения              КАК ВНаличии,
	|	ЛОЖЬ                                   КАК КонтролироватьОстатки
	|ИЗ
	|	ВтТаблицаТоварыИСерии КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	//7С
	|	И ТаблицаТовары.ОрдернаяСхемаПриПриемке
	|	И НЕ ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач
	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы)       
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Уменьшение остатков по складу при неордерной схеме приемки
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Помещение         				       КАК Помещение,
	|	ТаблицаТовары.Назначение               КАК Назначение,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|
	|	ТаблицаТовары.Расхождения              КАК ВНаличии,
	|	ЛОЖЬ                                   КАК КонтролироватьОстатки
	|ИЗ
	|	ВтТаблицаТоварыИСерии КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	//3К
	|	   И НЕ ТаблицаТовары.ОрдернаяСхемаПриПриемке 
	|	   И ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач 
	|	   И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
	|	   И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу)
	|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// Компенсация корректировки поступления по складу при ордерной схеме приемки
	// Оптимистично считая, что в приходном ордере уже отражена недостача.
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Помещение         				       КАК Помещение,
	|	ТаблицаТовары.Назначение               КАК Назначение,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|
	|	-ТаблицаТовары.Расхождения              КАК ВНаличии,
	|	ЛОЖЬ                                   КАК КонтролироватьОстатки
	|ИЗ
	|	ВтТаблицаТоварыИСерии КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	//3К
	|	   И ТаблицаТовары.ОрдернаяСхемаПриПриемке 
	|	   И НЕ ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач 
	|	   И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
	|	   И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу)
	|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	/////////////////////////////////////////
	// Излишек при приемке (Расхождения > 0).
	//
	// Компенсация корректировки поступления по складу при ордерной схеме приемки
	// Оптимистично считаем, что приходным ордером уже отражен факт излишка.
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Помещение         				       КАК Помещение,
	|	ТаблицаТовары.Назначение               КАК Назначение,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|	
	|	-ТаблицаТовары.Расхождения              КАК ВНаличии,
	|	ЛОЖЬ                                   КАК КонтролироватьОстатки
	|ИЗ
	|	ВтТаблицаТоварыИСерии КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	|	И ТаблицаТовары.ОрдернаяСхемаПриПриемке 
	|	И НЕ ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач
	//8O
	|	И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы)
	|		
	//6K
	|		ИЛИ (&СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
	|	   		  И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное)
	|				  ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть))))
	|	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// Увеличение остатков по складу при неордерной схеме приемки
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	&Помещение         				       КАК Помещение,
	|	ТаблицаТовары.Назначение               КАК Назначение,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|
	|	ТаблицаТовары.Расхождения              КАК ВНаличии,
	|	ЛОЖЬ                                   КАК КонтролироватьОстатки
	|ИЗ
	|	ВтТаблицаТоварыИСерии КАК ТаблицаТовары
	|ГДЕ
	|	&Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	
	//6К
	|	   И НЕ ТаблицаТовары.ОрдернаяСхемаПриПриемке 
	|	   И ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач 
	|	   И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
	|	   И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное)
	|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть))
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
	Возврат ТекстЗапроса;
	
КонецФункции

&Вместо("ТекстЗапросаТаблицаСвободныеОстатки")
Функция Рин1_ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры);
	//Возврат Результат;
	ИмяРегистра = "СвободныеОстатки";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТовары(Запрос, ТекстыЗапроса)
	КонецЕсли;
	
	ТекстЗапроса =
		/////////////////////////////////////////
		// Недостача при приемке (Расхождения < 0).
		//
		// Компенсация корректировки поступления по складу при ордерной схеме приемки
		// Оптимистично считаем, что приходным ордером отразили факт недостачи на складе.
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	
		|	ТаблицаТовары.Расхождения             КАК ВНаличии,
		|	ВЫБОР 
		|		КОГДА ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) 
		|			ТОГДА
		|				ТаблицаТовары.Расхождения
		|			ИНАЧЕ
		|				0
		|	КОНЕЦ                              	   КАК ВРезервеПодЗаказ
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		//7C
		|	И ТаблицаТовары.ОрдернаяСхемаПриПриемке
		|	И НЕ ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач
		|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	
		|	ТаблицаТовары.Расхождения             КАК ВНаличии,
		|	ВЫБОР 
		|		КОГДА ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) 
		|			ТОГДА
		|				ТаблицаТовары.Расхождения
		|			ИНАЧЕ
		|				0
		|	КОНЕЦ                              	   КАК ВРезервеПодЗаказ
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		//3К
		|	   И НЕ ТаблицаТовары.ОрдернаяСхемаПриПриемке 
		|	   И ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач 
		|	   И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|	   И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу)
		|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	
		|	-ТаблицаТовары.Расхождения             КАК ВНаличии,
		|	ВЫБОР 
		|		КОГДА ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) 
		|			ТОГДА
		|				ТаблицаТовары.Расхождения
		|			ИНАЧЕ
		|				0
		|	КОНЕЦ                              	   КАК ВРезервеПодЗаказ
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		//3К
		|	   И ТаблицаТовары.ОрдернаяСхемаПриПриемке 
		|	   И НЕ ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач
		|	   И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|	   И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу)
		|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
		|
//{{20210115 ГлазуновДВ Добавили  Задача 3905
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	
		|	-ТаблицаТовары.Расхождения             КАК ВНаличии,
		|	ВЫБОР 
		|		КОГДА ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) 
		|			ТОГДА
		|				ТаблицаТовары.Расхождения
		|			ИНАЧЕ
		|				0
		|	КОНЕЦ                              	   КАК ВРезервеПодЗаказ
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		//3К
		|	   И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.Рин1_ОжидатьДопоставкуПоАкту))
//}}20210115 ГлазуновДВ
		|ОБЪЕДИНИТЬ ВСЕ
		//++Шерстюк Ю.Ю. 12.07.2021 Задача 11903 при ордерной схеме движения будет делать расходный/приходный ордер в нашей логике, 
		////// Излишек при приемке (Расхождения > 0).
		//////
		////// Закрытие свободных остатков при возврате перепоставленного товара
		////|ВЫБРАТЬ
		////|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		////|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		////|	&Период                                КАК Период,
		////|	
		////|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		////|	ТаблицаТовары.Характеристика           КАК Характеристика,
		////|	ТаблицаТовары.Склад                    КАК Склад,
		////|	
		////|	-ТаблицаТовары.Расхождения             КАК ВНаличии,
		////|	ВЫБОР 
		////|		КОГДА ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) 
		////|			ТОГДА
		////|			-ТаблицаТовары.Расхождения
		////|			ИНАЧЕ
		////|				0
		////|	КОНЕЦ                              	   КАК ВРезервеПодЗаказ
		////|ИЗ
		////|	ВтТовары КАК ТаблицаТовары
		////|ГДЕ
		////|	&Статус В(
		////|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		////|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		////|	
		////|	И ТаблицаТовары.ОрдернаяСхемаПриПриемке
		//4Т
		////|	И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)
		//8О
		////|     ИЛИ (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы)
		////|           И НЕ ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач)
		
		//6К
		// Компенсация корректировки поступления по складу при ордерной схеме приемки
		// Оптимистично считаем, что приходным ордером уже отражен факт излишка.
		////|	  ИЛИ (НЕ ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач
		////|	   	   И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		////|	   	   И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное)
		////|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть))))
		////|
		////|ОБЪЕДИНИТЬ ВСЕ
		//--Шерстюк Ю.Ю.
		|
		// Увеличение склада при неордерной схеме приемки
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	
		|	ТаблицаТовары.Расхождения              КАК ВНаличии,
		|	ВЫБОР 
		|		КОГДА ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) 
		|			ТОГДА
		|				ТаблицаТовары.Расхождения
		|			ИНАЧЕ
		|				0
		|	КОНЕЦ                              	   КАК ВРезервеПодЗаказ
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	
		//3К
		|	   И НЕ ТаблицаТовары.ОрдернаяСхемаПриПриемке 
		|	   И ТаблицаТовары.ОрдернаяСхемаПриОтраженииИзлишковНедостач 
		|	   И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|	   И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное)
		|				ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть))
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&Вместо("ЗаполнитьПараметрыИнициализации")
Процедура Рин1_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	// Вставить содержимое метода.
	//ПродолжитьВызов(Запрос, ДокументСсылка);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеШапки.Дата КАК Период,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеШапки.Проведен КАК Проведен,
	|	ДанныеШапки.Партнер КАК Партнер,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Валюта КАК Валюта,
	|	ДанныеШапки.Статус КАК Статус,
	|	ДанныеШапки.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ДанныеШапки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеШапки.Договор КАК Договор,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ДанныеШапки.Менеджер КАК Менеджер,
	|	ДанныеШапки.Комментарий КАК Комментарий,
	|	ДанныеШапки.СпособОтраженияРасхождений КАК СпособОтраженияРасхождений,
	|	ДанныеШапки.ТипОснованияАктаОРасхождении КАК ТипОснованияАктаОРасхождении,
	|	ДанныеШапки.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",                        Реквизиты.Период);
	Запрос.УстановитьПараметр("ПометкаУдаления",               Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",                      Реквизиты.Проведен);
	Запрос.УстановитьПараметр("Партнер",                       Реквизиты.Партнер);
	Запрос.УстановитьПараметр("Контрагент",                    Реквизиты.Контрагент);
	Запрос.УстановитьПараметр("Валюта",                        Реквизиты.Валюта);
	Запрос.УстановитьПараметр("Статус",                        Реквизиты.Статус);
	Запрос.УстановитьПараметр("Организация",                   Реквизиты.Организация);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС",               Реквизиты.ЦенаВключаетНДС);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",         Реквизиты.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("Договор",                       Реквизиты.Договор);
	Запрос.УстановитьПараметр("Подразделение",                 Реквизиты.Подразделение);
	Запрос.УстановитьПараметр("Менеджер",                 	   Реквизиты.Менеджер);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",       ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.АктОРасхожденияхПослеПриемки"));
	Запрос.УстановитьПараметр("НомерНаПечать",       		   ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	Запрос.УстановитьПараметр("Номер",       		   		   Реквизиты.Номер);
	Запрос.УстановитьПараметр("СпособОтраженияРасхождений",    Реквизиты.СпособОтраженияРасхождений);
	Запрос.УстановитьПараметр("СкладскаяОперация",             СкладскаяОперацияПоТипуОснования(Реквизиты.ТипОснованияАктаОРасхождении));
	Запрос.УстановитьПараметр("Комментарий",                   Реквизиты.Комментарий);
//{{20210120 ГлазуновДВ
	Запрос.УстановитьПараметр("Помещение",                     Справочники.СкладскиеПомещения.НайтиПоНаименованию("Ручной отбор (мезонин)"));
//}}20210120 ГлазуновДВ
	Если ЗначениеЗаполнено(Реквизиты.Договор) Тогда
		ИнформацияПоДоговору = НСтр("ru = 'По договору ""%Договор%""';
									|en = 'Under the ""%Договор%"" contract'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ИнформацияПоДоговору = СтрЗаменить(ИнформацияПоДоговору, "%Договор%", Реквизиты.Договор);
	КонецЕсли;
	Запрос.УстановитьПараметр("ИнформацияПоДоговору", ИнформацияПоДоговору);
	
	Если ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(Реквизиты.ВариантПриемкиТоваров) Тогда
		Запрос.УстановитьПараметр("НакладнаяЯвляетсяРаспоряжением", Истина);
	Иначе
		Запрос.УстановитьПараметр("НакладнаяЯвляетсяРаспоряжением", Ложь);
	КонецЕсли;
	
КонецПроцедуры


&Вместо("ТекстЗапросаТаблицаОбеспечениеЗаказов")
Функция Рин1_ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ОбеспечениеЗаказов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТовары(Запрос, ТекстыЗапроса)
	КонецЕсли;
	
	ТекстЗапроса =
		/////////////////////////////////////////
		// Недостача при приемке (Расхождения < 0).
		//
		// Формирование потребности для до-отгрузки из свободного остатка
		// или для отмены заказа(если доспоставка не требуется) в предварительном статусе.
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	
		|	ТаблицаТовары.НазначениеСкладское      КАК Назначение,
		|	0						               КАК Потребность,
		|	-ТаблицаТовары.Расхождения             КАК КЗаказу,
		|	-ТаблицаТовары.Расхождения             КАК НаличиеПодЗаказ
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|
		|	И ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|	
		|	И ТаблицаТовары.ОрдернаяСхемаПриПриемке
		|	И ТаблицаТовары.Действие В(
		|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу),
		|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
		|	И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Компенсация обнаруженного пересчетом товаров на складе излишка (оптимистично считая, что товар недогрузили)
		// для до-отгрузки из свободного остатка или для отмены заказа(если доспоставка не требуется).
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период                                КАК Период,
		|	
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	
		|	ТаблицаТовары.НазначениеСкладское      КАК Назначение,
		|	0						               КАК Потребность,
		|	-ТаблицаТовары.Расхождения             КАК КЗаказу,
		|	0						               КАК НаличиеПодЗаказ
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|
		|	И ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|	
		|	И (
		|	  (ТаблицаТовары.ОрдернаяСхемаПриПриемке 
		|		И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы))
		|      ИЛИ
		|	  (НЕ ТаблицаТовары.ОрдернаяСхемаПриПриемке
		|		И ТаблицаТовары.Действие В(
		|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу),
		|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
		|		И &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)))
		//++Шерстюк Ю.Ю. 10.02.21 при отгрузке излишков нужно сделать обратное движение по регистру в случае "Вернуть без оформления".
		//Задача 5327
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ТаблицаТовары.Склад КАК Склад,
		|	ТаблицаТовары.НазначениеСкладское КАК Назначение,
		|	0 КАК Потребность,
		|	0 КАК КЗаказу,
		|	-ТаблицаТовары.Расхождения КАК НаличиеПодЗаказ
		|ИЗ
		|	ВтТовары КАК ТаблицаТовары
		|ГДЕ
		|	&Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению), ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
		|	И ТаблицаТовары.ОрдернаяСхемаПриПриемке
		|			И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)
		|   И ТаблицаТовары.НазначениеСкладское <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) 
		//--Шерстюк Ю.Ю.
		|";
		
		
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции


&Вместо("ИнициализироватьДанныеДокумента")
Процедура Рин1_ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры)

	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
//{{20201022 ГлазуновДВ
	ТекстЗапросаТаблицаЗаказыПоставщикам(Запрос, ТекстыЗапроса, Регистры);
//}}20201022 ГлазуновДВ
	ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвижениеТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКОформлениюИзлишковНедостач(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры);	
	ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);

КонецПроцедуры
//}}20210113 ГлазуновДВ

//{{20201022 ГлазуновДВ
Функция ТекстЗапросаТаблицаЗаказыПоставщикам(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ЗаказыПоставщикам";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = "
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.ЗаказПоставщику          КАК ЗаказПоставщику,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.КодСтроки                КАК КодСтроки,
	|	ВЫБОР КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
	|			ТаблицаТовары.Склад
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ                                  КАК Склад,
	|	КоличествоУпаковок - ТаблицаТовары.КоличествоУпаковокПоДокументу КАК Заказано,
	|	КоличествоУпаковок - ТаблицаТовары.КоличествоУпаковокПоДокументу КАК КОформлению
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.КодСтроки <> 0
		|   		И  &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|			И  ТаблицаТовары.Действие В(
		//|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку),
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.ЗаказПоставщику          КАК ЗаказПоставщику,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.КодСтроки                КАК КодСтроки,
	|	ВЫБОР КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
	|			ТаблицаТовары.Склад
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ                                  КАК Склад,
	|	0                                      КАК Заказано,
	|	КоличествоУпаковок - ТаблицаТовары.КоличествоУпаковокПоДокументу КАК КОформлению
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.КодСтроки = 0
		|   		И  &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|			И  ТаблицаТовары.Действие В(
		//|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку),
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.ЗаказПоставщику          КАК ЗаказПоставщику,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.КодСтроки                КАК КодСтроки,
	|	ВЫБОР КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
	|			ТаблицаТовары.Склад
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ                                  КАК Склад,
	|	0                                      КАК Заказано,
	|	КоличествоУпаковок - ТаблицаТовары.КоличествоУпаковокПоДокументу КАК КОформлению
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.КодСтроки = 0
		|   		И  &СпособОтраженияРасхождений = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления)
		|			И  ТаблицаТовары.Действие В(
		//|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку),
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку))
	|
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции
//}}20201022 ГлазуновДВ

