
&Вместо("ИнициализироватьТаблицуБуфераОбмена")
Функция Рин1_ИнициализироватьТаблицуБуфераОбмена()
	
	ТаблицаСтрок = Новый ТаблицаЗначений();
	ОписаниеТиповДенежногоПоля = ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля();
	ОписаниеТиповЧисло15_3 = ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15,3);
	ТаблицаСтрок.Колонки.Добавить("ТоварнаяКатегория", Новый ОписаниеТипов("СправочникСсылка.ТоварныеКатегории"));
	ТаблицаСтрок.Колонки.Добавить("РейтингПродаж", Новый ОписаниеТипов("СправочникСсылка.РейтингиПродажНоменклатуры"));
	ТаблицаСтрок.Колонки.Добавить("НоменклатураНабора", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСтрок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСтрок.Колонки.Добавить("УпаковочныйЛист", Новый ОписаниеТипов("ДокументСсылка.УпаковочныйЛист"));
	ТаблицаСтрок.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	ТаблицаСтрок.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаСтрок.Колонки.Добавить("ХарактеристикаНабора", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаСтрок.Колонки.Добавить("Содержание", Новый ОписаниеТипов("Строка"));
	ТаблицаСтрок.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаСтрок.Колонки.Добавить("КоличествоУпаковок", ОписаниеТиповЧисло15_3);
	ТаблицаСтрок.Колонки.Добавить("Количество", ОписаниеТиповЧисло15_3);
	ТаблицаСтрок.Колонки.Добавить("Цена", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("ПроцентРучнойСкидки", ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(5,2));
	ТаблицаСтрок.Колонки.Добавить("СуммаРучнойСкидки", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	ТаблицаСтрок.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов,
	|ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
	ТаблицаСтрок.Колонки.Добавить("АналитикаРасходов", Метаданные.ПланыВидовХарактеристик.СтатьиРасходов.Тип);
	ТаблицаСтрок.Колонки.Добавить("АналитикаАктивовПассивов", Метаданные.ПланыВидовХарактеристик.СтатьиАктивовПассивов.Тип);
	ТаблицаСтрок.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаСтрок.Колонки.Добавить("СуммаРасходов", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("ДатаОтражения", Новый ОписаниеТипов("Дата"));
	ТаблицаСтрок.Колонки.Добавить("СтатьяДоходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиДоходов"));
	ТаблицаСтрок.Колонки.Добавить("СуммаДоходов", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("Сумма", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СуммаБезНДС", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СуммаРегл", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СуммаПР", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СуммаВР", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СпособОпределенияСебестоимости", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыОпределенияСебестоимости"));
	ТаблицаСтрок.Колонки.Добавить("ДокументРеализации", Документы.ТипВсеСсылки());
	ТаблицаСтрок.Колонки.Добавить("Себестоимость", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СебестоимостьБезНДС", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СебестоимостьРегл", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СебестоимостьПР", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СебестоимостьВР", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("ВидЦеныСебестоимости", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	ТаблицаСтрок.Колонки.Добавить("ДатаЗаполненияСебестоимостиПоВидуЦены", Новый ОписаниеТипов("Дата"));
	ТаблицаСтрок.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаСтрок.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТаблицаСтрок.Колонки.Добавить("Соглашение", Новый ОписаниеТипов("СправочникСсылка.СоглашенияСПоставщиками,
	|СправочникСсылка.СоглашенияСКлиентами"));
	ТаблицаСтрок.Колонки.Добавить("ВариантКомплектации", Новый ОписаниеТипов("СправочникСсылка.ВариантыКомплектацииНоменклатуры"));
	
	ТаблицаСтрок.Колонки.Добавить("ДатаПоступления", Новый ОписаниеТипов("Дата"));
	ТаблицаСтрок.Колонки.Добавить("ДатаОстатка", Новый ОписаниеТипов("Дата"));
	ТаблицаСтрок.Колонки.Добавить("ДатаОтгрузки", Новый ОписаниеТипов("Дата"));
	ТаблицаСтрок.Колонки.Добавить("ДатаСборкиРазборки", Новый ОписаниеТипов("Дата"));
	
	//++ НЕ УТ
	ТаблицаСтрок.Колонки.Добавить("ДокументПередачи", Документы.ТипВсеСсылки());
	ТаблицаСтрок.Колонки.Добавить("ВидРабот", Новый ОписаниеТипов("СправочникСсылка.ВидыРаботСотрудников"));
	ТаблицаСтрок.Колонки.Добавить("СтатьяКалькуляции", Новый ОписаниеТипов("СправочникСсылка.СтатьиКалькуляции"));
	ТаблицаСтрок.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ТаблицаСтрок.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	ТаблицаСтрок.Колонки.Добавить("МестоХранения", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыМестХранения"));
	ТаблицаСтрок.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТаблицаСтрок.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаСтрок.Колонки.Добавить("Хранитель", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТаблицаСтрок.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаСтрок.Колонки.Добавить("Отправитель", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия,
	|СправочникСсылка.Склады"));
	ТаблицаСтрок.Колонки.Добавить("НаправлениеВыпуска", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
	ТаблицаСтрок.Колонки.Добавить("Получатель", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов,
	|СправочникСсылка.СтруктураПредприятия,
	|ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов,
	|СправочникСсылка.Склады"));
	ТаблицаСтрок.Колонки.Добавить("Исполнитель", Новый ОписаниеТипов("СправочникСсылка.Бригады,
	|СправочникСсылка.ФизическиеЛица"));
	
	ТаблицаСтрок.Колонки.Добавить("ДатаЗапуска", Новый ОписаниеТипов("Дата"));
	ТаблицаСтрок.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));
	ТаблицаСтрок.Колонки.Добавить("ДатаВыпускаПродукцииПолуфабриката", Новый ОписаниеТипов("Дата"));
	ТаблицаСтрок.Колонки.Добавить("Полуфабрикат", Новый ОписаниеТипов("Булево"));
	//-- НЕ УТ
	
	//bercut200220 
	ТаблицаСтрок.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	ТаблицаСтрок.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаСтрок.Колонки.Добавить("СуммаНДС", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СуммаНДСБезВозвратнойТары", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("СуммаБезВозвратнойТары", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("ПроцентАвтоматическойСкидки", ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(5,2));
	ТаблицаСтрок.Колонки.Добавить("СуммаАвтоматическойСкидки", ОписаниеТиповДенежногоПоля);
	ТаблицаСтрок.Колонки.Добавить("ЦенаСоСкидкой", ОписаниеТиповДенежногоПоля);	
	ТаблицаСтрок.Колонки.Добавить("ПроцентОбщий", ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(5,2));
	ТаблицаСтрок.Колонки.Добавить("СуммаПроцентОбщий", ОписаниеТиповДенежногоПоля);
	//
	
	КопированиеСтрокСерверЛокализация.ИнициализироватьТаблицуБуфераОбмена(ТаблицаСтрок);
	
	Возврат ТаблицаСтрок;
	
КонецФункции
