
&НаКлиенте
Процедура Рин1_УстановитьСтатусДействуетПеред(Команда)
	
	//bercut 200320 //bercut задача 132п2 - не даем полюзователю с ограниченными правами менять статус
	Если не Рин1_ОбщийМодуль2.ЕстьПравоНаИзменениеДоговора() Тогда	
		Сообщить("Отсутствует право на изменение статуса. Обратитесь к пользователю с полными правами!");
		Элементы.Список.ВыделенныеСтроки.Очистить();
		Возврат;
	КонецЕсли;
	//
	
КонецПроцедуры

&НаКлиенте
Процедура Рин1_УстановитьСтатусНеСогласованПеред(Команда)
	
	//bercut 200320 //bercut задача 132п2 - не даем полюзователю с ограниченными правами менять статус
	Если не Рин1_ОбщийМодуль2.ЕстьПравоНаИзменениеДоговора() Тогда	
		Сообщить("Отсутствует право на изменение статуса. Обратитесь к пользователю с полными правами!");
		Элементы.Список.ВыделенныеСтроки.Очистить();
		Возврат;
	КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура Рин1_УстановитьСтатусЗакрытПеред(Команда)
	
	//bercut 200320 //bercut задача 132п2 - не даем полюзователю с ограниченными правами менять статус
	Если не Рин1_ОбщийМодуль2.ЕстьПравоНаИзменениеДоговора() Тогда	
		Сообщить("Отсутствует право на изменение статуса. Обратитесь к пользователю с полными правами!");
		Элементы.Список.ВыделенныеСтроки.Очистить();
		Возврат;
	КонецЕсли;
	//
	
КонецПроцедуры
