
&После("ПроверитьКорректностьЗаполненияКонтрагента")
Процедура Рин1_ПроверитьКорректностьЗаполненияКонтрагента(Объект, Контрагент, Отказ)
	
	КлючДанных = ?(ТипЗнч(Объект) = Тип("УправляемаяФорма"), Неопределено, Объект);
	
//{{20200826 ГлазуновДВ	
	Если Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Возврат;
	КонецЕсли;
//}}20200826 ГлазуновДВ	
	
	Если не ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		ТекстОшибки = НСтр("ru = 'Поле ИНН контрагента обязательно для заполнения';
		|en = 'There is no TIN'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, КлючДанных, "ИНН", , Отказ);		
		
	КонецЕсли;
	
КонецПроцедуры
