
&НаКлиенте
Процедура УстановитьОформление(ТекДанные)
	Если ТипЗнч(ТекДанные) = Тип("ДанныеФормыСтруктура") Тогда 
		СписокЦеновыхГрупп.Отбор.Элементы.Очистить();
		ОтборЭлемента = СписокЦеновыхГрупп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Производитель");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = ТекДанные.Производитель;
		
		ОтборЭлемента = СписокЦеновыхГрупп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Иерархия");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Элементы.Список.ТекущаяСтрока;
	иначе
		Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.ГИГ_ИерархияЦеновыхГрупп") Тогда 
			Если ЗначениеЗаполнено(Производитель) Тогда 
				СписокЦеновыхГрупп.Отбор.Элементы.Очистить();
				ОтборЭлемента = СписокЦеновыхГрупп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Производитель");
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = Производитель;
				
				ОтборЭлемента = СписокЦеновыхГрупп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Иерархия");
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = Элементы.Список.ТекущаяСтрока;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	УстановитьОформление(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораПроизводителяПриИзменении(Элемент)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	СписокЦеновыхГрупп.Отбор.Элементы.Очистить();
	Список.Отбор.Элементы.Очистить();
	
	// очистим пользовательские настройки
	Для каждого Настройка из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы цикл
		Если ТипЗНЧ(Настройка) = Тип("ОтборКомпоновкиДанных") Тогда 
			Настройка.Элементы.Очистить();
			//Настройка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
		КонецЕсли; 
	КонецЦикла;
	
	
	ОтборЭлемента = СписокЦеновыхГрупп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Производитель");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Производитель;
	
	ОтборЭлемента = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Производитель");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Производитель;
	
	УстановитьОформление(ТекДанные);
КонецПроцедуры

&НаСервере
Процедура СписокЦеновыхГруппПеретаскиваниеНаСервере(Массив, СтандартнаяОбработка, ЭлементИерархии)
	ОбновитьСписок = Ложь;
	
	Для Каждого ЦеноваяГруппа Из Массив Цикл
		ЦеноваяГруппаОбъект = ЦеноваяГруппа.ПолучитьОбъект();	
		Если ЦеноваяГруппаОбъект.Иерархия <> ЭлементИерархии Тогда
			ЦеноваяГруппаОбъект.Иерархия = ЭлементИерархии;
			ЦеноваяГруппаОбъект.Записать();
			ОбновитьСписок = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ОбновитьСписок Тогда
		Элементы.СписокЦеновыхГрупп.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЦеновыхГруппПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
 	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
 	СтандартнаяОбработка = Ложь;
	ИерархияЦГ = Строка;
	МассивЭлементовЦГ  = ПараметрыПеретаскивания.Значение;
	СписокЦеновыхГруппПеретаскиваниеНаСервере(МассивЭлементовЦГ,СтандартнаяОбработка,ИерархияЦГ)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновлениеФормыСписка" Тогда 
		Элементы.Список.Обновить();
		Элементы.СписокЦеновыхГрупп.Обновить(); 
		ТекДанные = Элементы.Список.ТекущиеДанные;
		УстановитьОформление(ТекДанные);
	КонецЕсли;	
КонецПроцедуры

