
//ФормаГотоваКРедактированию - первым открытием платформа активизирует первые строки в ТЗ на форме и время и минуты в УстановленнаяДатаВремя исчезают

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаВремя") Тогда
		Г =  Год(Параметры.ДатаВремя); 
		М =  Месяц(Параметры.ДатаВремя); 
		Д =  День(Параметры.ДатаВремя); 
		Ч =  Час(Параметры.ДатаВремя); 
		Ми = Минута(Параметры.ДатаВремя);
		Календарь = Дата(Г,М,Д,Ч,Ми,0);
	Иначе 	
		Календарь = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") Тогда
		НачалоРаботыПодразделения = Час(Параметры.Подразделение.НачалоИнтервалаПланирования);
		ОкончаниеРаботыПодразделения = Час(Параметры.Подразделение.ОкончаниеИнтервалаПланирования);
	Иначе 
		НачалоРаботыПодразделения = 0;
		ОкончаниеРаботыПодразделения = 100; 
	КонецЕсли;
	
	Элементы.Календарь.ВыделенныеДаты.Добавить(Календарь);
	УстановленнаяДатаВремя = Календарь;
	Элементы.УстановленнаяДатаВремя.ФорматРедактирования = "ДФ='dd.MM.yyyy HH:mm'";
	
	//
	Запрос = Новый Запрос; //шаг 1
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	0 КАК Ч1,
	|	1 КАК Ч2,
	|	2 КАК Ч3,
	|	3 КАК Ч4,
	|	4 КАК Ч5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	6,
	|	7,
	|	8,
	|	9
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10,
	|	11,
	|	12,
	|	13,
	|	14
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	15,
	|	16,
	|	17,
	|	18,
	|	19
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	20,
	|	21,
	|	22,
	|	23,
	|	NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Часы.Загрузить(РезультатЗапроса.Выгрузить());
	
	//
	Запрос = Новый Запрос;  //шаг 10
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	0 КАК М1,
	|	15 КАК М2,
	|	30 КАК М3,
	|	45 КАК М4";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Минуты.Загрузить(РезультатЗапроса.Выгрузить());
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗ_ЧасыПриАктивизацииЯчейки(Элемент)
	
	Элементы.ТЗ_Часы.ВыделенныеСтроки.Очистить();
	
	Если ФормаГотоваКРедактированию Тогда
		
		Час = ПолучитьЧас(Элемент.ТекущаяСтрока,Элемент.ТекущийЭлемент.Имя);
		
		Г =  Год(УстановленнаяДатаВремя); 
		М =  Месяц(УстановленнаяДатаВремя); 
		Д =  День(УстановленнаяДатаВремя); 
		//Ч =  Час(УстановленнаяДатаВремя); 
		Ми = Минута(УстановленнаяДатаВремя);
		
		УстановленнаяДатаВремя = Дата(Г,М,Д,Час,Ми,0);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЧас(Строка,ИмяКолонки)
	
	СтрокаТЗ = ТЗ_Часы.Получить(Строка);
	Возврат(СтрокаТЗ[ИмяКолонки]);  
	
КонецФункции

&НаКлиенте
Процедура ТЗ_МинутыПриАктивизацииЯчейки(Элемент)
	
	Элементы.ТЗ_Минуты.ВыделенныеСтроки.Очистить();
	
	Если ФормаГотоваКРедактированию Тогда
		
		Минуты = ПолучитьМинуты(Элемент.ТекущаяСтрока,Элемент.ТекущийЭлемент.Имя);
		
		Г =  Год(УстановленнаяДатаВремя); 
		М =  Месяц(УстановленнаяДатаВремя); 
		Д =  День(УстановленнаяДатаВремя); 
		Ч =  Час(УстановленнаяДатаВремя); 
		//Ми = Минута(УстановленнаяДатаВремя);
		
		УстановленнаяДатаВремя = Дата(Г,М,Д,Ч,Минуты,0);
	Иначе 
		ФормаГотоваКРедактированию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМинуты(Строка,ИмяКолонки)
	
	СтрокаТЗ = ТЗ_Минуты.Получить(Строка);
	Возврат(СтрокаТЗ[ИмяКолонки]);  
	
КонецФункции

&НаКлиенте
Процедура КалендарьПриАктивизацииДаты(Элемент)
	
	ДатаКалендаря = Элементы.Календарь.ВыделенныеДаты[0];
	
	Г =  Год(ДатаКалендаря); 
	М =  Месяц(ДатаКалендаря); 
	Д =  День(ДатаКалендаря); 
	Ч =  Час(УстановленнаяДатаВремя); 
	Ми = Минута(УстановленнаяДатаВремя);
	
	УстановленнаяДатаВремя = Дата(Г,М,Д,Ч,Ми,0);
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	Закрыть(УстановленнаяДатаВремя);
КонецПроцедуры

