// + [Rineco], [Киселев А.] [26.07.2021] 
// Задача: [№ 11799], [#ДобавитьОтборСписка]
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Перевозчик") Тогда
		
		ВидСравненияСписка = ВидСравненияКомпоновкиДанных.Равно;
		
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Перевозчик", Параметры.Перевозчик, ВидСравненияСписка);
		
	КонецЕсли;
		
	// + [Rineco], [Киселев А.Н.] [16.09.2021] 
	// Задача: [№ 17281], [#Распределение услуг по аналитике]
	
	Если Параметры.Свойство("МножественныйВыбор") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Список","МножественныйВыбор",Истина);
		
	КонецЕсли;
	
	// - [Rineco], [Киселев А.Н.] [16.09.2021]
		
		
	

КонецПроцедуры

// - [Rineco], [Киселев А.] [26.07.2021]