
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Товары.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище));
//{{20201008 ГлазуновДВ	
	ЭтотОбъект.Заголовок = Строка(Параметры.Ссылка);
//Товары.КоличествоУпаковок
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.ПодчиненныеЭлементы.ТоварыКоличествоУпаковок.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоУпаковок");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоУпаковок1");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
//Товары.Сумма
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.ПодчиненныеЭлементы.ТоварыСумма.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Сумма");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Сумма1");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
//Товары.СуммаРучнойСкидки
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.ПодчиненныеЭлементы.ТоварыСуммаРучнойСкидки.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.СуммаРучнойСкидки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.СуммаРучнойСкидки1");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
//Товары.СуммаНДС
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.ПодчиненныеЭлементы.ТоварыСуммаСНДС.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.СуммаСНДС_ПосчитанаНеВерно_Булево");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
//}}20201008 ГлазуновДВ	
	
	СуммаСНДС = Параметры.СуммаСНДС;
	СуммаДокумента = Параметры.СуммаДокумента;
	СуммаКОплате = Параметры.СуммаКОплате;
	ПорядокРасчетовПоНакладным = Параметры.ПорядокРасчетовПоНакладным;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	Элемент.Подсказка = "";
	Если Элемент.ТекущийЭлемент <> Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя = "ТоварыКоличествоУпаковок" И Элемент.ТекущиеДанные.КоличествоУпаковок <> Элемент.ТекущиеДанные.КоличествоУпаковок1 Тогда
			Элемент.Подсказка = Элемент.ТекущиеДанные.КоличествоУпаковок1;
		КонецЕсли;
		Если Элемент.ТекущийЭлемент.Имя = "ТоварыСуммаРучнойСкидки" И Элемент.ТекущиеДанные.СуммаРучнойСкидки <> Элемент.ТекущиеДанные.СуммаРучнойСкидки1 Тогда
			Элемент.Подсказка = Элемент.ТекущиеДанные.СуммаРучнойСкидки1;
		КонецЕсли;
		Если Элемент.ТекущийЭлемент.Имя = "ТоварыСумма" И Элемент.ТекущиеДанные.Сумма <> Элемент.ТекущиеДанные.Сумма1 Тогда
			Элемент.Подсказка = Элемент.ТекущиеДанные.Сумма1;
		КонецЕсли;
		Если Элемент.ТекущийЭлемент.Имя = "ТоварыСуммаСНДС" И Элемент.ТекущиеДанные.СуммаСНДС_ПосчитанаНеВерно_Булево Тогда
			Элемент.Подсказка = "Проверьте сумму НДС";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииПоля(Элемент)
	// Вставить содержимое обработчика.
	//Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьАвто;
	Элемент.Подсказка = "";
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыКоличествоУпаковок" И Элемент.ТекущиеДанные.КоличествоУпаковок <> Элемент.ТекущиеДанные.КоличествоУпаковок1 Тогда
		Элемент.Подсказка = Элемент.ТекущиеДанные.КоличествоУпаковок1;
	КонецЕсли;
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыСуммаРучнойСкидки" И Элемент.ТекущиеДанные.СуммаРучнойСкидки <> Элемент.ТекущиеДанные.СуммаРучнойСкидки1 Тогда
		Элемент.Подсказка = Элемент.ТекущиеДанные.СуммаРучнойСкидки1;
	КонецЕсли;
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыСумма" И Элемент.ТекущиеДанные.Сумма <> Элемент.ТекущиеДанные.Сумма1 Тогда
		Элемент.Подсказка = Элемент.ТекущиеДанные.Сумма1;
	КонецЕсли;
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыСуммаСНДС" И Элемент.ТекущиеДанные.СуммаСНДС_ПосчитанаНеВерно_Булево Тогда
		Элемент.Подсказка = "Проверьте сумму НДС";
	КонецЕсли;
КонецПроцедуры
