

Процедура ОтразитьНеЛиквидныеТоварыПриход(Объект,Движения,ТаблицаНоменклатуры) Экспорт
				
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("ТаблицаНоменклатуры",ТаблицаНоменклатуры);
		ПараметрыЗапроса.Вставить("ДатаДокумента",Объект.Дата);
		ПараметрыЗапроса.Вставить("Менеджер",Объект.Менеджер);
		ПараметрыЗапроса.Вставить("ДатаДокумента",Объект.Дата);
		
		ТаблицаНоменклатурыВСегментеНеЛиквид = ОбщегоНазначенияУТ.ЗапросВыполнитьВыгрузить(ТекстЗапросаНеЛиквидныеТоварыПриход(),ПараметрыЗапроса);
	
		Если ТаблицаНоменклатурыВСегментеНеЛиквид.Количество() > 0 Тогда	
			
			ДвиженияРасчеты = Движения.Рин1_НеЛиквидныеТовары;		
			ДвиженияРасчеты.Записывать = Истина;
			ДвиженияРасчеты.Загрузить(ТаблицаНоменклатурыВСегментеНеЛиквид);
			
		КонецЕсли;
	
КонецПроцедуры         

//Функция ТекстЗапросаНеЛиквидныеТоварыПриход()
//	
//	Возврат "ВЫБРАТЬ
//	        |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
//	        |	ТаблицаНоменклатуры.Количество КАК Количество,
//	        |	ТаблицаНоменклатуры.ВариантОбеспечения КАК ВариантОбеспечения,
//	        |	ТаблицаНоменклатуры.Отменено КАК Отменено,
//	        |	ТаблицаНоменклатуры.КодСтроки КАК КодСтроки,
//	        |	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
//	        |	ТаблицаНоменклатуры.Склад КАК Склад
//	        |ПОМЕСТИТЬ ВТ_ТаблицаТоваров
//	        |ИЗ
//	        |	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
//	        |;
//	        |
//	        |////////////////////////////////////////////////////////////////////////////////
//	        |ВЫБРАТЬ
//	        |	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
//	        |	ВТ_ТаблицаТоваров.Количество КАК Количество,
//	        |	НоменклатураСегмента.Сегмент КАК Сегмент,
//	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	        |	ВЫРАЗИТЬ(&ДатаДокумента КАК ДАТА) КАК Период,
//	        |	&Менеджер КАК Менеджер,
//	        |	ВТ_ТаблицаТоваров.КодСтроки КАК КодСтроки,
//	        |	ВТ_ТаблицаТоваров.ВариантОбеспечения КАК ВариантОбеспечения,
//	        |	ВТ_ТаблицаТоваров.Характеристика КАК Характеристика,
//	        |	ВТ_ТаблицаТоваров.Склад КАК Склад
//	        |ПОМЕСТИТЬ ВТ_ТоварыВСегментеНеликвидный
//	        |ИЗ
//	        |	ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
//	        |		ПО ВТ_ТаблицаТоваров.Номенклатура = НоменклатураСегмента.Номенклатура
//	        |ГДЕ
//	        |	НЕ ВТ_ТаблицаТоваров.Отменено
//	        |	И НоменклатураСегмента.Сегмент.Код = ""00-00000015""
//	        |;
//	        |
//	        |////////////////////////////////////////////////////////////////////////////////
//	        |ВЫБРАТЬ
//	        |	ВТ_ТоварыВСегментеНеликвидный.Номенклатура КАК Номенклатура,
//	        |	ВТ_ТоварыВСегментеНеликвидный.Сегмент КАК Сегмент,
//	        |	ВТ_ТоварыВСегментеНеликвидный.ВидДвижения КАК ВидДвижения,
//	        |	ВТ_ТоварыВСегментеНеликвидный.Период КАК Период,
//	        |	ВТ_ТоварыВСегментеНеликвидный.Менеджер КАК Менеджер,
//	        |	ВТ_ТоварыВСегментеНеликвидный.КодСтроки КАК КодСтроки,
//	        |	ВЫБОР
//	        |		КОГДА ВТ_ТоварыВСегментеНеликвидный.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада))
//	        |			ТОГДА ВТ_ТоварыВСегментеНеликвидный.Количество
//	        |		ИНАЧЕ 0
//	        |	КОНЕЦ КАК Резерв,
//	        |	ВЫБОР
//	        |		КОГДА ВТ_ТоварыВСегментеНеликвидный.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
//	        |			ТОГДА ВТ_ТоварыВСегментеНеликвидный.Количество
//	        |		ИНАЧЕ 0
//	        |	КОНЕЦ КАК Отгрузка,
//	        |	ВТ_ТоварыВСегментеНеликвидный.Характеристика КАК Характеристика,
//	        |	ВТ_ТоварыВСегментеНеликвидный.Склад КАК Склад
//	        |ПОМЕСТИТЬ ВТ_ТоварыСРесурсами
//	        |ИЗ
//	        |	ВТ_ТоварыВСегментеНеликвидный КАК ВТ_ТоварыВСегментеНеликвидный
//	        |;
//	        |
//	        |////////////////////////////////////////////////////////////////////////////////
//	        |ВЫБРАТЬ
//	        |	ВТ_ТоварыСРесурсами.Номенклатура КАК Номенклатура,
//	        |	ВТ_ТоварыСРесурсами.Сегмент КАК Сегмент,
//	        |	ВТ_ТоварыСРесурсами.ВидДвижения КАК ВидДвижения,
//	        |	ВТ_ТоварыСРесурсами.Период КАК Период,
//	        |	ВТ_ТоварыСРесурсами.Менеджер КАК Менеджер,
//	        |	ВТ_ТоварыСРесурсами.КодСтроки КАК КодСтроки,
//	        |	ВТ_ТоварыСРесурсами.Резерв КАК Резерв,
//	        |	ВТ_ТоварыСРесурсами.Отгрузка КАК Отгрузка,
//	        |	ВТ_ТоварыСРесурсами.Характеристика КАК Характеристика,
//	        |	ВТ_ТоварыСРесурсами.Склад КАК Склад,
//	        |	ЕСТЬNULL(Рин1_СегментыНоменклатурыДата.ДатаСегмента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСегмента
//	        |ПОМЕСТИТЬ ВТ_ТоварыССегментомПоДате
//	        |ИЗ
//	        |	ВТ_ТоварыСРесурсами КАК ВТ_ТоварыСРесурсами
//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Рин1_СегментыНоменклатурыДата КАК Рин1_СегментыНоменклатурыДата
//	        |		ПО ВТ_ТоварыСРесурсами.Номенклатура = Рин1_СегментыНоменклатурыДата.Номенклатура
//	        |ГДЕ
//	        |	(ВТ_ТоварыСРесурсами.Резерв <> 0
//	        |			ИЛИ ВТ_ТоварыСРесурсами.Отгрузка <> 0)
//	        |;
//	        |
//	        |////////////////////////////////////////////////////////////////////////////////
//	        |ВЫБРАТЬ
//	        |	ВТ_ТоварыССегментомПоДате.Номенклатура КАК Номенклатура,
//	        |	ВТ_ТоварыССегментомПоДате.Сегмент КАК Сегмент,
//	        |	ВТ_ТоварыССегментомПоДате.ВидДвижения КАК ВидДвижения,
//	        |	ВТ_ТоварыССегментомПоДате.Период КАК Период,
//	        |	ВТ_ТоварыССегментомПоДате.Менеджер КАК Менеджер,
//	        |	ВТ_ТоварыССегментомПоДате.КодСтроки КАК КодСтроки,
//	        |	ВТ_ТоварыССегментомПоДате.Резерв КАК Резерв,
//	        |	ВТ_ТоварыССегментомПоДате.Отгрузка КАК Отгрузка,
//	        |	ВТ_ТоварыССегментомПоДате.Характеристика КАК Характеристика,
//	        |	ВТ_ТоварыССегментомПоДате.Склад КАК Склад,
//	        |	ВТ_ТоварыССегментомПоДате.ДатаСегмента КАК ДатаСегмента
//	        |ИЗ
//	        |	ВТ_ТоварыССегментомПоДате КАК ВТ_ТоварыССегментомПоДате
//	        |ГДЕ
//	        |	ВТ_ТоварыССегментомПоДате.ДатаСегмента < &ДатаДокумента";
//	
//КонецФункции

Функция ТекстЗапросаНеЛиквидныеТоварыПриход()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	        |	ТаблицаНоменклатуры.Количество КАК Количество,
	        |	ТаблицаНоменклатуры.ВариантОбеспечения КАК ВариантОбеспечения,
	        |	ТаблицаНоменклатуры.Отменено КАК Отменено,
	        |	ТаблицаНоменклатуры.КодСтроки КАК КодСтроки,
	        |	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	        |	ТаблицаНоменклатуры.Склад КАК Склад
			|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
	        |ИЗ
	        |	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
	        |	ВТ_ТаблицаТоваров.Количество КАК Количество,
	        |	НоменклатураСегмента.Сегмент КАК Сегмент,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	        |	ВЫРАЗИТЬ(&ДатаДокумента КАК ДАТА) КАК Период,
	        |	&Менеджер КАК Менеджер,
	        |	ВТ_ТаблицаТоваров.КодСтроки КАК КодСтроки,
	        |	ВТ_ТаблицаТоваров.ВариантОбеспечения КАК ВариантОбеспечения,
	        |	ВТ_ТаблицаТоваров.Характеристика КАК Характеристика,
	        |	ВТ_ТаблицаТоваров.Склад КАК Склад
	        |ПОМЕСТИТЬ ВТ_ТоварыВСегментеНеликвидный
	        |ИЗ
	        |	ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	        |		ПО ВТ_ТаблицаТоваров.Номенклатура = НоменклатураСегмента.Номенклатура
	        |ГДЕ
	        |	НЕ ВТ_ТаблицаТоваров.Отменено
	        |	И НоменклатураСегмента.Сегмент.Код = ""00-00000015""
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТоварыВСегментеНеликвидный.Номенклатура КАК Номенклатура,
	        |	ВТ_ТоварыВСегментеНеликвидный.Сегмент КАК Сегмент,
	        |	ВТ_ТоварыВСегментеНеликвидный.ВидДвижения КАК ВидДвижения,
	        |	ВТ_ТоварыВСегментеНеликвидный.Период КАК Период,
	        |	ВТ_ТоварыВСегментеНеликвидный.Менеджер КАК Менеджер,
	        |	ВТ_ТоварыВСегментеНеликвидный.КодСтроки КАК КодСтроки,
	        |	ВЫБОР
	        |		КОГДА ВТ_ТоварыВСегментеНеликвидный.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада))
	        |			ТОГДА ВТ_ТоварыВСегментеНеликвидный.Количество
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК Резерв,
	        |	ВЫБОР
	        |		КОГДА ВТ_ТоварыВСегментеНеликвидный.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	        |			ТОГДА ВТ_ТоварыВСегментеНеликвидный.Количество
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК Отгрузка,
	        |	ВТ_ТоварыВСегментеНеликвидный.Характеристика КАК Характеристика,
	        |	ВТ_ТоварыВСегментеНеликвидный.Склад КАК Склад
	        |ИЗ
	        |	ВТ_ТоварыВСегментеНеликвидный КАК ВТ_ТоварыВСегментеНеликвидный";
	
КонецФункции



Процедура ОтразитьНеЛиквидныеТоварыРасход(Объект,Движения,ТаблицаНоменклатуры) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТаблицаНоменклатуры",ТаблицаНоменклатуры);
	ПараметрыЗапроса.Вставить("ДатаДокумента",Объект.Дата);
	ПараметрыЗапроса.Вставить("Менеджер",Объект.Менеджер);
	
	ТаблицаНоменклатурыВСегментеНеЛиквид = ОбщегоНазначенияУТ.ЗапросВыполнитьВыгрузить(ТекстЗапросаНеЛиквидныеТоварыРасход(),ПараметрыЗапроса);
	
	Если ТаблицаНоменклатурыВСегментеНеЛиквид.Количество() > 0 Тогда	
		
		ДвиженияРасчеты = Движения.Рин1_НеЛиквидныеТовары;		
		ДвиженияРасчеты.Записывать = Истина;
		ДвиженияРасчеты.Загрузить(ТаблицаНоменклатурыВСегментеНеЛиквид);
		
	КонецЕсли;
	
	
КонецПроцедуры
	
	Функция ТекстЗапросаНеЛиквидныеТоварыРасход()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	        |	ТаблицаНоменклатуры.Количество КАК Количество,
	        |	ТаблицаНоменклатуры.КодСтроки КАК КодСтроки,
	        |	ТаблицаНоменклатуры.ЗаказКлиента КАК ЗаказКлиента,
	        |	ТаблицаНоменклатуры.Характеристика КАК Характеристика
	        |ПОМЕСТИТЬ ВТ_ТаблицаТоваров
	        |ИЗ
	        |	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
	        |	ВТ_ТаблицаТоваров.Количество КАК Отгрузка,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	        |	ВЫРАЗИТЬ(&ДатаДокумента КАК ДАТА) КАК Период,
	        |	&Менеджер КАК Менеджер,
	        |	ВТ_ТаблицаТоваров.КодСтроки КАК КодСтроки
	        |ИЗ
	        |	ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Рин1_НеЛиквидныеТовары КАК Рин1_НеЛиквидныеТовары
	        |		ПО ВТ_ТаблицаТоваров.ЗаказКлиента = Рин1_НеЛиквидныеТовары.Регистратор.Ссылка
	        |			И ВТ_ТаблицаТоваров.Номенклатура = Рин1_НеЛиквидныеТовары.Номенклатура.Ссылка
	        |			И ВТ_ТаблицаТоваров.КодСтроки = Рин1_НеЛиквидныеТовары.КодСтроки
	        |			И ВТ_ТаблицаТоваров.Характеристика = Рин1_НеЛиквидныеТовары.Характеристика
	        |ГДЕ
	        |	НЕ Рин1_НеЛиквидныеТовары.Номенклатура ЕСТЬ NULL";
	
КонецФункции