
&Вместо("ЗаполнитьРеквизитыПоПеревозчику")
Процедура Рин1_ЗаполнитьРеквизитыПоПеревозчику(ЭлементыФормы, ДокОбъект, ДопИнфоИзмененоПользователем)
	
	ПустыеРеквизиты = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(ДокОбъект);
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, ПустыеРеквизиты,
	"АдресДоставкиПеревозчика, АдресДоставкиПеревозчикаЗначенияПолей, ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо");
	Если Не ДопИнфоИзмененоПользователем Тогда
		ДокОбъект.ДополнительнаяИнформацияПоДоставке = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокОбъект.ПеревозчикПартнер)
		И ЭлементыФормы.АдресДоставкиПеревозчика.СписокВыбора.Количество() > 0 Тогда
		ПерваяСтруктураВСписке = ЭлементыФормы.АдресДоставкиПеревозчика.СписокВыбора[0].Значение;
		ЗаполнитьЗначенияСвойств(ДокОбъект,ПерваяСтруктураВСписке,
		"ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо");
		//bercut130220
		Если ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
			Если не ДокОбъект.ПеревозчикПартнер.КонтактнаяИнформация.Количество() = 0 Тогда
				ДокОбъект.АдресДоставкиПеревозчика = ДокОбъект.ПеревозчикПартнер.КонтактнаяИнформация[0].Представление;
				ДокОбъект.АдресДоставкиПеревозчикаЗначенияПолей = ДокОбъект.ПеревозчикПартнер.КонтактнаяИнформация[0].ЗначенияПолей;
			Иначе 
				ДокОбъект.АдресДоставкиПеревозчика = ПерваяСтруктураВСписке.АдресДоставки;
				ДокОбъект.АдресДоставкиПеревозчикаЗначенияПолей = ПерваяСтруктураВСписке.АдресДоставкиЗначенияПолей;
			КонецЕсли;
		Иначе 
			ДокОбъект.АдресДоставкиПеревозчика = ПерваяСтруктураВСписке.АдресДоставки;
			ДокОбъект.АдресДоставкиПеревозчикаЗначенияПолей = ПерваяСтруктураВСписке.АдресДоставкиЗначенияПолей;
		КонецЕсли;
		//
		Если Не ДопИнфоИзмененоПользователем Тогда
			ДокОбъект.ДополнительнаяИнформацияПоДоставке = ПерваяСтруктураВСписке.ДополнительнаяИнформацияПоДоставке;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&После("ПриИзмененииСпособаДоставки")
Процедура Рин1_ПриИзмененииСпособаДоставки(ЭлементыФормы, ДокОбъект)
	// Вставить содержимое метода.
	ДокОбъект.ПеревозчикПартнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	ДокОбъект.АдресДоставкиПеревозчика = "";
	ДокОбъект.ДополнительнаяИнформацияПоДоставке = "";
	ДокОбъект.ОсобыеУсловияПеревозкиОписание = "";
КонецПроцедуры

&Вместо("ДополнитьИнформациюПоДоставкеКонтактами")
Процедура Рин1_ДополнитьИнформациюПоДоставкеКонтактами(Объект)
	ТипыКИ = Новый Массив;
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
//{{20201101 ГлазуновДВ
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
//}}20201101 ГлазуновДВ
	
	ИсточникиКИ = Новый Массив;
	КонтактноеЛицо = Неопределено;
	Объект.Свойство("КонтактноеЛицо", КонтактноеЛицо);
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		ИсточникиКИ.Добавить(КонтактноеЛицо);
	КонецЕсли;
	
	СпособДоставки = Неопределено;
	Объект.Свойство("СпособДоставки",СпособДоставки);
	
	Если СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи
		Или СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		ПеревозчикПартнер = Объект.ПеревозчикПартнер;
		ИсточникиКИ.Добавить(ПеревозчикПартнер);
	Иначе
		ПолучательОтправитель = ПолучательОтправитель(Объект);
		ИсточникиКИ.Добавить(ПолучательОтправитель.Значение);
	КонецЕсли;
	
	Для Каждого Источник Из ИсточникиКИ Цикл
		Если Не ЗначениеЗаполнено(Источник) Тогда
			Продолжить;
		КонецЕсли;
		ИсточникПараметр = Новый Массив;
		ИсточникПараметр.Добавить(Источник);
		КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ИсточникПараметр, ТипыКИ, , ТекущаяДатаСеанса());
		КонтактнаяИнформацияЗаполнена = Ложь;
		Если КонтактнаяИнформация.Количество() > 0 Тогда
			ТекстТелефоны = Строка(Источник) + ": ";
			Для Каждого Стр Из КонтактнаяИнформация Цикл
				Если ЗначениеЗаполнено(Стр.Представление) Тогда
					КонтактнаяИнформацияЗаполнена = Истина;
					ТекстТелефоны = ТекстТелефоны + Стр.Представление + ", ";
				КонецЕсли;
			КонецЦикла;
			ТекстТелефоны = Лев(ТекстТелефоны, СтрДлина(ТекстТелефоны)-2) + ".";
			Если КонтактнаяИнформацияЗаполнена
				И СтрНайти(Объект.ДополнительнаяИнформацияПоДоставке, ТекстТелефоны) = 0 Тогда
				Если ЗначениеЗаполнено(Объект.ДополнительнаяИнформацияПоДоставке) Тогда
					Объект.ДополнительнаяИнформацияПоДоставке = Объект.ДополнительнаяИнформацияПоДоставке + Символы.ПС;
				КонецЕсли;
				Объект.ДополнительнаяИнформацияПоДоставке = Объект.ДополнительнаяИнформацияПоДоставке + ТекстТелефоны;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//++Шерстюк Ю.Ю. 16.03.2021 по задаче 3731 убираем "интелектуальное" заполнение из последних заданий на перевозку.
&Вместо("ПоследниеРеквизитыДоставкиИзЗаданий")
Функция Рин1_ПоследниеРеквизитыДоставкиИзЗаданий(ПолучательОтправитель, Перевозчик)   
	тз = Новый ТаблицаЗначений;
	
	Возврат тз;
КонецФункции

&Вместо("ПоследниеРеквизитыДоставкиИзРаспоряжений")
Функция Рин1_ПоследниеРеквизитыДоставкиИзРаспоряжений(ОбъектСсылка, ПолучательОтправитель, Перевозчик)
	//++Шерстюк Ю.Ю. Задача № 7191 переопределяем заполнение адресов доставки, исключаем самовывоз
	 Запрос = Новый Запрос("ВЫБРАТЬ
							|	СостоянияИРеквизитыДоставки.СпособДоставки КАК СсылкаСпособДоставки,
							|	СостоянияИРеквизитыДоставки.Адрес КАК АдресДоставки,
							|	МАКСИМУМ(СостоянияИРеквизитыДоставки.Распоряжение) КАК Ссылка,
							|	МАКСИМУМ(СостоянияИРеквизитыДоставки.Распоряжение.Дата) КАК РаспоряжениеДата
							|ПОМЕСТИТЬ ВТ_Адреса
							|ИЗ
							|	РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
							|ГДЕ
							|	(СостоянияИРеквизитыДоставки.ПолучательОтправитель = &ПолучательОтправитель
							|			ИЛИ &ПолучательОтправитель = НЕОПРЕДЕЛЕНО)
							|	И (СостоянияИРеквизитыДоставки.Перевозчик = &Перевозчик
							|				И СостоянияИРеквизитыДоставки.Распоряжение.АдресДоставкиПеревозчика <> """"
							|			ИЛИ &Перевозчик = НЕОПРЕДЕЛЕНО
							|				И СостоянияИРеквизитыДоставки.Адрес <> """")
							|	И СостоянияИРеквизитыДоставки.СпособДоставки <> &СпособДоставкиСамовывоз
							|
							|СГРУППИРОВАТЬ ПО
							|	СостоянияИРеквизитыДоставки.СпособДоставки,
							|	СостоянияИРеквизитыДоставки.Адрес
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВТ_Адреса.СсылкаСпособДоставки КАК СсылкаСпособДоставки,
							|	ВТ_Адреса.АдресДоставки КАК АдресДоставки,
							|	ВТ_Адреса.Ссылка КАК Ссылка
							|ИЗ
							|	ВТ_Адреса КАК ВТ_Адреса
							|
							|УПОРЯДОЧИТЬ ПО
							|	ВТ_Адреса.РаспоряжениеДата ");
	 Запрос.УстановитьПараметр("ПолучательОтправитель",ПолучательОтправитель);
	 Запрос.УстановитьПараметр("Перевозчик",Перевозчик);
	 Запрос.УстановитьПараметр("СпособДоставкиСамовывоз",Перечисления.СпособыДоставки.Самовывоз);
	 Возврат Запрос.Выполнить().Выгрузить();
	 //--Шерстюк Ю.Ю.
	 //тз = Новый ТаблицаЗначений;
	//
	//Возврат тз;
КонецФункции


&После("ПриИзмененииПолучателяОтправителя")
Процедура Рин1_ПриИзмененииПолучателяОтправителя(ЭлементыФормы, ДокОбъект, ПараметрыЗаполнения)
	//++Шерстюк Ю.Ю. Задача № 7191 поле оставляем пустое, чтобы пользователь осознано заполнял его
	ДокОбъект.АдресДоставки = "";
	//--Шерстюк Ю.Ю.
КонецПроцедуры

&Вместо("ТекстЗапросаВтРаспоряженияНаДоставку")
Функция Рин1_ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям)
	ТекстЗапроса = "";
	
	Если ДоставкаПолучателям Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
		//++Шерстюк Ю.Ю. 22.04.2021
		|,
		|ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
		|	ИНАЧЕ Значение(Справочник.Приоритеты.ПустаяСсылка)
		|КОНЕЦ КАК Приоритет
        //--Шерстюк Ю.Ю.
		|ПОМЕСТИТЬ РаспоряженияНаДоставку
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
		|		ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад)
		|			И (ТоварыКДоставке.ВсеТовары)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	(ТоварыКДоставке.Распоряжение ЕСТЬ NULL
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПодбор
		|			ИЛИ НЕ ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен)
		|	И РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиКПолучателю)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомКПолучателю)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиКПолучателю)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомКПолучателю)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение,
		|	РаспоряженияНаДоставку.Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
		//++Шерстюк Ю.Ю. 22.04.2021
		|,
		|ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
		|	ИНАЧЕ Значение(Справочник.Приоритеты.ПустаяСсылка)
		|КОНЕЦ

		//--Шерстюк Ю.Ю.		
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
		|		ПО (РаспоряженияЗадания.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (РаспоряженияЗадания.Склад = РаспоряженияНаДоставку.Склад)
		|			И (РаспоряженияЗадания.Ссылка = &ЗаданиеНаПеревозкуПодбор)
		|			И (РаспоряженияНаДоставку.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка))
		|ГДЕ
		|	(&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение,
		|	Склад";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер КАК Номер,
		|	РаспоряженияНаДоставку.Дата КАК Дата,
		|	РаспоряженияНаДоставку.Адрес КАК Адрес,
		|	РаспоряженияНаДоставку.АдресЗначенияПолей КАК АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
		|	РаспоряженияНаДоставку.Зона КАК Зона,
		|	РаспоряженияНаДоставку.Перевозчик КАК Перевозчик,
		|	РаспоряженияНаДоставку.ВремяС КАК ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	ВЫБОР
		|		КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		|		ИНАЧЕ РаспоряженияНаДоставку.Адрес
		|	КОНЕЦ КАК ПолеУпорядочения
		//++Шерстюк Ю.Ю. 23.04.2021
		|,
		//|ВЫБОР
		//|	КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		//|		ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		//|	ИНАЧЕ РаспоряженияНаДоставку.Адрес
		//|КОНЕЦ КАК ПолеУпорядочения,
		|ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
		|	ИНАЧЕ Значение(Справочник.Приоритеты.ПустаяСсылка)
		|КОНЕЦ КАК Приоритет
		//--Шерстюк Ю.Ю.
		|ПОМЕСТИТЬ РаспоряженияНаДоставку
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
		|		ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад)
		|			И (ТоварыКДоставке.ВсеТовары)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	(ТоварыКДоставке.Распоряжение ЕСТЬ NULL
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПодбор
		|			ИЛИ НЕ ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен)
		|	И РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (НЕ (РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса)
		|		ИЛИ (НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|			 И НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.Адрес,
		|	РаспоряженияНаДоставку.АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
		|	ВЫБОР
		|		КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		|		ИНАЧЕ РаспоряженияНаДоставку.Адрес
		|	КОНЕЦ
		//++Шерстюк Ю.Ю. 23.04.2021
		|,
		|ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
		|	ИНАЧЕ Значение(Справочник.Приоритеты.ПустаяСсылка)
		|КОНЕЦ
		//--Шерстюк Ю.Ю. 23.04.2021
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
		|		ПО (РаспоряженияЗадания.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (РаспоряженияЗадания.Склад = РаспоряженияНаДоставку.Склад)
		|			И (РаспоряженияЗадания.Ссылка = &ЗаданиеНаПеревозкуПодбор)
		|			И (РаспоряженияНаДоставку.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка))
		|ГДЕ
		|	(&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (НЕ (РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса)
		|		ИЛИ (НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|			 И НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение,
		|	РаспоряженияНаДоставку.Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	NULL КАК Номер,
		|	РаспоряженияНаДоставку.Дата,
		|	NULL КАК Адрес,
		|	NULL КАК АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		//++Шерстюк Ю.Ю. 23.04.2021
		|,
		|ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
		|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
		|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
		|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
		|	ИНАЧЕ Значение(Справочник.Приоритеты.ПустаяСсылка)
		|КОНЕЦ
		//--Шерстюк Ю.Ю. 23.04.2021
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|		ИЛИ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение,
		|	Склад";
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

&Вместо("ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме")
Функция Рин1_ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЧастичноДоставленныеЗаказы.Склад             КАК Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение      КАК Распоряжение,
	|	РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|	РаспоряженияНаДоставку.Зона                  КАК Зона,
	|	РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|	NULL                                         КАК ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура      КАК Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика    КАК Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение        КАК Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия             КАК Серия,
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество) КАК Количество
	//++Шерстюк Ю.Ю. 23.04.2021
	|,
	|РаспоряженияНаДоставку.Приоритет КАК Приоритет
	//--Шерстюк Ю.Ю.
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюПоОрдернойСхеме
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ЧастичноДоставленныеЗаказы
	|		ПО РаспоряженияНаДоставку.Распоряжение = ЧастичноДоставленныеЗаказы.Распоряжение
	|			И РаспоряженияНаДоставку.Склад = ЧастичноДоставленныеЗаказы.Склад
	|			И (НЕ ЧастичноДоставленныеЗаказы.ВсеТовары)
	|			И (РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				ИЛИ РаспоряженияНаДоставку.СпособДоставки
	|					= ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|ГДЕ
	|	(ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|		И ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку.Проведен
	|			ИЛИ ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичноДоставленныеЗаказы.Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение,
	|	РаспоряженияНаДоставку.ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки,
	|	РаспоряженияНаДоставку.Зона,
	|	РаспоряженияНаДоставку.Перевозчик,
	|	ЧастичноДоставленныеЗаказы.Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия
	//++Шерстюк Ю.Ю. 23.04.2021
	|,
	|РаспоряженияНаДоставку.Приоритет
	//--Шерстюк Ю.Ю.
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество) > 0
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОтгрузкеДетально.ДатаОтгрузки КАК Дата,
	|	ТоварыКОтгрузкеДетально.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеДетально.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ТоварыКОтгрузкеДетально.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеДетально.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеДетально.Серия КАК Серия,
	|	ТоварыКОтгрузкеДетально.Количество КАК Количество,
	|	ТоварыКОтгрузкеДетально.Вес КАК Вес,
	|	ТоварыКОтгрузкеДетально.Объем КАК Объем,
	|	ТоварыКОтгрузкеДетально.Склад КАК Склад,
	|	ТоварыКОтгрузкеДетально.Распоряжение КАК Распоряжение,
	|	ТоварыКОтгрузкеДетально.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) КАК ВидРаспоряжения,
	|	СостоянияИРеквизитыДоставки.Номер КАК Номер,
	|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ТоварыКОтгрузкеДетально.СпособДоставки КАК СпособДоставки,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеДетально.ЭтоПоручениеЭкспедитору
	|			ТОГДА 4
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТоварыКОтгрузкеДетально.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|					ТОГДА 0
	|				КОГДА ТоварыКОтгрузкеДетально.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|					ТОГДА 1
	|				ИНАЧЕ 2
	|			КОНЕЦ + ВЫБОР
	|				КОГДА СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки
	|					ТОГДА 3
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Картинка,
	|	ТоварыКОтгрузкеДетально.Зона КАК Зона,
	|	ТоварыКОтгрузкеДетально.Зона.Представление КАК ЗонаПредставление,
	|	ТоварыКОтгрузкеДетально.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС КАК ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо КАК ВремяПо,
	|	СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеДетально.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеДетально.Перевозчик)
	|		ИНАЧЕ СостоянияИРеквизитыДоставки.Адрес
	|	КОНЕЦ КАК ПолеУпорядочивания
	//++Шерстюк Ю.Ю. 23.04.2021
	|,
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) = ТИП(Документ.ЗаказДавальца)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|		ТОГДА ТоварыКОтгрузкеДетально.Распоряжение.Приоритет
	|	КОГДА ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
	|		ТОГДА ТоварыКОтгрузкеДетально.Распоряжение.Рин1_Приоритет
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|КОНЕЦ КАК Приоритет
	//--Шерстюк Ю.Ю.
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(
	|			ВЫБОР КОГДА
	|				НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|					ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|			КОНЕЦ) КАК ДатаОтгрузки,
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|		КОНЕЦ КАК ПолеГруппировкиПросроченныхДатОтгрузки,
	|		ТоварыСУчетомДоставленных.Номенклатура КАК Номенклатура,
	|		ТоварыСУчетомДоставленных.Характеристика КАК Характеристика,
	|		ТоварыСУчетомДоставленных.Назначение КАК Назначение,
	|		ТоварыСУчетомДоставленных.Серия КАК Серия,
	|		РаспоряженияНаДоставку.Склад                 КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение          КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|		РаспоряженияНаДоставку.Зона                  КАК Зона,
	|		РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке) КАК Количество,      // Количество
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке * &ТекстЗапросаВесУпаковки) КАК Вес,
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке * &ТекстЗапросаОбъемУпаковки) КАК Объем,
	|		ЛОЖЬ КАК ЭтоПоручениеЭкспедитору,
	//++Шерстюк Ю.Ю. 23.04.2021
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
	|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
	|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|КОНЕЦ КАК Приоритет,
	//--Шерстюк Ю.Ю.
	|		ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке КАК ТоварыСУчетомДоставленных
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыСУчетомДоставленных.ДокументОтгрузки = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыСУчетомДоставленных.Склад = РаспоряженияНаДоставку.Склад
	|			И РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|	ГДЕ
	|		ТоварыСУчетомДоставленных.КОтгрузке > 0
	|		И ТоварыСУчетомДоставленных.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		ТоварыСУчетомДоставленных.Номенклатура,
	|		ТоварыСУчетомДоставленных.Характеристика,
	|		ТоварыСУчетомДоставленных.Назначение,
	|		ТоварыСУчетомДоставленных.Серия,
		//++Шерстюк Ю.Ю. 23.04.2021
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
	|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
	|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|КОНЕЦ, 
	//--Шерстюк Ю.Ю.

	|		ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Зона,
	|		NULL,
	|		0,
	|		0,
	|		0,
	|		ИСТИНА,
	//++Шерстюк Ю.Ю. 23.04.2021
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
	|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
	|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|КОНЕЦ, 
	//--Шерстюк Ю.Ю.

	|		ЛОЖЬ
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|		И РаспоряженияНаДоставку.СпособДоставки В (
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
	|			)
	|	) КАК ТоварыКОтгрузкеДетально
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|	ПО ТоварыКОтгрузкеДетально.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|		И ТоварыКОтгрузкеДетально.Склад = СостоянияИРеквизитыДоставки.Склад";
	
	Возврат ТекстЗапроса;
КонецФункции

&Вместо("ТекстЗапросаРаспоряженияНаДоставку")
Функция Рин1_ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление, ЕстьОрдерныйСклад, ЕстьНеОрдерныйСклад, ДоставкаПолучателям)
	Если ВыборочноеОбновление Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбновляемыеРаспоряжения.Распоряжение,
		|	ОбновляемыеРаспоряжения.Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения
		|ИЗ
		|	&ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Распоряжение,
		|	НЕОПРЕДЕЛЕНО КАК Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
		ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям);
	
	ШаблонВыборкаДвиженийКРаспределению = ?(ДоставкаПолучателям,
		"ВЫБРАТЬ
		|	ТаблицыИсточника.Склад                  КАК Склад,
		|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
		|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
		|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
		|	ТаблицыИсточника.Зона                   КАК Зона,
		|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
		|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
		|	ТаблицыИсточника.Характеристика         КАК Характеристика,
		|	ТаблицыИсточника.Назначение             КАК Назначение,
		|	ТаблицыИсточника.Серия                  КАК Серия,
		|	ТаблицыИсточника.Количество             КАК Количество
		//++Шерстюк Ю.Ю. 23.04.2021
		|,
		//|ВЫБОР
		//|	КОГДА ТаблицыИсточника.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
		//|		ТОГДА 2
		//|	КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Высокий""
		//|		ТОГДА 1
		//|	КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Средний""
		//|		ТОГДА 2
		//|	ИНАЧЕ 3
		//|КОНЕЦ КАК Приоритет

		//--Шерстюк Ю.Ю.
		| ТаблицыИсточника.Приоритет как Приоритет 
		|ИЗ
		|	ИмяТаблицыИсточника КАК ТаблицыИсточника",
		"ВЫБРАТЬ
		|	ТаблицыИсточника.Период         КАК Период,
		|	ТаблицыИсточника.Распоряжение   КАК Распоряжение,
		|	ТаблицыИсточника.Номенклатура   КАК Номенклатура,
		|	ТаблицыИсточника.Характеристика КАК Характеристика,
		|	ТаблицыИсточника.Назначение     КАК Назначение,
		|	ТаблицыИсточника.Склад          КАК Склад,
		|	ТаблицыИсточника.Количество     КАК Количество,
		|	ТаблицыИсточника.Вес            КАК Вес,
		|	ТаблицыИсточника.Объем          КАК Объем
		//++Шерстюк Ю.Ю. 23.04.2021
		|,
		| ТаблицыИсточника.Приоритет как Приоритет 
		//|ВЫБОР
		//|	КОГДА ТаблицыИсточника.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
		//|		ТОГДА 2
		//|	КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Высокий""
		//|		ТОГДА 1
		//|	КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Средний""
		//|		ТОГДА 2
		//|	ИНАЧЕ 3
		//|КОНЕЦ КАК Приоритет
		//--Шерстюк Ю.Ю.

		|ИЗ
		|	ИмяТаблицыИсточника КАК ТаблицыИсточника");
	
	ШаблонВыборкаРаспоряжений = 
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Дата                   КАК Дата,
	|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
	|	ТаблицыИсточника.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ТаблицыИсточника.Характеристика         КАК Характеристика,
	|	ТаблицыИсточника.Назначение             КАК Назначение,
	|	ТаблицыИсточника.Серия                  КАК Серия,
	|	ТаблицыИсточника.Количество             КАК Количество,
	|	ТаблицыИсточника.Вес                    КАК Вес,
	|	ТаблицыИсточника.Объем                  КАК Объем,
	|	ТаблицыИсточника.Склад                  КАК Склад,
	|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
	|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
	|	ТаблицыИсточника.ВидРаспоряжения        КАК ВидРаспоряжения,
	|	ТаблицыИсточника.Номер                  КАК Номер,
	|	ТаблицыИсточника.Адрес                  КАК Адрес,
	|	ТаблицыИсточника.АдресЗначенияПолей     КАК АдресЗначенияПолей,
	|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
	|	ТаблицыИсточника.Картинка               КАК Картинка,
	|	ТаблицыИсточника.Зона                   КАК Зона,
	|	ТаблицыИсточника.ЗонаПредставление      КАК ЗонаПредставление,
	|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
	|	ТаблицыИсточника.ВремяС                 КАК ВремяС,
	|	ТаблицыИсточника.ВремяПо                КАК ВремяПо,
	|	ТаблицыИсточника.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ТаблицыИсточника.ПолеУпорядочивания     КАК ПолеУпорядочивания
	//++Шерстюк Ю.Ю. 23.04.2021
	|,
	| ТаблицыИсточника.Приоритет  как Приоритет
	//|	ВЫБОР
	//|		КОГДА ТаблицыИсточника.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	//|			ТОГДА 2
	//|		КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Высокий""
	//|			ТОГДА 1
	//|		КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Средний""
	//|			ТОГДА 2
	//|		ИНАЧЕ 3
	//|	КОНЕЦ КАК Приоритет
	//--Шерстюк Ю.Ю.
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника";
	
	ТекстИсточникиДвиженийКРаспределению = "";
	ТекстИсточникиРаспоряжений = "";
	
	Если ЕстьОрдерныйСклад Тогда
		
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначенияУТ.РазделительЗапросовПакета()
			+ ?(ДоставкаПолучателям,
				ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме(),
				ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме());
		
		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюПоОрдернойСхеме";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
			"ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме",
			"ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме");
		
		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			ИмяТаблицыРаспоряжений);
		
		ТекстИсточникиДвиженийКРаспределению = ТекстИсточникДвиженийКРаспределению;
		ТекстИсточникиРаспоряжений = ТекстИсточникРаспоряжений;
		
	КонецЕсли;
	
	Если ЕстьНеОрдерныйСклад Тогда
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначенияУТ.РазделительЗапросовПакета()
			+ ?(ДоставкаПолучателям,
				ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы(),
				ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы());
		
		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюБезОрдернойСхемы";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
			"ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы",
			"ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы");
		
		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			ИмяТаблицыРаспоряжений);
		
		ТекстИсточникиДвиженийКРаспределению = ?(ПустаяСтрока(ТекстИсточникиДвиженийКРаспределению),
			ТекстИсточникДвиженийКРаспределению,
			ТекстИсточникиДвиженийКРаспределению
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстИсточникДвиженийКРаспределению);
			
		ТекстИсточникиРаспоряжений = ?(ПустаяСтрока(ТекстИсточникиРаспоряжений),
			ТекстИсточникРаспоряжений,
			ТекстИсточникиРаспоряжений
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстИсточникРаспоряжений);
		
	КонецЕсли;
	
	ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = 
		СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			"("
			//++Шерстюк Ю.Ю. 23.04.2021
			
			//+ ТекстИсточникиДвиженийКРаспределению
			+ СтрЗаменить(ТекстИсточникДвиженийКРаспределению,"ТаблицыИсточника.Приоритет"," ВЫБОР КОГДА ТаблицыИсточника.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка) ТОГДА 1 КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Высокий"" ТОГДА 0 КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Средний"" ТОГДА 1 ИНАЧЕ 2 КОНЕЦ ")
			//--Шерстюк Ю.Ю.
			+ ")");
	Если Не ДоставкаПолучателям Тогда
		ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
			+
			"
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицыИсточника.Период";
	КонецЕсли;
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = 
		СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			"("
			//++Шерстюк Ю.Ю. 23.04.2021
			//+ ТекстИсточникиРаспоряжений
			+ СтрЗаменить(ТекстИсточникиРаспоряжений,"ТаблицыИсточника.Приоритет"," ВЫБОР КОГДА ТаблицыИсточника.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка) ТОГДА 1 КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Высокий"" ТОГДА 0 КОГДА ТаблицыИсточника.Приоритет.Наименование = ""Средний"" ТОГДА 1 ИНАЧЕ 2 КОНЕЦ ")
			//--Шерстюк Ю.Ю.
			+ ")");
	
	ТекстЗапросаУпорядочивание = "";
	Если Не ДоставкаПолучателям
		И ЕстьОрдерныйСклад Тогда
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	Иначе
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.ПолеУпорядочивания,
		|	ТаблицыИсточника.ПолучательОтправитель,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	КонецЕсли;
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = ФинальныйТекстЗапросаИсточникиРаспоряжений
		+ ТекстЗапросаУпорядочивание;
	
	ТекстЗапроса = ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовПакета() 
		+ ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
		+ ОбщегоНазначенияУТ.РазделительЗапросовПакета() 
		+ ФинальныйТекстЗапросаИсточникиРаспоряжений;
		
	Если Не ВыборочноеОбновление Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения",
		"ЛЕВОЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	
	Возврат ТекстЗапроса;

КонецФункции

&После("ЗаполнитьПризнакиОформленияРаспоряжений")
Процедура Рин1_ЗаполнитьПризнакиОформленияРаспоряжений(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая)
	ВерхниеСтрокиДерева = РаспоряженияНаДоставку.ПолучитьЭлементы();
 	Для Каждого СтрДерево из ВерхниеСтрокиДерева Цикл 
		//++Шерстюк Ю.Ю. 28.05.2021 в форме док.распоряжение нет такого реквизита, поэтому через попытку
		Попытка
			СтрДерево.Приоритет = 1;
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

&Вместо("ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме")
Функция Рин1_ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме()
		ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
	|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество
	|ПОМЕСТИТЬ ТоварыКДоставкеОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(
	|			,
	|			(Склад, ДокументПоступления) В
	|				(ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Склад,
	|					РаспоряженияНаДоставку.Распоряжение
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					РаспоряженияНаДоставку.ЭтоОрдерныйСклад)) КАК ТоварыКПоступлениюОстатки
	|ГДЕ
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетальныеДанные.Склад КАК Склад,
	|	ДетальныеДанные.Распоряжение КАК Распоряжение,
	|	ДетальныеДанные.Номенклатура КАК Номенклатура,
	|	ДетальныеДанные.Характеристика КАК Характеристика,
	|	ДетальныеДанные.Назначение КАК Назначение,
	|	СУММА(ДетальныеДанные.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыСУчетомДоставленных
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставкеОстатки.Склад КАК Склад,
	|		ТоварыКДоставкеОстатки.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставкеОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставкеОстатки.Характеристика КАК Характеристика,
	|		ТоварыКДоставкеОстатки.Назначение КАК Назначение,
	|		ТоварыКДоставкеОстатки.Количество КАК Количество
	|	ИЗ
	|		ТоварыКДоставкеОстатки КАК ТоварыКДоставкеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКДоставкеОстатки.Склад,
	|		ТоварыКДоставкеОстатки.Распоряжение,
	|		ТоварыКДоставкеОстатки.Номенклатура,
	|		ТоварыКДоставкеОстатки.Характеристика,
	|		ТоварыКДоставкеОстатки.Назначение,
	|		-ЕСТЬNULL(ТоварыКДоставке.Количество, 0)
	|	ИЗ
	|		ТоварыКДоставкеОстатки КАК ТоварыКДоставкеОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО ТоварыКДоставкеОстатки.Склад = ТоварыКДоставке.Склад
	|				И ТоварыКДоставкеОстатки.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И ТоварыКДоставкеОстатки.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И ТоварыКДоставкеОстатки.Характеристика = ТоварыКДоставке.Характеристика
	|				И ТоварыКДоставкеОстатки.Назначение = ТоварыКДоставке.Назначение
	|	ГДЕ
	|		(ТоварыКДоставке.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|					И ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен
	|				ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|		И НЕ ТоварыКДоставке.ВсеТовары) КАК ДетальныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Склад,
	|	ДетальныеДанные.Распоряжение,
	|	ДетальныеДанные.Номенклатура,
	|	ДетальныеДанные.Характеристика,
	|	ДетальныеДанные.Назначение
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДетальныеДанные.Количество) > 0
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКПоступлению.Период КАК Период,
	|	ТоварыКПоступлению.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлению.Характеристика КАК Характеристика,
	|	ТоварыКПоступлению.Назначение КАК Назначение,
	|	ТоварыКПоступлению.Склад КАК Склад,
	|	ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) КАК Количество,
	|	ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) * &ТекстЗапросаОбъемУпаковки КАК Объем
	//++Шерстюк Ю.Ю. 14.05.2021
	|,
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлению.ДокументПоступления) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлению.ДокументПоступления) = ТИП(Документ.ЗаказДавальца)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлению.ДокументПоступления) = ТИП(Документ.ЗаказПереработчику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлению.ДокументПоступления) = ТИП(Документ.ЗаказПоставщику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлению.ДокументПоступления) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|		ТОГДА ТоварыКПоступлению.ДокументПоступления.Приоритет
	//Поручение экспедитору не является распоряжением на поступление
	//|	КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлению.ДокументПоступления) = ТИП(Документ.ПоручениеЭкспедитору)
	//|		ТОГДА ТоварыКПоступлению.ДокументПоступления.Рин1_Приоритет
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|КОНЕЦ КАК Приоритет
	//--Шерстюк Ю.Ю.

	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюПоОрдернойСхеме
	|ИЗ
	|	ТоварыСУчетомДоставленных КАК ТоварыСУчетомДоставленных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|		ПО ТоварыСУчетомДоставленных.Распоряжение = ТоварыКПоступлению.ДокументПоступления
	|			И ТоварыСУчетомДоставленных.Склад = ТоварыКПоступлению.Склад
	|			И ТоварыСУчетомДоставленных.Номенклатура = ТоварыКПоступлению.Номенклатура
	|			И ТоварыСУчетомДоставленных.Характеристика = ТоварыКПоступлению.Характеристика
	|			И ТоварыСУчетомДоставленных.Назначение = ТоварыКПоступлению.Назначение
	|			И (ТоварыКПоступлению.Период >= &ДатаОтбора)
	|			И (ТоварыКПоступлению.КОформлениюОрдеров > 0)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СостоянияИРеквизитыДоставки.ПолучательОтправитель, НЕОПРЕДЕЛЕНО) КАК ПолучательОтправитель,
	|	ТоварыСУчетомДоставленных.Номенклатура КАК Номенклатура,
	|	ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|	ТоварыСУчетомДоставленных.Характеристика КАК Характеристика,
	|	ТоварыСУчетомДоставленных.Назначение КАК Назначение,
	|	ТоварыСУчетомДоставленных.Количество КАК Количество,
	|	ТоварыСУчетомДоставленных.Количество * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ТоварыСУчетомДоставленных.Количество * &ТекстЗапросаОбъемУпаковки КАК Объем,
	|	ТоварыСУчетомДоставленных.Склад КАК Склад,
	|	ТоварыСУчетомДоставленных.Распоряжение КАК Распоряжение,
	|	ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) КАК ВидРаспоряжения,
	|	СостоянияИРеквизитыДоставки.Номер КАК Номер,
	|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	СостоянияИРеквизитыДоставки.СпособДоставки КАК СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона КАК Зона,
	|	СостоянияИРеквизитыДоставки.Зона.Наименование КАК ЗонаПредставление,
	|	СостоянияИРеквизитыДоставки.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС КАК ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо КАК ВремяПо,
	|	ВЫБОР
	|		КОГДА СостоянияИРеквизитыДоставки.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада))
	|			ТОГДА 0
	|		КОГДА СостоянияИРеквизитыДоставки.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи))
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	СостоянияИРеквизитыДоставки.Дата КАК Дата,
	|	NULL КАК ПолеУпорядочивания
		//++Шерстюк Ю.Ю. 14.05.2021
	|,
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) = ТИП(Документ.ЗаказДавальца)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|		ТОГДА ТоварыСУчетомДоставленных.Распоряжение.Приоритет
	//Поручение экспедитору не является распоряжением на поступление
	//|	КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлению.ДокументПоступления) = ТИП(Документ.ПоручениеЭкспедитору)
	//|		ТОГДА ТоварыКПоступлению.ДокументПоступления.Рин1_Приоритет
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|КОНЕЦ КАК Приоритет
	//--Шерстюк Ю.Ю.

	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме
	|ИЗ
	|	ТоварыСУчетомДоставленных КАК ТоварыСУчетомДоставленных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО ТоварыСУчетомДоставленных.Склад = СостоянияИРеквизитыДоставки.Склад
	|			И ТоварыСУчетомДоставленных.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспоряженияНаДоставку.ПолучательОтправитель,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	РаспоряженияНаДоставку.Склад,
	|	РаспоряженияНаДоставку.Распоряжение,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение),
	|	СостоянияИРеквизитыДоставки.Номер,
	|	СостоянияИРеквизитыДоставки.Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей,
	|	СостоянияИРеквизитыДоставки.СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона,
	|	СостоянияИРеквизитыДоставки.Зона.Наименование,
	|	СостоянияИРеквизитыДоставки.Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо,
	|	4,
	|	СостоянияИРеквизитыДоставки.ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА РаспоряженияНаДоставку.Распоряжение ССЫЛКА Документ.ПоручениеЭкспедитору
	|			ТОГДА НАЧАЛОПЕРИОДА(СостоянияИРеквизитыДоставки.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	РаспоряженияНаДоставку.ПолеУпорядочения
	//++Шерстюк Ю.Ю. 14.05.2021
	|,
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказДавальца)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|			ИЛИ ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Приоритет
	|	КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
	|		ТОГДА РаспоряженияНаДоставку.Распоряжение.Рин1_Приоритет
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|КОНЕЦ 
	//--Шерстюк Ю.Ю.

	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО РаспоряженияНаДоставку.Распоряжение = ТоварыКДоставке.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО РаспоряженияНаДоставку.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|ГДЕ
	|	ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	И РаспоряженияНаДоставку.СпособДоставки В (
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

&Вместо("ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы")
Функция Рин1_ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.КоличествоВДоставке) > СУММА(ВложенныйЗапрос.КоличествоПринято)
	|			ТОГДА СУММА(ВложенныйЗапрос.КоличествоВДоставке)
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.КоличествоПринято)
	|	КОНЕЦ КАК Количество
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|	ВложенныйЗапрос.Приоритет КАК Приоритет
	//--Шерстюк Ю.Ю.
	|ПОМЕСТИТЬ ТоварыКВычетуИзДоставки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставке.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставке.Склад КАК Склад,
	|		ТоварыКДоставке.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставке.Характеристика КАК Характеристика,
	|		ТоварыКДоставке.Назначение КАК Назначение,
	|		ТоварыКДоставке.Количество КАК КоличествоВДоставке,
	|		0 КАК КоличествоПринято
	//++Шерстюк Ю.Ю. 17.05.2021
	|,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаказДавальца)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаказПереработчику)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|				ТОГДА ТоварыКДоставке.Распоряжение.Приоритет
	|			КОГДА ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
	|				ТОГДА ТоварыКДоставке.Распоряжение.Рин1_Приоритет
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|		КОНЕЦ КАК Приоритет
	//--Шерстюк Ю.Ю.
	|	ИЗ
	|		РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение
	|				И ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад
	|				И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				И (НЕ ТоварыКДоставке.ВсеТовары)
	|	ГДЕ
	|		(ТоварыКДоставке.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|					И ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен
	|				ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКПоступлениюОбороты.ДокументПоступления,
	|		ТоварыКПоступлениюОбороты.Склад,
	|		ТоварыКПоступлениюОбороты.Номенклатура,
	|		ТоварыКПоступлениюОбороты.Характеристика,
	|		ТоварыКПоступлениюОбороты.Назначение,
	|		0,
	|		ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход
	//++Шерстюк Ю.Ю. 17.05.2021
	|,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОбороты.ДокументПоступления) = ТИП(Документ.ЗаказКлиента)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОбороты.ДокументПоступления) = ТИП(Документ.ЗаказДавальца)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОбороты.ДокументПоступления) = ТИП(Документ.ЗаказПереработчику)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОбороты.ДокументПоступления) = ТИП(Документ.ЗаказПоставщику)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОбороты.ДокументПоступления) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|				ТОГДА ТоварыКПоступлениюОбороты.ДокументПоступления.Приоритет
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
	|		КОНЕЦ
	//--Шерстюк Ю.Ю. 17.05.2021
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Обороты(, , , 
	|			(ДокументПоступления, Склад) В (
	|				ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Распоряжение,
	|					РаспоряженияНаДоставку.Склад
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад)
	|			) КАК ТоварыКПоступлениюОбороты
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Назначение,
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика
	//++Шерстюк Ю.Ю. 17.05.2021
	|,
	|	ВложенныйЗапрос.Приоритет
	//--Шерстюк Ю.Ю. -
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК Период,
	|	NULL КАК Распоряжение,
	|	NULL КАК Номенклатура,
	|	NULL КАК Характеристика,
	|	NULL КАК Назначение,
	|	NULL КАК Склад,
	|	0 КАК Количество,
	|	0 КАК Вес,
	|	0 КАК Объем
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|	ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка) КАК Приоритет

	//--Шерстюк Ю.Ю.
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюБезОрдернойСхемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДетальныеДанные.Дата КАК Дата,
	|	ДетальныеДанные.Номенклатура КАК Номенклатура,
	|	ДетальныеДанные.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ДетальныеДанные.Характеристика КАК Характеристика,
	|	ДетальныеДанные.Назначение КАК Назначение,
	|	ДетальныеДанные.Серия КАК Серия,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатам - ДетальныеДанные.ВычетТоварыКДоставке КАК Количество,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатамВес - ДетальныеДанные.ВычетТоварыКДоставкеВес КАК Вес,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатамОбъем - ДетальныеДанные.ВычетТоварыКДоставкеОбъем КАК Объем,
	|	ДетальныеДанные.Склад КАК Склад,
	|	ДетальныеДанные.Распоряжение КАК Распоряжение,
	|	ДетальныеДанные.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ДетальныеДанные.ВидРаспоряжения КАК ВидРаспоряжения,
	|	ДетальныеДанные.Номер КАК Номер,
	|	ДетальныеДанные.Адрес КАК Адрес,
	|	ДетальныеДанные.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ДетальныеДанные.СпособДоставки КАК СпособДоставки,
	|	ДетальныеДанные.Картинка КАК Картинка,
	|	ДетальныеДанные.Зона КАК Зона,
	|	ДетальныеДанные.ЗонаПредставление КАК ЗонаПредставление,
	|	ДетальныеДанные.Перевозчик КАК Перевозчик,
	|	ДетальныеДанные.ВремяС КАК ВремяС,
	|	ДетальныеДанные.ВремяПо КАК ВремяПо,
	|	ДетальныеДанные.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДетальныеДанные.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ДетальныеДанные.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ДетальныеДанные.ПолеУпорядочения КАК ПолеУпорядочивания
	//++Шерстюк Ю.Ю. 17.05.2021
	|,
	|	ДетальныеДанные.Приоритет КАК Приоритет

	//--Шерстюк Ю.Ю.
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКДоставкеПоРегистраторам.Период, ДЕНЬ) КАК Дата,
	|		ТоварыКДоставкеПоРегистраторам.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставкеПоРегистраторам.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|		ТоварыКДоставкеПоРегистраторам.Характеристика КАК Характеристика,
	|		ТоварыКДоставкеПоРегистраторам.Назначение КАК Назначение,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход КАК НачальнаяПотребностьПоДатам,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход * &ТекстЗапросаВесУпаковки КАК НачальнаяПотребностьПоДатамВес,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход * &ТекстЗапросаОбъемУпаковки КАК НачальнаяПотребностьПоДатамОбъем,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) КАК ВычетТоварыКДоставке,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаВесУпаковки КАК ВычетТоварыКДоставкеВес,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаОбъемУпаковки КАК ВычетТоварыКДоставкеОбъем,
	|		РаспоряженияНаДоставку.Склад КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения КАК ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер КАК Номер,
	|		РаспоряженияНаДоставку.Адрес КАК Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Картинка,
	|		РаспоряженияНаДоставку.Зона КАК Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование КАК ЗонаПредставление,
	|		РаспоряженияНаДоставку.Перевозчик КАК Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС КАК ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения КАК ПолеУпорядочения
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|		РаспоряженияНаДоставку.Приоритет КАК Приоритет
	//--Шерстюк Ю.Ю.
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Обороты(, , Регистратор, 
	|			(ДокументПоступления, Склад) В (
	|				ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Распоряжение,
	|					РаспоряженияНаДоставку.Склад
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				)
	|			) КАК ТоварыКДоставкеПоРегистраторам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКВычетуИзДоставки КАК ТоварыКВычетуИзДоставки
	|			ПО (ТоварыКВычетуИзДоставки.Распоряжение = ТоварыКДоставкеПоРегистраторам.Регистратор)
	|				И (ТоварыКВычетуИзДоставки.Склад = ТоварыКДоставкеПоРегистраторам.Склад)
	|				И (ТоварыКВычетуИзДоставки.Номенклатура = ТоварыКДоставкеПоРегистраторам.Номенклатура)
	|				И (ТоварыКВычетуИзДоставки.Характеристика = ТоварыКДоставкеПоРегистраторам.Характеристика)
	|				И (ТоварыКВычетуИзДоставки.Назначение = ТоварыКДоставкеПоРегистраторам.Назначение)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО (СправочникНоменклатура.Ссылка = ТоварыКДоставкеПоРегистраторам.Номенклатура)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКДоставкеПоРегистраторам.Регистратор = РаспоряженияНаДоставку.Распоряжение
	|				И ТоварыКДоставкеПоРегистраторам.Склад = РаспоряженияНаДоставку.Склад
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗоныДоставки КАК Зоны
	|			ПО (Зоны.Ссылка = РаспоряженияНаДоставку.Зона)
	|	ГДЕ
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКДоставкеПоДням.Период, ДЕНЬ),
	|		ТоварыКДоставкеПоДням.Номенклатура,
	|		ТоварыКДоставкеПоДням.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук),
	|		ТоварыКДоставкеПоДням.Характеристика,
	|		ТоварыКДоставкеПоДням.Назначение,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|		ТоварыКДоставкеПоДням.Количество,
	|		ТоварыКДоставкеПоДням.Количество * &ТекстЗапросаВесУпаковки,
	|		ТоварыКДоставкеПоДням.Количество * &ТекстЗапросаОбъемУпаковки,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0),
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаВесУпаковки,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаОбъемУпаковки,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер,
	|		РаспоряженияНаДоставку.Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|		РаспоряженияНаДоставку.Приоритет
	//--Шерстюк Ю.Ю.
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Т.Ссылка КАК Ссылка,
	|			Т.ДатаПоступления КАК Период,
	|			Т.Склад КАК Склад,
	|			Т.Номенклатура КАК Номенклатура,
	|			Т.Характеристика КАК Характеристика,
	|			Т.Назначение КАК Назначение,
	|			СУММА(Т.Количество) КАК Количество
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.ДатаПоступления < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.ДатаПоступления,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Т.Ссылка,
	|			Т.Ссылка.Дата,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			СУММА(Т.Количество)
	|		ИЗ
	|			Документ.ПриобретениеТоваровУслуг.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.Ссылка.Дата < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			Т.Ссылка.Дата
	//++ НЕ УТ
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Т.Ссылка,
	|			Т.Ссылка.Дата,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			СУММА(Т.Количество)
	|		ИЗ
	|			Документ.ПриемкаТоваровНаХранение.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.Ссылка.Дата < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			Т.Ссылка.Дата
	//-- НЕ УТ
	|	) КАК ТоварыКДоставкеПоДням
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКВычетуИзДоставки КАК ТоварыКВычетуИзДоставки
	|		ПО (ТоварыКВычетуИзДоставки.Распоряжение = ТоварыКДоставкеПоДням.Ссылка)
	|			И (ТоварыКВычетуИзДоставки.Склад = ТоварыКДоставкеПоДням.Склад)
	|			И (ТоварыКВычетуИзДоставки.Номенклатура = ТоварыКДоставкеПоДням.Номенклатура)
	|			И (ТоварыКВычетуИзДоставки.Характеристика = ТоварыКДоставкеПоДням.Характеристика)
	|			И (ТоварыКВычетуИзДоставки.Назначение = ТоварыКДоставкеПоДням.Назначение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Ссылка = ТоварыКДоставкеПоДням.Номенклатура)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ПО ТоварыКДоставкеПоДням.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыКДоставкеПоДням.Склад = РаспоряженияНаДоставку.Склад
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		НЕОПРЕДЕЛЕНО,
	|		ЛОЖЬ,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер,
	|		РаспоряженияНаДоставку.Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		4,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|		РаспоряженияНаДоставку.Приоритет
	//--Шерстюк Ю.Ю.
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		РаспоряженияНаДоставку.СпособДоставки В (
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		И ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	) КАК ДетальныеДанные
	|ГДЕ
	|	(ДетальныеДанные.НачальнаяПотребностьПоДатам = 0
	|			ИЛИ ДетальныеДанные.НачальнаяПотребностьПоДатам - ДетальныеДанные.ВычетТоварыКДоставке > 0)";
	
	Возврат ТекстЗапроса;
КонецФункции

&Вместо("ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы")
Функция Рин1_ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЧастичноДоставленныеЗаказы.Склад              КАК Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение       КАК Распоряжение,
	|	NULL                                          КАК ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки         КАК СпособДоставки,
	|	NULL                                          КАК Зона,
	|	NULL                                          КАК Перевозчик,
	|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура       КАК Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика     КАК Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение         КАК Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия              КАК Серия,
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество)  КАК Количество
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|	РаспоряженияНаДоставку.Приоритет КАК Приоритет
	//--Шерстюк Ю.Ю.
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюБезОрдернойСхемы
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ЧастичноДоставленныеЗаказы
	|		ПО РаспоряженияНаДоставку.Распоряжение = ЧастичноДоставленныеЗаказы.Распоряжение
	|			И РаспоряженияНаДоставку.Склад = ЧастичноДоставленныеЗаказы.Склад
	|			И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			И (НЕ ЧастичноДоставленныеЗаказы.ВсеТовары)
	|ГДЕ
	|	(ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|				И ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку.Проведен
	|			ИЛИ ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичноДоставленныеЗаказы.Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение,
	|	РаспоряженияНаДоставку.СпособДоставки,
	|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|	РаспоряженияНаДоставку.Приоритет
	//--Шерстюк Ю.Ю.
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЗ.Дата КАК Дата,
	|	ВЗ.Номенклатура КАК Номенклатура,
	|	ВЗ.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|	ВЗ.Характеристика КАК Характеристика,
	|	ВЗ.Назначение КАК Назначение,
	|	ВЗ.Серия КАК Серия,
	|	ВЗ.Количество КАК Количество,
	|	ВЗ.Количество * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ВЗ.Количество * &ТекстЗапросаОбъемУпаковки КАК Объем,
	|	ВЗ.Склад КАК Склад,
	|	ВЗ.Распоряжение КАК Распоряжение,
	|	ДопРеквизиты.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТИПЗНАЧЕНИЯ(ВЗ.Распоряжение) КАК ВидРаспоряжения,
	|	ДопРеквизиты.Номер КАК Номер,
	|	ДопРеквизиты.Адрес КАК Адрес,
	|	ДопРеквизиты.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ВЗ.СпособДоставки КАК СпособДоставки,
	|	ВЗ.Картинка КАК Картинка,
	|	ЕСТЬNULL(ДопРеквизиты.Зона, ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)) КАК Зона,
	|	ДопРеквизиты.Зона.Наименование КАК ЗонаПредставление,
	|	ДопРеквизиты.Перевозчик КАК Перевозчик,
	|	ДопРеквизиты.ВремяС КАК ВремяС,
	|	ДопРеквизиты.ВремяПо КАК ВремяПо,
	|	ДопРеквизиты.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДопРеквизиты.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ДопРеквизиты.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ВЫБОР
	|		КОГДА ВЗ.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДопРеквизиты.Перевозчик)
	|		ИНАЧЕ ДопРеквизиты.Адрес
	|	КОНЕЦ КАК ПолеУпорядочивания
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|	ВЗ.Приоритет КАК Приоритет
	//--Шерстюк Ю.Ю.
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(НАЧАЛОПЕРИОДА(ТоварыКОтгрузке.Период, ДЕНЬ)) КАК Дата,
	|		РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
	|		РаспоряженияНаДоставку.Склад КАК Склад,
	|		ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|		ТоварыКОтгрузке.Характеристика КАК Характеристика,
	|		ТоварыКОтгрузке.Назначение КАК Назначение,
	|		ТоварыКОтгрузке.Серия КАК Серия,
	|		РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|		СУММА(ТоварыКОтгрузке.КОтгрузке) КАК Количество,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Картинка
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|		РаспоряженияНаДоставку.Приоритет КАК Приоритет
	//--Шерстюк Ю.Ю.
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|			ПО РаспоряженияНаДоставку.Распоряжение = ТоварыКОтгрузке.ДокументОтгрузки
	|				И РаспоряженияНаДоставку.Склад = ТоварыКОтгрузке.Склад
	|				И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|	ГДЕ
	|		ТоварыКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Склад,
	|		ТоварыКОтгрузке.Номенклатура,
	|		ТоварыКОтгрузке.Характеристика,
	|		ТоварыКОтгрузке.Назначение,
	|		ТоварыКОтгрузке.Серия,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ
		//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|		РаспоряженияНаДоставку.Приоритет
	//--Шерстюк Ю.Ю.
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(ТоварыКОтгрузке.КОтгрузке) > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Склад,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		NULL,
	|		4
	//++Шерстюк Ю.Ю. 17.05.2021
	|	,
	|		РаспоряженияНаДоставку.Приоритет
    //--Шерстюк Ю.Ю.
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		РаспоряженияНаДоставку.СпособДоставки В
	|			(ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		И ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	) КАК ВЗ
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК ДопРеквизиты
	|	ПО ВЗ.Распоряжение = ДопРеквизиты.Распоряжение
	|		И ВЗ.Склад = ДопРеквизиты.Склад
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|	ПО ВЗ.Номенклатура = СправочникНоменклатура.Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

//--Шерстюк Ю.Ю.