
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ВидРабот = Параметры.ВидРабот;
	День = Параметры.День;
	
	ВремяНачалаРаботы = День;
	ВремяОкончанияРаботы = День;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВремяНачалаРаботыПриИзменении(Элемент)
	КоличествоЧасов = ГИГ_ЕжедневнаяВыработкаКлиент.РассчитатьКоличествоЧасовВыработки(День, ВремяНачалаРаботы, ВремяОкончанияРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРаботыПриИзменении(Элемент)
	КоличествоЧасов = ГИГ_ЕжедневнаяВыработкаКлиент.РассчитатьКоличествоЧасовВыработки(День, ВремяНачалаРаботы, ВремяОкончанияРаботы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Результат = Новый Структура("ВидВремени, ВремяНачалаРаботы, ВремяОкончанияРаботы, КоличествоЧасов", ВидВремени, ВремяНачалаРаботы, ВремяОкончанияРаботы, КоличествоЧасов);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
