
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СкладДляОтбора") Тогда
		ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
		ЗаписьОбъект.Склад = Параметры.СкладДляОтбора;
		СкладДляОтбора = Параметры.СкладДляОтбора;
		ЗначениеВРеквизитФормы(ЗаписьОбъект, "Запись");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СкладДляОтбора) Тогда
		Элементы.Склад.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры



