
&Вместо("ДобавитьПриходВГрафик")
Процедура Рин1_ДобавитьПриходВГрафик(НаборЗаписей, Выборка, Количество, КоличествоПодЗаказ, КоличествоСНеподтвержденными, КоличествоПодЗаказСНеподтвержденными)
	// + [Rineco], [Шерстюк Ю.Ю.] [20.08.2021] 
	// Задача: [№ 15211], [в Дату события должна вставать дата из заказа поставщику. Т.к. все данные для рег.График поступления товаров собирается по регистру
	//  Движение товаров, а в нем ПТУ закрывают Заказы поставщику, а Приходные ордера закрывают ПТУ и нет информации о том какой заказ закрыл ордер и в гафике поступления
	// нет понимая приобретение в графике это остаток по какой строке заказа, то пытаемся определить дату путем распределения]
	Если ТипЗнч(Выборка.Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		//Получим все заказы, которые закрыло приобретение
		Запрос = Новый Запрос;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;

		Запрос.Текст = ТекстЗапросаДляРасчетаДатыПриПроведенииПТУ();
		Запрос.УстановитьПараметр("Назначение",Выборка.Назначение);
		Запрос.УстановитьПараметр("Номенклатура",Выборка.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",Выборка.Характеристика);
		Запрос.УстановитьПараметр("Распоряжение",Выборка.Распоряжение);
		Запрос.УстановитьПараметр("Склад",Выборка.Склад);
		Попытка
			Результат = Запрос.ВыполнитьПакет();
		Исключение
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.ДатаСобытия = Запись.Период;  	
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		
			Запись.КоличествоИзЗаказов = Количество;
			Запись.КоличествоПодЗаказ  = КоличествоПодЗаказ;
			Запись.КоличествоИзЗаказовСНеподтвержденными = КоличествоСНеподтвержденными;
			Запись.КоличествоПодЗаказСНеподтвержденными  = КоличествоПодЗаказСНеподтвержденными;	
            Сообщить("Не удалось обновить даты в графике поступлений, обратитесь к Администратору!!!!");
		КонецПопытки;
	
		ТабПТУПоЗаказам =Результат[Результат.ВГраница()-1].Выгрузить();;	
		
		пТипЧисло = Новый ОписаниеТипов("Число");
		
		ТабГрафикаЗаказов = Результат[Результат.ВГраница()].Выгрузить(); 
		ТабГрафикаЗаказов.Колонки.Добавить("ПТУ",Новый ОписаниеТипов("ДокументСсылка.ПриобретениеТоваровУслуг"));
		ТабГрафикаЗаказов.Колонки.Добавить("ПланируемоеПоступлениеПогашено",пТипЧисло); 
		ТабГрафикаЗаказов.Колонки.Добавить("ПланируемоеПоступлениеПодЗаказПогашено",пТипЧисло);
		ТабГрафикаЗаказов.Колонки.Добавить("ПланируемоеПоступлениеСНеподтвержденнымиПогашено",пТипЧисло);
		ТабГрафикаЗаказов.Колонки.Добавить("ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено",пТипЧисло);
		
		Для Каждого СтрПТУПоЗаказам из ТабПТУПоЗаказам Цикл 
			ПараметрыОтбора = Новый Структура("ЗаказПоставщику",СтрПТУПоЗаказам.ЗаказыПоставщику);
			пМассивЗаказов = ТабГрафикаЗаказов.НайтиСтроки(ПараметрыОтбора);
			Для Каждого ЭлементМассиваЗаказов из пМассивЗаказов Цикл 
				Если СтрПТУПоЗаказам.ПланируемоеПоступление > 0
					или СтрПТУПоЗаказам.ПланируемоеПоступление > 0
					или СтрПТУПоЗаказам.ПланируемоеПоступлениеСНеподтвержденными > 0
					или СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными > 0 Тогда
					
					Если ЭлементМассиваЗаказов.ПланируемоеПоступление > 0
						или ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ > 0
						или ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными > 0
						или ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными > 0 Тогда
						
						Если (ЭлементМассиваЗаказов.ПланируемоеПоступление <= СтрПТУПоЗаказам.ПланируемоеПоступление и СтрПТУПоЗаказам.ПланируемоеПоступление > 0)
							или (ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ <= СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказ и  СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказ  > 0)
							или (ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными <= СтрПТУПоЗаказам.ПланируемоеПоступлениеСНеподтвержденными и СтрПТУПоЗаказам.ПланируемоеПоступлениеСНеподтвержденными  > 0)
							или (ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными <= СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными и СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными > 0) Тогда
							 //уменьшаем нераспределенное
							 СтрПТУПоЗаказам.ПланируемоеПоступление =  СтрПТУПоЗаказам.ПланируемоеПоступление - ЭлементМассиваЗаказов.ПланируемоеПоступление;
							 СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказ =  СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказ - ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ;
							 СтрПТУПоЗаказам.ПланируемоеПоступлениеСНеподтвержденными = СтрПТУПоЗаказам.ПланируемоеПоступлениеСНеподтвержденными - ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными;
							 СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными - ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными;
							 
							 //запоминаем погашенное количество
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеПогашено = ЭлементМассиваЗаказов.ПланируемоеПоступление;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказПогашено =  ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденнымиПогашено = ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено = ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными;

							 //строка по заказу полностью погашена
							 ЭлементМассиваЗаказов.ПланируемоеПоступление = 0;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ = 0;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными = 0;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = 0;
							 ЭлементМассиваЗаказов.ПТУ = СтрПТУПоЗаказам.ПТУПоЗаказу;
							 
						 Иначе
							 //уменьшаем на количество погашенного в текущей строке и добавим новую строку с полностью погашенными
							 ЭлементМассиваЗаказов.ПланируемоеПоступление = ЭлементМассиваЗаказов.ПланируемоеПоступление - СтрПТУПоЗаказам.ПланируемоеПоступление;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ = ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ - СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказ;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными = ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными - СтрПТУПоЗаказам.ПланируемоеПоступлениеСНеподтвержденными;
							 ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными - СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными;
							 
							 пНоваяСтрока = ТабГрафикаЗаказов.Добавить();
							 //запоминаем погашенное количество
							 ЗаполнитьЗначенияСвойств(пНоваяСтрока,ЭлементМассиваЗаказов);
							 пНоваяСтрока.ПланируемоеПоступлениеПогашено = СтрПТУПоЗаказам.ПланируемоеПоступление;
							 пНоваяСтрока.ПланируемоеПоступлениеПодЗаказПогашено =  СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказ;
							 пНоваяСтрока.ПланируемоеПоступлениеСНеподтвержденнымиПогашено = СтрПТУПоЗаказам.ПланируемоеПоступлениеСНеподтвержденными;
							 пНоваяСтрока.ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено = СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными;
							 
							 СтрПТУПоЗаказам.ПланируемоеПоступление = 0;
							 СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказ = 0;
							 СтрПТУПоЗаказам.ПланируемоеПоступлениеСНеподтвержденными = 0;
							 СтрПТУПоЗаказам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = 0;
							 
							 пНоваяСтрока.ПланируемоеПоступление = 0;
							 пНоваяСтрока.ПланируемоеПоступлениеПодЗаказ = 0;
							 пНоваяСтрока.ПланируемоеПоступлениеСНеподтвержденными = 0;
							 пНоваяСтрока.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = 0;
							 пНоваяСтрока.ПТУ = СтрПТУПоЗаказам.ПТУПоЗаказу;
							 
							 Прервать; //распределили строку
						КонецЕсли;
						
					Иначе
						Продолжить;
					КонецЕсли;
				Иначе
					Прервать; //все распределили
				КонецЕсли;

			КонецЦикла;
		КонецЦикла;

		пМассивЗаказовПоРаспоряжению = ТабГрафикаЗаказов.НайтиСтроки(Новый Структура("ПТУ",Выборка.Распоряжение));
		пКолЭлементовМассива = пМассивЗаказовПоРаспоряжению.Количество();
		
		Если пКолЭлементовМассива > 0 Тогда 
			пИндекс = пКолЭлементовМассива-1;
			Пока пИндекс >= 0 Цикл
				Если (пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПогашено >= Количество и  пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПогашено > 0  )
					или (пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПодЗаказПогашено >= КоличествоПодЗаказ и пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПодЗаказПогашено > 0  )
					или (пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеСНеподтвержденнымиПогашено >= КоличествоСНеподтвержденными и  пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеСНеподтвержденнымиПогашено > 0  )
					или (пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено >= КоличествоПодЗаказСНеподтвержденными и пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено > 0  ) Тогда
					
					Запись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					Запись.ДатаСобытия = пМассивЗаказовПоРаспоряжению[пИндекс].Период; //устанавливаем дату из заказа 	
					Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
				
					Запись.КоличествоИзЗаказов = Количество;
					Запись.КоличествоПодЗаказ  = КоличествоПодЗаказ;
					Запись.КоличествоИзЗаказовСНеподтвержденными = КоличествоСНеподтвержденными;
					Запись.КоличествоПодЗаказСНеподтвержденными  = КоличествоПодЗаказСНеподтвержденными;
					Прервать;
				Иначе
					 					
					Запись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					Запись.ДатаСобытия = пМассивЗаказовПоРаспоряжению[пИндекс].Период; //устанавливаем дату из заказа 	
					Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
				
					Запись.КоличествоИзЗаказов = пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПогашено;
					Запись.КоличествоПодЗаказ  = пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПодЗаказПогашено;
					Запись.КоличествоИзЗаказовСНеподтвержденными = пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеСНеподтвержденнымиПогашено;
					Запись.КоличествоПодЗаказСНеподтвержденными  = пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено;

					Количество = Количество - пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПогашено;
					КоличествоПодЗаказ  = КоличествоПодЗаказ - пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПодЗаказПогашено;
					КоличествоСНеподтвержденными = КоличествоСНеподтвержденными  - пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеСНеподтвержденнымиПогашено;
					КоличествоПодЗаказСНеподтвержденными  = КоличествоПодЗаказСНеподтвержденными - пМассивЗаказовПоРаспоряжению[пИндекс].ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено;
					
					Если Количество = 0 и КоличествоПодЗаказ = 0 и КоличествоСНеподтвержденными = 0 и КоличествоПодЗаказСНеподтвержденными = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;	
				
				Если Количество > 0 и КоличествоПодЗаказ > 0 и КоличествоСНеподтвержденными > 0 и КоличествоПодЗаказСНеподтвержденными > 0 Тогда
					Прервать;
				КонецЕсли;
				
				пИндекс = пИндекс - 1;
			КонецЦикла;
								

		Иначе
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.ДатаСобытия = Запись.Период;  	
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		
			Запись.КоличествоИзЗаказов = Количество;
			Запись.КоличествоПодЗаказ  = КоличествоПодЗаказ;
			Запись.КоличествоИзЗаказовСНеподтвержденными = КоличествоСНеподтвержденными;
			Запись.КоличествоПодЗаказСНеподтвержденными  = КоличествоПодЗаказСНеподтвержденными;	

		КонецЕсли;
	Иначе
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.ДатаСобытия = Запись.Период;  	
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	
		Запись.КоличествоИзЗаказов = Количество;
		Запись.КоличествоПодЗаказ  = КоличествоПодЗаказ;
		Запись.КоличествоИзЗаказовСНеподтвержденными = КоличествоСНеподтвержденными;
		Запись.КоличествоПодЗаказСНеподтвержденными  = КоличествоПодЗаказСНеподтвержденными;	

	КонецЕсли;
	
	
	 //выполнял изменения предположительно Беркутов А. 
	//Если ТипЗнч(Выборка.Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ЗаказПоставщикуТовары.ДатаПоступления КАК ДатаПоступления
	//	|ИЗ
	//	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	//	|		ПО ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
	//	|			И ПриобретениеТоваровУслугТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
	//	|			И ПриобретениеТоваровУслугТовары.Характеристика = ЗаказПоставщикуТовары.Характеристика
	//	|			И ПриобретениеТоваровУслугТовары.Назначение = ЗаказПоставщикуТовары.Назначение
	//	|ГДЕ
	//	|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
	//	|	И ПриобретениеТоваровУслугТовары.Номенклатура = &Номенклатура
	//	|	И ПриобретениеТоваровУслугТовары.Характеристика = &Характеристика
	//	|	И НЕ ЗаказПоставщикуТовары.ДатаПоступления ЕСТЬ NULL";
	//	
	//	Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
	//	Запрос.УстановитьПараметр("Ссылка", Выборка.Распоряжение);
	//	Запрос.УстановитьПараметр("Характеристика", Выборка.Характеристика);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если не РезультатЗапроса.Пустой() Тогда
	//		Запись.ДатаСобытия = РезультатЗапроса.Выгрузить()[0].ДатаПоступления;
	//	Иначе
	//		Запись.ДатаСобытия = Запись.Период;	
	//	КонецЕсли;
	//Иначе
	//	Запись.ДатаСобытия = Запись.Период;
	//КонецЕсли;
	// - [Rineco], [Шерстюк Ю.Ю.] [20.08.2021]
	

КонецПроцедуры

// + [Rineco], [Шерстюк Ю.Ю.] [20.08.2021] 
// Задача: [№ 15211], [#]
Функция ТекстЗапросаДляРасчетаДатыПриПроведенииПТУ()
	Возврат "ВЫБРАТЬ
			|	ДвижениеТоваров.Распоряжение КАК Распоряжение,
			|	ДвижениеТоваров.Период КАК Период,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступление) КАК ПланируемоеПоступление,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеСНеподтвержденными) КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказ) КАК ПланируемоеПоступлениеПодЗаказ,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказСНеподтвержденными) КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными,
			|	ДвижениеТоваров.Номенклатура КАК Номенклатура,
			|	ДвижениеТоваров.Характеристика КАК Характеристика,
			|	ДвижениеТоваров.Склад КАК Склад,
			|	ДвижениеТоваров.Назначение КАК Назначение,
			|	ДвижениеТоваров.Регистратор КАК ПТУВГрафик
			|ПОМЕСТИТЬ ВсеЗаказыПоПТУ
			|ИЗ
			|	РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
			|ГДЕ
			|	ДвижениеТоваров.Номенклатура = &Номенклатура
			|	И ДвижениеТоваров.Характеристика = &Характеристика
			|	И ДвижениеТоваров.Склад = &Склад
			|	И ДвижениеТоваров.Назначение = &Назначение
			|	И ДвижениеТоваров.Регистратор = &Распоряжение
			|	И ТИПЗНАЧЕНИЯ(ДвижениеТоваров.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДвижениеТоваров.Распоряжение,
			|	ДвижениеТоваров.Период,
			|	ДвижениеТоваров.Номенклатура,
			|	ДвижениеТоваров.Характеристика,
			|	ДвижениеТоваров.Склад,
			|	ДвижениеТоваров.Назначение,
			|	ДвижениеТоваров.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеЗаказыПоПТУ.Номенклатура КАК Номенклатура,
			|	ВсеЗаказыПоПТУ.Характеристика КАК Характеристика,
			|	ВсеЗаказыПоПТУ.Склад КАК Склад,
			|	ВсеЗаказыПоПТУ.Назначение КАК Назначение,
			|	ДвижениеТоваров.Регистратор КАК ПТУПоЗаказу,
			|	ВсеЗаказыПоПТУ.Распоряжение КАК ЗаказыПоставщику,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступление) КАК ПланируемоеПоступлениеПогашеноПоЗаказу,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказ) КАК ПланируемоеПоступлениеПодЗаказПогашеноПоЗаказу,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеСНеподтвержденными) КАК ПланируемоеПоступлениеСНеподтвержденнымиПогашеноПоЗаказу,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказСНеподтвержденными) КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашеноПоЗаказу,
			|	ВсеЗаказыПоПТУ.Период КАК Период
			|ПОМЕСТИТЬ ПТУПогасившиеЗаказ
			|ИЗ
			|	ВсеЗаказыПоПТУ КАК ВсеЗаказыПоПТУ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
			|		ПО ВсеЗаказыПоПТУ.Номенклатура = ДвижениеТоваров.Номенклатура
			|			И ВсеЗаказыПоПТУ.Характеристика = ДвижениеТоваров.Характеристика
			|			И ВсеЗаказыПоПТУ.Склад = ДвижениеТоваров.Склад
			|			И ВсеЗаказыПоПТУ.Назначение = ДвижениеТоваров.Назначение
			|			И ВсеЗаказыПоПТУ.Распоряжение = ДвижениеТоваров.Распоряжение
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(ДвижениеТоваров.Регистратор) = ТИП(Документ.ПриобретениеТоваровУслуг)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсеЗаказыПоПТУ.Номенклатура,
			|	ВсеЗаказыПоПТУ.Характеристика,
			|	ВсеЗаказыПоПТУ.Склад,
			|	ВсеЗаказыПоПТУ.Назначение,
			|	ДвижениеТоваров.Регистратор,
			|	ВсеЗаказыПоПТУ.Распоряжение,
			|	ВсеЗаказыПоПТУ.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДвижениеТоваров.Период КАК Период,
			|	ДвижениеТоваров.Регистратор КАК ЗаказПоставщику,
			|	ДвижениеТоваров.Номенклатура КАК Номенклатура,
			|	ДвижениеТоваров.Характеристика КАК Характеристика,
			|	ДвижениеТоваров.Склад КАК Склад,
			|	ДвижениеТоваров.Назначение КАК Назначение,
			|	СУММА(ДвижениеТоваров.ПланируемоеПоступление) КАК ПланируемоеПоступление,
			|	СУММА(ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказ) КАК ПланируемоеПоступлениеПодЗаказ,
			|	СУММА(ДвижениеТоваров.ПланируемоеПоступлениеСНеподтвержденными) КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	СУММА(ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказСНеподтвержденными) КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными
			|ПОМЕСТИТЬ ЗаказыПоставщикуПоПериодам
			|ИЗ
			|	ВсеЗаказыПоПТУ КАК ВсеЗаказыПоПТУ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
			|		ПО (ДвижениеТоваров.Номенклатура = ВсеЗаказыПоПТУ.Номенклатура)
			|			И (ДвижениеТоваров.Характеристика = ВсеЗаказыПоПТУ.Характеристика)
			|			И (ДвижениеТоваров.Склад = ВсеЗаказыПоПТУ.Склад)
			|			И (ДвижениеТоваров.Назначение = ВсеЗаказыПоПТУ.Назначение)
			|			И ВсеЗаказыПоПТУ.Распоряжение = ДвижениеТоваров.Регистратор
			|			И (ДвижениеТоваров.Распоряжение = ВсеЗаказыПоПТУ.Распоряжение)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДвижениеТоваров.Период,
			|	ДвижениеТоваров.Регистратор,
			|	ДвижениеТоваров.Номенклатура,
			|	ДвижениеТоваров.Характеристика,
			|	ДвижениеТоваров.Склад,
			|	ДвижениеТоваров.Назначение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПТУПогасившиеЗаказ.Номенклатура КАК Номенклатура,
			|	ПТУПогасившиеЗаказ.Характеристика КАК Характеристика,
			|	ПТУПогасившиеЗаказ.Склад КАК Склад,
			|	ПТУПогасившиеЗаказ.Назначение КАК Назначение,
			|	ПТУПогасившиеЗаказ.ПТУПоЗаказу КАК ПТУПоЗаказу,
			|	ПТУПогасившиеЗаказ.ЗаказыПоставщику КАК ЗаказыПоставщику,
			|	ПТУПогасившиеЗаказ.ПланируемоеПоступлениеПогашеноПоЗаказу КАК ПланируемоеПоступление,
			|	ПТУПогасившиеЗаказ.ПланируемоеПоступлениеПодЗаказПогашеноПоЗаказу КАК ПланируемоеПоступлениеПодЗаказ,
			|	ПТУПогасившиеЗаказ.ПланируемоеПоступлениеСНеподтвержденнымиПогашеноПоЗаказу КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	ПТУПогасившиеЗаказ.ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашеноПоЗаказу КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными,
			|	ПТУПогасившиеЗаказ.Период КАК Период
			|ИЗ
			|	ПТУПогасившиеЗаказ КАК ПТУПогасившиеЗаказ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказыПоставщикуПоПериодам.Период КАК Период,
			|	ЗаказыПоставщикуПоПериодам.ЗаказПоставщику КАК ЗаказПоставщику,
			|	ЗаказыПоставщикуПоПериодам.Номенклатура КАК Номенклатура,
			|	ЗаказыПоставщикуПоПериодам.Характеристика КАК Характеристика,
			|	ЗаказыПоставщикуПоПериодам.Склад КАК Склад,
			|	ЗаказыПоставщикуПоПериодам.Назначение КАК Назначение,
			|	ЗаказыПоставщикуПоПериодам.ПланируемоеПоступление КАК ПланируемоеПоступление,
			|	ЗаказыПоставщикуПоПериодам.ПланируемоеПоступлениеПодЗаказ КАК ПланируемоеПоступлениеПодЗаказ,
			|	ЗаказыПоставщикуПоПериодам.ПланируемоеПоступлениеСНеподтвержденными КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	ЗаказыПоставщикуПоПериодам.ПланируемоеПоступлениеПодЗаказСНеподтвержденными КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными
			|ИЗ
			|	ЗаказыПоставщикуПоПериодам КАК ЗаказыПоставщикуПоПериодам
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
КонецФункции
// - [Rineco], [Шерстюк Ю.Ю.] [20.08.2021]
Функция ТекстЗапросаДляРасчетаДатыПриПроведенииЗаказаПоставщику()
	Возврат "ВЫБРАТЬ
			|	ДвижениеТоваров.Распоряжение КАК Распоряжение,
			|	ДвижениеТоваров.Период КАК Период,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступление) КАК ПланируемоеПоступление,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеСНеподтвержденными) КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказ) КАК ПланируемоеПоступлениеПодЗаказ,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказСНеподтвержденными) КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными,
			|	ДвижениеТоваров.Номенклатура КАК Номенклатура,
			|	ДвижениеТоваров.Характеристика КАК Характеристика,
			|	ДвижениеТоваров.Склад КАК Склад,
			|	ДвижениеТоваров.Назначение КАК Назначение,
			|	ДвижениеТоваров.Регистратор КАК ПТУВГрафик
			|ПОМЕСТИТЬ ВсеПТУПогасившиеЗаказ
			|ИЗ
			|	РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
			|ГДЕ
			|	ДвижениеТоваров.Распоряжение В (&Распоряжение)
			|	И ТИПЗНАЧЕНИЯ(ДвижениеТоваров.Регистратор) = ТИП(Документ.ПриобретениеТоваровУслуг)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДвижениеТоваров.Распоряжение,
			|	ДвижениеТоваров.Период,
			|	ДвижениеТоваров.Номенклатура,
			|	ДвижениеТоваров.Характеристика,
			|	ДвижениеТоваров.Склад,
			|	ДвижениеТоваров.Назначение,
			|	ДвижениеТоваров.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДвижениеТоваров.Распоряжение КАК ЗаказПоставщику,
			|	ДвижениеТоваров.Регистратор КАК ПТУ,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступление) КАК ПланируемоеПоступление,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказ) КАК ПланируемоеПоступлениеПодЗаказ,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеСНеподтвержденными) КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	СУММА(-ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказСНеподтвержденными) КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными,
			|	ДвижениеТоваров.Номенклатура КАК Номенклатура,
			|	ДвижениеТоваров.Характеристика КАК Характеристика,
			|	ДвижениеТоваров.Склад КАК Склад,
			|	ДвижениеТоваров.Назначение КАК Назначение,
			|	ДвижениеТоваров.Период КАК Период
			|ПОМЕСТИТЬ ВсеЗаказыПоставщикуПоПТУ
			|ИЗ
			|	ВсеПТУПогасившиеЗаказ КАК ВсеПТУПогасившиеЗаказ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
			|		ПО ВсеПТУПогасившиеЗаказ.Номенклатура = ДвижениеТоваров.Номенклатура
			|			И ВсеПТУПогасившиеЗаказ.Характеристика = ДвижениеТоваров.Характеристика
			|			И ВсеПТУПогасившиеЗаказ.Склад = ДвижениеТоваров.Склад
			|			И ВсеПТУПогасившиеЗаказ.Назначение = ДвижениеТоваров.Назначение
			|			И ВсеПТУПогасившиеЗаказ.ПТУВГрафик = ДвижениеТоваров.Регистратор
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(ДвижениеТоваров.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДвижениеТоваров.Номенклатура,
			|	ДвижениеТоваров.Характеристика,
			|	ДвижениеТоваров.Склад,
			|	ДвижениеТоваров.Назначение,
			|	ДвижениеТоваров.Регистратор,
			|	ДвижениеТоваров.Распоряжение,
			|	ДвижениеТоваров.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеЗаказыПоставщикуПоПТУ.ЗаказПоставщику КАК ЗаказПоставщику,
			|	ВсеЗаказыПоставщикуПоПТУ.Номенклатура КАК Номенклатура,
			|	ВсеЗаказыПоставщикуПоПТУ.Характеристика КАК Характеристика,
			|	ВсеЗаказыПоставщикуПоПТУ.Склад КАК Склад,
			|	ВсеЗаказыПоставщикуПоПТУ.Назначение КАК Назначение,
			|	СУММА(ВсеЗаказыПоставщикуПоПТУ.ПланируемоеПоступление) КАК ПланируемоеПоступление,
			|	СУММА(ВсеЗаказыПоставщикуПоПТУ.ПланируемоеПоступлениеПодЗаказ) КАК ПланируемоеПоступлениеПодЗаказ,
			|	СУММА(ВсеЗаказыПоставщикуПоПТУ.ПланируемоеПоступлениеСНеподтвержденными) КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	СУММА(ВсеЗаказыПоставщикуПоПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными) КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными
			|ПОМЕСТИТЬ ВТ_ЗаказыПоставщику
			|ИЗ
			|	ВсеЗаказыПоставщикуПоПТУ КАК ВсеЗаказыПоставщикуПоПТУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсеЗаказыПоставщикуПоПТУ.ЗаказПоставщику,
			|	ВсеЗаказыПоставщикуПоПТУ.Номенклатура,
			|	ВсеЗаказыПоставщикуПоПТУ.Характеристика,
			|	ВсеЗаказыПоставщикуПоПТУ.Склад,
			|	ВсеЗаказыПоставщикуПоПТУ.Назначение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеЗаказыПоставщикуПоПТУ.Период КАК Период,
			|	ВсеЗаказыПоставщикуПоПТУ.ЗаказПоставщику КАК ЗаказПоставщику,
			|	ВсеЗаказыПоставщикуПоПТУ.ПТУ КАК ПТУ,
			|	ВсеЗаказыПоставщикуПоПТУ.ПланируемоеПоступление КАК ПланируемоеПоступление,
			|	ВсеЗаказыПоставщикуПоПТУ.ПланируемоеПоступлениеПодЗаказ КАК ПланируемоеПоступлениеПодЗаказ,
			|	ВсеЗаказыПоставщикуПоПТУ.ПланируемоеПоступлениеСНеподтвержденными КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	ВсеЗаказыПоставщикуПоПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными,
			|	ВсеЗаказыПоставщикуПоПТУ.Номенклатура КАК Номенклатура,
			|	ВсеЗаказыПоставщикуПоПТУ.Характеристика КАК Характеристика,
			|	ВсеЗаказыПоставщикуПоПТУ.Склад КАК Склад,
			|	ВсеЗаказыПоставщикуПоПТУ.Назначение КАК Назначение
			|ИЗ
			|	ВсеЗаказыПоставщикуПоПТУ КАК ВсеЗаказыПоставщикуПоПТУ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Склад,
			|	Номенклатура,
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДвижениеТоваров.Период КАК Период,
			|	ВТ_ЗаказыПоставщику.ЗаказПоставщику КАК ЗаказПоставщику,
			|	ДвижениеТоваров.Номенклатура КАК Номенклатура,
			|	ДвижениеТоваров.Характеристика КАК Характеристика,
			|	ДвижениеТоваров.Склад КАК Склад,
			|	ДвижениеТоваров.Назначение КАК Назначение,
			|	СУММА(ДвижениеТоваров.ПланируемоеПоступление) КАК ПланируемоеПоступление,
			|	СУММА(ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказ) КАК ПланируемоеПоступлениеПодЗаказ,
			|	СУММА(ДвижениеТоваров.ПланируемоеПоступлениеСНеподтвержденными) КАК ПланируемоеПоступлениеСНеподтвержденными,
			|	СУММА(ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказСНеподтвержденными) КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными
			|ИЗ
			|	ВТ_ЗаказыПоставщику КАК ВТ_ЗаказыПоставщику
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
			|		ПО ВТ_ЗаказыПоставщику.ЗаказПоставщику = ДвижениеТоваров.Регистратор
			|			И (ДвижениеТоваров.Распоряжение = ВТ_ЗаказыПоставщику.ЗаказПоставщику)
			|			И ВТ_ЗаказыПоставщику.Номенклатура = ДвижениеТоваров.Номенклатура
			|			И ВТ_ЗаказыПоставщику.Характеристика = ДвижениеТоваров.Характеристика
			|			И (ДвижениеТоваров.Склад = ВТ_ЗаказыПоставщику.Склад)
			|			И ВТ_ЗаказыПоставщику.Назначение = ДвижениеТоваров.Назначение
			|
			|СГРУППИРОВАТЬ ПО
			|	ДвижениеТоваров.Период,
			|	ДвижениеТоваров.Номенклатура,
			|	ДвижениеТоваров.Характеристика,
			|	ДвижениеТоваров.Склад,
			|	ДвижениеТоваров.Назначение,
			|	ВТ_ЗаказыПоставщику.ЗаказПоставщику
			|
			|УПОРЯДОЧИТЬ ПО
			|	Склад,
			|	Номенклатура,
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеПТУПогасившиеЗаказ.Номенклатура КАК Номенклатура,
			|	ВсеПТУПогасившиеЗаказ.Характеристика КАК Характеристика,
			|	ВсеПТУПогасившиеЗаказ.Склад КАК Склад,
			|	ВсеПТУПогасившиеЗаказ.Назначение КАК Назначение,
			|	ВсеПТУПогасившиеЗаказ.ПТУВГрафик КАК ПТУВГрафик,
			|	СУММА(ЕСТЬNULL(ГрафикПоступленияТоваров.КоличествоИзЗаказов, 0)) КАК КоличествоИзЗаказов,
			|	СУММА(ЕСТЬNULL(ГрафикПоступленияТоваров.КоличествоПодЗаказ, 0)) КАК КоличествоПодЗаказ,
			|	СУММА(ЕСТЬNULL(ГрафикПоступленияТоваров.КоличествоИзЗаказовСНеподтвержденными, 0)) КАК КоличествоИзЗаказовСНеподтвержденными,
			|	СУММА(ЕСТЬNULL(ГрафикПоступленияТоваров.КоличествоПодЗаказСНеподтвержденными, 0)) КАК Поле4
			|ИЗ
			|	ВсеПТУПогасившиеЗаказ КАК ВсеПТУПогасившиеЗаказ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикПоступленияТоваров КАК ГрафикПоступленияТоваров
			|		ПО ВсеПТУПогасившиеЗаказ.ПТУВГрафик = ГрафикПоступленияТоваров.Регистратор
			|			И ВсеПТУПогасившиеЗаказ.Номенклатура = ГрафикПоступленияТоваров.Номенклатура
			|			И ВсеПТУПогасившиеЗаказ.Характеристика = ГрафикПоступленияТоваров.Характеристика
			|			И ВсеПТУПогасившиеЗаказ.Склад = ГрафикПоступленияТоваров.Склад
			|			И ВсеПТУПогасившиеЗаказ.Назначение = ГрафикПоступленияТоваров.Назначение
			|ГДЕ
			|	(ЕСТЬNULL(ГрафикПоступленияТоваров.КоличествоИзЗаказов, 0) > 0
			|			ИЛИ ЕСТЬNULL(ГрафикПоступленияТоваров.КоличествоПодЗаказ, 0) > 0
			|			ИЛИ ЕСТЬNULL(ГрафикПоступленияТоваров.КоличествоИзЗаказовСНеподтвержденными, 0) > 0
			|			ИЛИ ЕСТЬNULL(ГрафикПоступленияТоваров.КоличествоПодЗаказСНеподтвержденными, 0) > 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсеПТУПогасившиеЗаказ.Номенклатура,
			|	ВсеПТУПогасившиеЗаказ.Характеристика,
			|	ВсеПТУПогасившиеЗаказ.Склад,
			|	ВсеПТУПогасившиеЗаказ.Назначение,
			|	ВсеПТУПогасившиеЗаказ.ПТУВГрафик";
КонецФункции	
// + [Rineco], [Шерстюк Ю.Ю.] [20.08.2021] 
// Задача: [№ 15211], [#]

// - [Rineco], [Шерстюк Ю.Ю.] [20.08.2021]
Процедура Рин1_РассчитатьСрокиТоваровПоГрафику(МассивЗаказов,ДопСвойства) Экспорт 
 // + [Rineco], [Шерстюк Ю.Ю.] [23.08.2021] 
 // Задача: [№ 15211], [если проводится заказ поставщику, то ищем ПТУ по нему в графике и если находим, то записываем новые даты из заказа поставщику]
 пТолькоЗаказыПоставщику = Истина;
 Для Каждого ЭлементМассива из МассивЗаказов Цикл 
	 Если ТипЗнч(ЭлементМассива) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
		 пТолькоЗаказыПоставщику = Ложь;
		 Прервать;
	 КонецЕсли;
  КонецЦикла;
 
  Если пТолькоЗаказыПоставщику Тогда 
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
						|	ДвижениеТоваров.Регистратор КАК ПТУВГрафик
						|ИЗ
						|	РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
						|ГДЕ
						|	ДвижениеТоваров.Распоряжение В (&Распоряжение)
						|	И ТИПЗНАЧЕНИЯ(ДвижениеТоваров.Регистратор) = ТИП(Документ.ПриобретениеТоваровУслуг)
						|
						|СГРУППИРОВАТЬ ПО
						|	ДвижениеТоваров.Регистратор" ;
	  Запрос.УстановитьПараметр("Распоряжение",МассивЗаказов);
	  пТаблицаПТУПоЗаказу = Запрос.Выполнить().Выгрузить();
	  МассивРаспоряжений = пТаблицаПТУПоЗаказу.ВыгрузитьКолонку("ПТУВГрафик");
	  //Заново пересчитаем график по ПТУ (как будто провели ПТУ, но только по регистру ГрафикПоступленияТоваров)
	  РегистрыНакопления.ДвижениеТоваров.РассчитатьИтогиРегистраОстаткиТоваровПоГрафику(МассивРаспоряжений, ДопСвойства);
	////Запрос = Новый Запрос;
	////МВТ = Новый МенеджерВременныхТаблиц;
	////Запрос.МенеджерВременныхТаблиц = МВТ;

	////Запрос.Текст = ТекстЗапросаДляРасчетаДатыПриПроведенииЗаказаПоставщику();
	////Запрос.УстановитьПараметр("Распоряжение",МассивРаспоряжений);
	////Попытка
	////	Результат = Запрос.ВыполнитьПакет();
	////	
	////	ТабПТУПоЗаказам =Результат[Результат.ВГраница()-1].Выгрузить();;	
	////	
	////	пТипЧисло = Новый ОписаниеТипов("Число");
	////	
	////	ТабГрафик = Результат[Результат.ВГраница()].Выгрузить();
	////	ТабЗаказыПоставщику = Результат[Результат.ВГраница()-1].Выгрузить();
	////	ТабЗаказыПоПТУ = Результат[Результат.ВГраница()-2].Выгрузить();
	////	
	////	ТабЗаказыПоставщику = Результат[Результат.ВГраница()-1].Выгрузить();
	////	ТабЗаказыПоставщику.Колонки.Добавить("ПТУ",Новый ОписаниеТипов("ДокументСсылка.ПриобретениеТоваровУслуг"));
	////	ТабЗаказыПоставщику.Колонки.Добавить("ПланируемоеПоступлениеПогашено",пТипЧисло); 
	////	ТабЗаказыПоставщику.Колонки.Добавить("ПланируемоеПоступлениеПодЗаказПогашено",пТипЧисло);
	////	ТабЗаказыПоставщику.Колонки.Добавить("ПланируемоеПоступлениеСНеподтвержденнымиПогашено",пТипЧисло);
	////	ТабЗаказыПоставщику.Колонки.Добавить("ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено",пТипЧисло);
	////    //распределяем ПТУ по строкам заказа поставщику, ранними ПТУ гасим ранние сроки заказа поставщику
	////    РаспределитьПТУПоСрокам(ТабЗаказыПоПТУ,ТабЗаказыПоставщику);
	////	//Сортируем по убыванию, полагая, что заказы закрываюся по ФИФО, а в очереди у нас остались с максимальной датой поставки
	////	ТабЗаказыПоставщику.Сортировать("Период Убыв");
	////	//НаборЗаписей = РегистрыНакопления.ДвижениеТоваров.СоздатьНаборЗаписей();
	////	//НаборЗаписей.Отбор.
	////	
	////	//ТабГрафикаЗаказов.Колонки.Добавить("ПТУ",Новый ОписаниеТипов("ДокументСсылка.ПриобретениеТоваровУслуг"));
	////	//ТабГрафикаЗаказов.Колонки.Добавить("ПланируемоеПоступлениеПогашено",пТипЧисло); 
	////	//ТабГрафикаЗаказов.Колонки.Добавить("ПланируемоеПоступлениеПодЗаказПогашено",пТипЧисло);
	////	//ТабГрафикаЗаказов.Колонки.Добавить("ПланируемоеПоступлениеСНеподтвержденнымиПогашено",пТипЧисло);
	////	//ТабГрафикаЗаказов.Колонки.Добавить("ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено",пТипЧисло);
	////Исключение
	////	Сообщить("Не удалось обновить сроки поставки в графике, обратитесь к администратору...");
	////КонецПопытки;
	////

 КонецЕсли;
 // - [Rineco], [Шерстюк Ю.Ю.] [23.08.2021]
          
КонецПроцедуры

// + [Rineco], [Шерстюк Ю.Ю.] [23.08.2021] 
// Задача: [№ 15244], [первый вариант, отказалась в пользу актуализации графика по списку ПТУ]
//Функция РаспределитьПТУПоСрокам(ТабЗаказыПоПТУ,ТабЗаказыПоставщику)
//	Для Каждого СтрПТУ из ТабЗаказыПоПТУ Цикл
//		пСтруктураОтбора = Новый Структура;
//		пСтруктураОтбора.Вставить("Номенклатура", СтрПТУ.Номенклатура);
//		пСтруктураОтбора.Вставить("Характеристика", СтрПТУ.Характеристика);
//		пСтруктураОтбора.Вставить("Назначение", СтрПТУ.Назначение);
//		пСтруктураОтбора.Вставить("Склад", СтрПТУ.Склад);
//		пСтруктураОтбора.Вставить("ЗаказПоставщику", СтрПТУ.ЗаказПоставщику);
//		пМассивЗаказов = ТабЗаказыПоставщику.НайтиСтроки(пСтруктураОтбора);
//		пКоличествоСтрокТабЗаказыПоставщику = ТабЗаказыПоставщику.Количество();
//		Если пКоличествоСтрокТабЗаказыПоставщику > 0 Тогда 
//			Для Каждого ЭлементМассиваЗаказов из пМассивЗаказов Цикл
//				Если ЭлементМассиваЗаказов.ПланируемоеПоступление > 0
//					или ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ > 0
//					или ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными > 0
//					или ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными > 0 Тогда
//					
//					Если (ЭлементМассиваЗаказов.ПланируемоеПоступление <= СтрПТУ.ПланируемоеПоступление и СтрПТУ.ПланируемоеПоступление > 0)
//						или (ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ <= СтрПТУ.ПланируемоеПоступлениеПодЗаказ и  СтрПТУ.ПланируемоеПоступлениеПодЗаказ  > 0)
//						или (ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными <= СтрПТУ.ПланируемоеПоступлениеСНеподтвержденными и СтрПТУ.ПланируемоеПоступлениеСНеподтвержденными  > 0)
//						или (ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными <= СтрПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными и СтрПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными > 0) Тогда
//						//уменьшаем нераспределенное
//						СтрПТУ.ПланируемоеПоступление =  СтрПТУ.ПланируемоеПоступление - ЭлементМассиваЗаказов.ПланируемоеПоступление;
//						СтрПТУ.ПланируемоеПоступлениеПодЗаказ =  СтрПТУ.ПланируемоеПоступлениеПодЗаказ - ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ;
//						СтрПТУ.ПланируемоеПоступлениеСНеподтвержденными = СтрПТУ.ПланируемоеПоступлениеСНеподтвержденными - ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными;
//						СтрПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = СтрПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными - ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными;
//						
//						//запоминаем погашенное количество
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеПогашено = ЭлементМассиваЗаказов.ПланируемоеПоступление;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказПогашено =  ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденнымиПогашено = ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено = ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными;
//						
//						//строка по заказу полностью погашена
//						ЭлементМассиваЗаказов.ПланируемоеПоступление = 0;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ = 0;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными = 0;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = 0;
//						ЭлементМассиваЗаказов.ПТУ = СтрПТУ.ПТУ;
//						
//					Иначе
//						//уменьшаем на количество погашенного в текущей строке и добавим новую строку с полностью погашенными
//						ЭлементМассиваЗаказов.ПланируемоеПоступление = ЭлементМассиваЗаказов.ПланируемоеПоступление - СтрПТУ.ПланируемоеПоступление;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ = ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказ - СтрПТУ.ПланируемоеПоступлениеПодЗаказ;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными = ЭлементМассиваЗаказов.ПланируемоеПоступлениеСНеподтвержденными - СтрПТУ.ПланируемоеПоступлениеСНеподтвержденными;
//						ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = ЭлементМассиваЗаказов.ПланируемоеПоступлениеПодЗаказСНеподтвержденными - СтрПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными;
//						
//						пНоваяСтрока = ТабЗаказыПоставщику.Добавить();
//						//запоминаем погашенное количество
//						ЗаполнитьЗначенияСвойств(пНоваяСтрока,ЭлементМассиваЗаказов);
//						пНоваяСтрока.ПланируемоеПоступлениеПогашено = СтрПТУ.ПланируемоеПоступление;
//						пНоваяСтрока.ПланируемоеПоступлениеПодЗаказПогашено =  СтрПТУ.ПланируемоеПоступлениеПодЗаказ;
//						пНоваяСтрока.ПланируемоеПоступлениеСНеподтвержденнымиПогашено = СтрПТУ.ПланируемоеПоступлениеСНеподтвержденными;
//						пНоваяСтрока.ПланируемоеПоступлениеПодЗаказСНеподтвержденнымиПогашено = СтрПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными;
//						
//						СтрПТУ.ПланируемоеПоступление = 0;
//						СтрПТУ.ПланируемоеПоступлениеПодЗаказ = 0;
//						СтрПТУ.ПланируемоеПоступлениеСНеподтвержденными = 0;
//						СтрПТУ.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = 0;
//						
//						пНоваяСтрока.ПланируемоеПоступление = 0;
//						пНоваяСтрока.ПланируемоеПоступлениеПодЗаказ = 0;
//						пНоваяСтрока.ПланируемоеПоступлениеСНеподтвержденными = 0;
//						пНоваяСтрока.ПланируемоеПоступлениеПодЗаказСНеподтвержденными = 0;
//						пНоваяСтрока.ПТУ = СтрПТУ.ПТУ;
//						
//						Прервать; //распределили строку
//					КонецЕсли;
//					
//				Иначе
//					Продолжить;
//				КонецЕсли;
//			КонецЦикла;
//		КонецЕсли;
//	КонецЦикла;	
//	Возврат ТабЗаказыПоставщику;
//КонецФункции
// - [Rineco], [Шерстюк Ю.Ю.] [23.08.2021]


