
&Вместо("ПриЗаписи")
Процедура Рин1_ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДопСвойства = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("ОбеспечениеЗаказовДополнительныеСвойства", ДопСвойства) Тогда
		ДопСвойства = Новый Структура();
	КонецЕсли;
	МассивРаспоряжений = ДополнительныеСвойства.ТаблицаРаспоряжений.ВыгрузитьКолонку("Распоряжение");
	РегистрыНакопления.ДвижениеТоваров.РассчитатьИтогиРегистраОстаткиТоваровПоГрафику(МассивРаспоряжений, ДопСвойства);
	// + [Rineco], [Шерстюк Ю.Ю.] [23.08.2021] 
	// Задача: [№ 15211], [# дообработка графика поступлений, указываем сроки из Заказа поставщику, при проведении Заказа поставщику]
	РегистрыНакопления.ДвижениеТоваров.Рин1_РассчитатьСрокиТоваровПоГрафику(ДополнительныеСвойства.ТаблицаРаспоряжений.ВыгрузитьКолонку("Распоряжение"),ДопСвойства);
	// - [Rineco], [Шерстюк Ю.Ю.] [23.08.2021]
	

КонецПроцедуры
