
&НаСервере
Функция ПолучитьМассивИтоговыхДанных()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(УточнениеНоменклатуры.Выгрузить())
	
КонецФункции

&НаКлиенте
Процедура Перенести(Команда)
	
	ТЧУТочнение = ПолучитьМассивИтоговыхДанных();
	
	Закрыть(ТЧУТочнение);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		
	
	Если Параметры.Свойство("ТаблицаУточнения") Тогда
		
		Для Каждого Стр Из Параметры.ТаблицаУточнения Цикл
			
			НоваяСтрока = УточнениеНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры






&НаСервере
Процедура ОбновитьДанныеПоНоменлатуреНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ГИГ_НоменклатураПроизводителей.Ссылка КАК НоменклатураПроизводителей,
	|	ГИГ_НоменклатураПроизводителей.Номенклатура КАК Номенклатура,
	|	ГИГ_НоменклатураПроизводителей.Номенклатура.Артикул КАК Артикул,
	|	ГИГ_НоменклатураПроизводителей.Артикул КАК АртикулПроизводителя,
	|	ГИГ_НоменклатураПроизводителей.Производитель КАК Производитель
	|ИЗ
	|	Справочник.ГИГ_НоменклатураПроизводителей КАК ГИГ_НоменклатураПроизводителей
	|ГДЕ
	|	ГИГ_НоменклатураПроизводителей.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", УточнениеНоменклатуры.Выгрузить().ВыгрузитьКолонку("НоменклатураПроизводителей"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НоменклатураПроизводителей", Выборка.НоменклатураПроизводителей);
		НайденныеСтроки = УточнениеНоменклатуры.НайтиСтроки(ПараметрыОтбора); 

		Для Каждого Стр Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(Стр, Выборка, "Номенклатура, АртикулПроизводителя, Артикул, Производитель");
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоНоменлатуре(Команда)
	
	ОбновитьДанныеПоНоменлатуреНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруПоНоменклатуреПроизводителяНаСервере(НоменклатураПроизводителя)
	
	Результат = НоменклатураПроизводителя.Номенклатура;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда		
		
		ВидНоменклатурыДляСоздания = НоменклатураПроизводителя.ВидНоменклатуры;
		
		Если ЗначениеЗаполнено(ВидНоменклатурыДляСоздания) Тогда
			
			Результат = ГИГ_МодульВызовСервера.СозданиеНоменклатурыНаСервере(НоменклатураПроизводителя, ВидНоменклатурыДляСоздания);
			
		Иначе
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "У номенклатуры производителя """ + Строка(НоменклатураПроизводителя) + """ не заполнен реквизит ""Вид номенклатуры""";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАртикулНоменклатуры(Номенклатура)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Результат = Номенклатура.Артикул;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоздатьНоменклатуруПоНоменклатуреПроизводителя(Команда)
	
	Для Каждого Стр Из Элементы.УточнениеНоменклатуры.ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = УточнениеНоменклатуры.НайтиПоИдентификатору(Стр);
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураПроизводителей) Тогда
			
			ТекущаяСтрока.Номенклатура = СоздатьНоменклатуруПоНоменклатуреПроизводителяНаСервере(ТекущаяСтрока.НоменклатураПроизводителей);
			ТекущаяСтрока.Артикул = ПолучитьАртикулНоменклатуры(ТекущаяСтрока.Номенклатура);
						
		Иначе
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "В указанной строке не заполнена номенклатура производителя";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//++Гольм А.А. (Гигабайт)
&НаКлиенте
Процедура ВыделитьВсё(Команда)
	
	Для Каждого ТекСтр Из Элементы.УточнениеНоменклатуры.ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = УточнениеНоменклатуры.Получить(ТекСтр);
		ТекущаяСтрока.ВыбратьСтроку = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсё(Команда)
	
	Для Каждого ТекСтр Из Элементы.УточнениеНоменклатуры.ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = УточнениеНоменклатуры.Получить(ТекСтр);
		ТекущаяСтрока.ВыбратьСтроку = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры
//--Гольм А.А. (Гигабайт)