
#Область РегистрацияДопОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
    ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");

    ПараметрыРегистрации.Вставить("Наименование", "Обработка загрузки остатков на складе поставщика");
    ПараметрыРегистрации.Вставить("Версия", "1.0");
    ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
    ПараметрыРегистрации.Вставить("Информация", "Обработка загрузки остатков на складе поставщика");
    ПараметрыРегистрации.Вставить("ВерсияБСП", "2.0.7.6");
    ТаблицаКоманд = ПолучитьТаблицуКоманд();

	ДобавитьКоманду(ТаблицаКоманд,
		"Обработка загрузки остатков на складе поставщика",
		"ЗагрузкаОстатковНаСкладеПоставщика",
		"ОткрытиеФормы",
		Истина,
		"");
	
    ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
    Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(Идентификатор, ПараметрыКоманды) Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура Печать(КоллекцияПечатныхФорм,ТаблНесоотвествий) Экспорт 
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"НеНайденныеПозиции",
			НСтр("ru='Список не загруженной номенклатуры'"),
			ПечатьМакетаНесоответсвий(ТаблНесоотвествий))
КонецПроцедуры

Функция ПечатьМакетаНесоответсвий(ТаблицаДанныхНесоответсвий) 
	ТаблДокумент = Новый ТабличныйДокумент;
	Макет = ЭтотОбъект.ПолучитьМакет("НеНайденныеПозиции");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	ТаблДокумент.Вывести(ОбластьШапка);
	Для Каждого СтрокаТаблицы из ТаблицаДанныхНесоответсвий Цикл 
		ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
		ТаблДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;	
	Возврат ТаблДокумент;
КонецФункции