
&НаСервере
Процедура Рин1_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ПроцедураПриСозданииЧтенииНаСервере();
	
	Если СтрНайти(Параметры.ИмяПоля, "РМК")>0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.РМК;
	КонецЕсли;
	
	Элементы.СкидкиНаценки.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоПользователям");
	Элементы.РМК.Видимость           = ПолучитьФункциональнуюОпцию("ИспользоватьРозничныеПродажи");
	
	Если Элементы.СкидкиНаценки.Видимость И НЕ Элементы.РМК.Видимость Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СкидкиНаценки;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	Если Не Элементы.СкидкиНаценки.Видимость И Элементы.РМК.Видимость Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.РМК;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	// добавлено ГИГ начало
	Элементы.Ограничения.Видимость         = Истина;
	Если Элементы.Ограничения.Видимость и Элементы.СкидкиНаценки.Видимость или Элементы.РМК.Видимость Тогда
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.Ограничения;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	//Добавлено ГИГ конец
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры
