
&После("ЗаполнитьДокументНаОснованииЗаказа")
Процедура Рин1_ЗаполнитьДокументНаОснованииЗаказа(Знач ЗаказКлиента)
	
	Для каждого Стр Из Товары Цикл
		
		Стр.Рин1_ЗаказКлиента = ЗаказКлиента;
		
	КонецЦикла;
	
КонецПроцедуры

&После("ИнициализироватьДокумент")
Процедура Рин1_ИнициализироватьДокумент(ДанныеЗаполнения)
	//++Шерстюк Ю.Ю. Задача 7625
	Если ЗначениеЗаполнено(Договор) Тогда 
		Менеджер = Договор.Менеджер;
		Подразделение = Договор.Подразделение;
	КонецЕсли;
    //--Шерстюк Ю.Ю.

КонецПроцедуры
